{
    "Generate Support": "Stützstruktur generieren",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "Damit werden Strukturen zur Unterstützung von Modellteilen mit Überhängen generiert. Ohne diese Strukturen würden solche Teile während des Druckvorgangs zusammenfallen.",
    "Build Plate Adhesion Type": "Druckplattenhaftungstyp",
    "Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "Verschiedene Optionen, die die Materialbereitstellung für die Extrusion und die Haftung am Druckbett verbessern. Durch die Brim-Funktion wird ein flacher, einschichtiger Bereich um die Basis des Modells herum hinzugefügt, um Warping zu verhindern. Durch die Raft-Funktion wird ein dickes Gitter mit Dach unter dem Modell hinzugefügt. Das Skirt-Element ist eine Linie, die um das Modell herum gedruckt wird, aber nicht mit dem Modell verbunden ist.",
    "Initial Layer Line Width": "Linienbreite der ersten Schicht",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "Multiplikator der Linienbreite der ersten Schicht. Eine Erhöhung dieses Werts verbessert möglicherweise die Betthaftung.",
    "Spiralize Outer Contour": "Spiralisieren der äußeren Konturen",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "Durch Spiralisieren wird die Z-Bewegung der äußeren Kante geglättet. Dies führt zu einem konstanten Z-Anstieg des gesamten Drucks. Diese Funktion wandelt ein solides Modell in einen Druck mit Einzelwänden und einem soliden Boden um. Diese Funktion sollte nur aktiviert werden, wenn jede Schicht nur ein einzelnes Teil enthält.",
    "Surface Mode": "Oberflächenmodus",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "Behandelt das Modell nur als Oberfläche, Volumen oder Volumen mit losen Oberflächen. Der Normaldruck-Modus druckt nur umschlossene Volumen. „Oberfläche“ druckt eine einzelne Wand und verfolgt die Mesh-Oberfläche ohne Füllung und ohne obere/untere Außenhaut. „Beide“ druckt umschlossene Volumen wie üblich und alle verbleibenden Polygone als Oberflächen.",
    "Travel Speed": "Bewegungsgeschwindigkeit",
    "The speed at which travel moves are made.": "Die Geschwindigkeit, mit der Bewegungen durchgeführt werden.",
    "Top/Bottom Speed": "Geschwindigkeit obere/untere Schicht",
    "The speed at which top/bottom layers are printed.": "Die Geschwindigkeit, mit der die oberen/unteren Schichten gedruckt werden.",
    "Inner Wall Speed": "Geschwindigkeit Innenwand",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "Die Geschwindigkeit, mit der alle Innenwände gedruckt werden. Wenn die Innenwand schneller als die Außenwand gedruckt wird, wird die Druckzeit reduziert. Es wird empfohlen, diese Geschwindigkeit zwischen der Geschwindigkeit für die Außenwand und der Füllgeschwindigkeit einzustellen.",
    "Outer Wall Speed": "Geschwindigkeit Außenwand",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "Die Geschwindigkeit, mit der die Außenwände gedruckt werden. Durch das Drucken der Außenwand bei einer niedrigeren Geschwindigkeit wird eine bessere Endqualität der Außenhaut erreicht. Wenn allerdings zwischen der Geschwindigkeit für die Innenwand und jener für die Außenwand ein zu großer Unterschied besteht, wird die Qualität negativ beeinträchtigt.",
    "Infill Speed": "Füllgeschwindigkeit",
    "The speed at which infill is printed.": "Die Geschwindigkeit, mit der die Füllung gedruckt wird.",
    "Print Speed": "Druckgeschwindigkeit",
    "The speed at which printing happens.": "Die Geschwindigkeit, mit der gedruckt wird.",
    "Retraction Speed": "Einzugsgeschwindigkeit",
    "The speed at which the filament is retracted and primed during a retraction move.": "Die Geschwindigkeit, mit der das Filament während einer Einzugsbewegung eingezogen und zurückgeschoben wird.",
    "Retraction Distance": "Einzugsabstand",
    "The length of material retracted during a retraction move.": "Die Länge des Materials, das während der Einzugsbewegung eingezogen wird.",
    "Retract at Layer Change": "Einziehen bei Schichtänderung",
    "Retract the filament when the nozzle is moving to the next layer.": "Ziehen Sie das Filament ein, wenn die Düse zur nächsten Schicht fährt. ",
    "Enable Retraction": "Einzug aktivieren",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "Das Filament wird eingezogen, wenn sich die Düse über einen nicht zu bedruckenden Bereich bewegt. ",
    "Infill Density": "Fülldichte",
    "Adjusts the density of infill of the print.": "Passt die Fülldichte des Drucks an.",
    "Bottom Thickness": "Untere Dicke",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "Die Dicke der unteren Schichten des Drucks. Dieser Wert geteilt durch die Schichtdicke bestimmt die Anzahl der unteren Schichten.",
    "Top Thickness": "Obere Dicke",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "Die Dicke der oberen Schichten des Drucks. Dieser Wert geteilt durch die Schichtdicke bestimmt die Anzahl der oberen Schichten.",
    "Wall Thickness": "Wanddicke",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "Die Dicke der Wände in horizontaler Richtung. Dieser Wert geteilt durch die Wandliniendicke bestimmt die Anzahl der Wände.",
    "Initial Layer Height": "Dicke der ersten Schicht",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.": "Die Dicke der ersten Schicht in mm. Eine dicke erste Schicht erleichtert die Haftung am Druckbett.",
    "Layer Height": "Schichtdicke",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "Die Dicke jeder Schicht in mm. Bei höheren Werten werden schnellere Drucke mit niedrigerer Auflösung hergestellt, bei niedrigeren Werten langsamere Drucke mit höherer Auflösung.",
    "Z Hop Height": "Z-Spring Höhe",
    "The height difference when performing a Z Hop.": "Der Höhenunterschied bei Ausführung eines Z-Sprungs.",
    "Z Hop When Retracted": "Z-Sprung beim Einziehen",
    "Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.": "Nach dem Einzug wird das Druckbett gesenkt, um einen Abstand zwischen Düse und Druck herzustellen. Das verhindert, dass die Düse den Druck während der Bewegungen anschlägt und verringert die Möglichkeit, dass der Druck vom Druckbett heruntergestoßen wird.",
    "Initial Layer Travel Speed": "Bewegungsgeschwindigkeit für die erste Schicht",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "Die Bewegungsgeschwindigkeit für die erste Schicht. Ein niedrigerer Wert wird empfohlen, um das Wegziehen zuvor gedruckter Teile von der Druckplatte zu vermeiden. Der Wert dieser Einstellung kann automatisch aus dem Verhältnis zwischen Bewegungsgeschwindigkeit und Druckgeschwindigkeit errechnet werden.",
    "Initial Layer Print Speed": "Druckgeschwindigkeit für die erste Schicht",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.": "Die Druckgeschwindigkeit für die erste Schicht. Ein niedrigerer Wert wird empfohlen, um die Haftung an der Druckplatte zu verbessern.",
    "Has Heated Build Plate": "Mit beheizter Druckplatte",
    "Whether the machine has a heated build plate present.": "Option für vorhandene beheizte Druckplatte.",
    "Printing Temperature": "Drucktemperatur",
    "The temperature used for printing.": "Die Temperatur, die für das Drucken verwendet wird.",
    "Printing Temperature Initial Layer": "Drucktemperatur erste Schicht",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "Die Temperatur, die für das Drucken der ersten Schicht verwendet wird. Wählen Sie hier 0, um eine spezielle Behandlung der ersten Schicht zu deaktivieren.",
    "Final Printing Temperature": "Endgültige Drucktemperatur",
    "The temperature to which to already start cooling down just before the end of printing.": "Die Temperatur, bei der das Abkühlen bereits beginnen kann, bevor der Druck beendet wird.",
    "Build Plate Temperature": "Temperatur Druckplatte",
    "Build Plate Temperature Initial Layer": "Temperatur der Druckplatte für die erste Schicht",
    "The temperature used for the heated build plate at the first layer.": "Die Temperatur, die für die erhitzte Druckplatte an der ersten Schicht verwendet wird.",
    "Diameter": "Durchmesser",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "Der Durchmesser des verwendeten Filaments wird angepasst. Stellen Sie hier den Durchmesser des verwendeten Filaments ein.",
    "Flow": "Fluss",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "Fluss-Kompensation: Die extrudierte Materialmenge wird mit diesem Wert multipliziert.",
    "Records: {{from}} - {{to}} / {{total}}": "Aufnahmen {{from}} - {{to}} / {{total}}",
    "Records: {{total}}": "Aufnahmen {{total}}",
    "{{pageLength}} per page": "{{pageLength}} pro Seite",
    "This is an alpha feature that helps you get started with CNC Carving. Make sure you": "Dies ist eine Alpha-Funktion, die Ihnen den Einstieg in das Fräsen mit CNC ermöglicht. Stellen Sie sicher",
    "Read This First - Safety Information": "Information Zuerst lesen - Sicherheitshinweise",
    "before any further instructions.": "Vor jeder weiteren Anweisung.",
    "Don't show again in current session": "In der aktuellen Sitzung nicht mehr anzeigen",
    "Size": "Größe",
    "Work Speed": "Arbeitsgeschwindigkeit",
    "Plunge Speed": "Eintauchgeschwindigkeit",
    "Jog Speed": "Jog-Geschwindigkeit",
    "Grey Level": "Graustufe",
    "Target Depth": "Zieltiefe",
    "Cutting Diameter": "Schnittdurchmesser",
    "Stop Height": "Stopphöhe",
    "New Update Available": "Neues Update verfügbar",
    "Command succeeded": "Befehl erfolgreich",
    "Command failed ({{err}})": "Befehl fehlgeschlagen ({{err}})",
    "Options": "Optionen",
    "Command": "Befehl",
    "Show notifications": "Benachrichtigungen anzeigen",
    "Store": "Store",
    "Server has halted intentionally by you": "Server wurde absichtlich von Ihnen angehalten",
    "Emergency stop triggered, Please restart the Snapmaker then reconnect.": "Notstopp ausgelöst, Bitte starten Sie den Snapmaker neu und verbinden Sie erneut.",
    "Reload": "Neuladen",
    "Reset": "Zurücksetzen",
    "STOP": "STOPP",
    "User Manual & FAQ": "Benutzerhandbuch & FAQ",
    "Forum": "Forum",
    "Learn more": "Mehr erfahren",
    "Downloads": "Downloads",
    "Cancel": "Stornieren",
    "OK": "OK",
    "Loading...": "Wird geladen...",
    "Enabled": "Aktiviert",
    "Disabled": "Deaktiviert",
    "Action": "Aktion",
    "Settings": "Einstellungen",
    "G-code": "G-Code",
    "Language": "Sprache",
    "Save Changes": "Änderungen speichern",
    "General": "Allgemeines",
    "Workspace": "Arbeitsplatz",
    "Restore Defaults": "Standardeinstellungen wiederherstellen",
    "Are you sure you want to restore the default settings?": "Möchten Sie die Standardeinstellungen wirklich wiederherstellen?",
    "3D Printing G-code Generator": "3D-Druck G-code Generator",
    "Laser G-code Generator": "Laser G-code Generator",
    "CNC G-code Generator": "CNC G-code Generator",
    "Remove Widget": "Widget entfernen",
    "Are you sure you want to remove this widget?": "Möchten Sie dieses Widget wirklich entfernen?",
    "On": "Ein",
    "Off": "Aus",
    "Visualizer Widget": "Visualizer-Widget",
    "This widget visualizes a G-code file and simulates the tool path.": "Dieses Widget visualisiert eine G-code-Datei und simuliert den Werkzeugweg.",
    "Connection Widget": "Verbindungs-Widget",
    "This widget lets you establish a connection to a serial port.": "Mit diesem Widget können Sie eine Verbindung zu einem seriellen Port herstellen.",
    "Console Widget": "Konsolen-Widget",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "Mit diesem Widget können Sie Daten an die CNC-Steuerung lesen und schreiben, die an eine serielle Schnittstelle angeschlossen ist.",
    "Grbl Widget": "Grbl-Widget",
    "This widget can view Grbl state and settings.": "Dieses Widget kann den Grbl-Status und die Einstellungen anzeigen.",
    "Marlin Widget": "Marlin-Widget",
    "This widget can view Marlin state and settings.": "Dieses Widget kann den Marlin-Status und die Einstellungen anzeigen.",
    "Smoothie Widget": "Smoothie-Widget",
    "This widget can view Smoothie state and settings.": "Dieses Widget kann den Smoothie-Status und die Einstellungen anzeigen.",
    "TinyG Widget": "TinyG-Widget",
    "This widget can view TinyG state and settings.": "Dieses Widget kann den Status und die Einstellungen von TinyG anzeigen.",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Dieses Widget zeigt die XYZ-Position an. Es beinhaltet Jog-Controls, Homing und Achsen-Nullstellung.",
    "G-code Widget": "G-Code-Widget",
    "This widget shows the current status of G-code commands.": "Dieses Widget zeigt den aktuellen Status von G-code-Befehlen an.",
    "Laser Widget": "Laser-Widget",
    "This widget allows you control laser intensity and turn the laser on/off.": "Mit diesem Widget können Sie die Laserintensität steuern und den Laser ein- und ausschalten.",
    "Webcam Widget": "Webcam-Widget",
    "This widget lets you monitor a webcam.": "Mit diesem Widget können Sie eine Webcam überwachen.",
    "Widgets": "Widgets",
    "Server has stopped working": "Der Server funktioniert nicht mehr",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "Ein Problem hat dazu geführt, dass der Server nicht mehr ordnungsgemäß funktioniert. Überprüfen Sie den Serverstatus und versuchen Sie es erneut.",
    "Close": "Schließen",
    "This field is required.": "Dieses Feld wird benötigt.",
    "Passwords should be equal.": "Passwörter sollten gleich sein.",
    "mm": "mm",
    "in": "zoll",
    "Axis": "Achse",
    "Work Position": "Arbeitsposition",
    "Go To Work Zero On X Axis (G0 X0)": "Go To Work Zero auf X Achse (G0 X0)",
    "Zero Out Temporary X Axis (G92 X0)": "Zero-Out Temporäre X Achse (G92 X0)",
    "Go To Work Zero On Y Axis (G0 Y0)": "Go To Work Zero auf Y Achse (G0 Y0)",
    "Zero Out Temporary Y Axis (G92 Y0)": "Zero-Out Temporäre Y Achse (G92 Y0)",
    "Go To Work Zero On Z Axis (G0 Z0)": "Go To Work Zero auf  Z Achse (G0 Z0)",
    "Zero Out Temporary Z Axis (G92 Z0)": "Zero-Out Temporäre Z Achse (G92 Z0)",
    "Expand": "Erweitern",
    "Collapse": "Zusammenklappen",
    "More": "Mehr",
    "Enter Full Screen": "Vollbildmodus aktivieren",
    "Exit Full Screen": "Vollbildmodus beenden",
    "User Defined": "Benutzerdefiniert",
    "Custom distance for every move operation": "Individueller Abstand für jede Bewegung",
    "Increase custom distance by one unit": "Erhöhen Sie den benutzerdefinierten Abstand um eine Einheit",
    "Decrease custom distance by one unit": "Verringern Sie den benutzerdefinierten Abstand um eine Einheit",
    "Move X- Y+": "X- Y+ verschieben",
    "Move Y+": "Y+ verschieben",
    "Move X+ Y+": "X+ Y+ verschieben",
    "Move Z+": "Z+ verschieben",
    "Move X-": "X- verschieben",
    "Move To XY Zero (G0 X0 Y0)": "Zu XY Null bewegen (G0 X0 Y0)",
    "Move X+": "X+ verschieben",
    "Move To Z Zero (G0 Z0)": "Gehe zu Z Null (G0 Z0)",
    "Move X- Y-": "X- Y- verschieben",
    "Move Y-": "Y- verschieben",
    "Move X+ Y-": "X+ Y- verschieben",
    "Move Z-": "Z- bewegen",
    "Right": "Rechts",
    "Left": "Links",
    "Up": "Hoch",
    "Down": "Runter",
    "Page Up": "Seite nach oben",
    "Page Down": "Seite nach unten",
    "0.1x Move": "0.1x Bewegen",
    "Alt": "Alt",
    "10x Move": "10x Bewegen",
    "⇧ Shift": "⇧ Shift",
    "Run Boundary": "Grenze ausführen",
    "Click to check the boundary of the image to be engraved.": "Klicken Sie, um die Grenze des zu gravierenden Bildes zu überprüfen.",
    "Go To Work Origin": "Zum Ursprung gehen",
    "Move the head to the last saved work origin.": "Kopf zum letzten gespeicherten Arbeitsursprung verschieben.",
    "Set Work Origin": "Arbeitsursprung festlegen",
    "Set the current position of the head as the work origin.": "Stellen Sie die aktuelle Position des Kopfes als Arbeitsursprung ein.",
    "Shuttle Settings": "Shuttle-Einstellungen",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "Vorschubbereich: {{min}} - {{max}} mm/min",
    "Repeat Rate: {{hertz}}Hz": "Wiederholungsrate: {{hertz}} Hz",
    "60 Times per Second": "60 Mal pro Sekunde",
    "45 Times per Second": "45 Mal pro Sekunde",
    "30 Times per Second": "30 Mal pro Sekunde",
    "15 Times per Second": "15 Mal pro Sekunde",
    "10 Times per Second": "10 Mal pro Sekunde",
    "5 Times per Second": "5 Mal pro Sekunde",
    "2 Times per Second": "2 Mal pro Sekunde",
    "Once Every Second": "Einmal jede Sekunde",
    "Distance Overshoot: {{overshoot}}x": "Distanzüberschreitung: {{overshoot}}x",
    "Determines how fast the tool moves when it’s not carving.": "Festlegen, wie schnell sich das Werkzeug bewegt, wenn nicht bearbeitet wird.",
    "Determines how fast the tool feeds into the material.": "Bestimmen, wie schnell das Werkzeug in das Material einfährt.",
    "Generate G-code": "G-Code generieren",
    "Output": "Ausgang",
    "Load G-code to Workspace": "G-Code in den Arbeitsbereich laden",
    "Export G-code to file": "G-Code in Datei exportieren",
    "Carve Path": "Schnitzweg",
    "Select a carve path:": "Einen Schnitzpfad auswählen:",
    "Carve along the contour of the image.": "Schnitzen entlang der Kontur des Bildes.",
    "Carve along the shape of the image.": "Schnitzpfad entlang der Form des Bildes.",
    "Outline": "Aussenlinie",
    "On the Path": "auf dem Pfad",
    "Choose carve path": "Wähle Schnitzpfad",
    "Size (mm)": "Grösse (mm)",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "Geben Sie die Größe des eingravierten Bildes ein. Die Größe kann nicht größer als 125 x 125 mm oder die Größe des Materials sein.",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "Geben Sie die Tiefe des geschnitzten Bildes ein. Die Tiefe kann nicht tiefer als die Schaftlänge sein.",
    "Step Down": "Schritt nach unten",
    "Enter the depth of each carving step.": "Geben Sie die Tiefe für jeden Schnitzschritt ein.",
    "Jog Height": "Jog-Höhe",
    "The distance between the tool and the material when it’s not carving.": "Der Abstand zwischen dem Werkzeug und dem Material, wenn nicht bearbeitet wird.",
    "The distance between the tool and the material when the machine stops.": "Der Abstand zwischen Werkzeug und Material beim Anhalten der Gerät.",
    "Alignment": "Ausrichtung",
    "None": "Keine",
    "Tab Height": "Tabhöhe",
    "Enter the height of the tabs.": "Geben Sie die Höhe der Tabs ein.",
    "Tab Space": "Tabulatorraum",
    "Enter the space between any two tabs.": "Geben Sie den Abstand zwischen zwei beliebigen Tabs ein.",
    "Tab Width": "Tabulatorbreite",
    "Enter the width of the tabs.": "Geben Sie die Breite der Tabs ein.",
    "Preview": "Vorschau",
    "Carving Tool": "Schnitzwerkzeug",
    "Carving V-Bit": "Schnitz-V-Bit",
    "Flat End Mill": "Flache Schaftfräser",
    "Ball End Mill": "Kugelfräser",
    "Use Other Bit": "Anderes Werkzeug verwenden",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "Geben Sie den Durchmesser der breitesten Stelle der Klinge ein. Bitte beachten Sie, dass es sich nicht um den Schaftdurchmesser handelt.",
    "For the carving bits that we provide, please enter the following value:": "Für die von uns bereitgestellten Schnitzwerkzeuge geben Sie bitte folgenden Wert ein:",
    "Point Angle": "Punktwinkel",
    "Enter the angle of the blade.": "Geben Sie den Winkel der Klinge ein.",
    "fullscreen": "Vollbild",
    "Manufacturer: {{manufacturer}}": "Hersteller: {{Hersteller}}",
    "No ports available": "Keine Ports verfügbar",
    "Choose a port": "Wählen Sie einen Port",
    "Refresh": "Aktualisieren",
    "Open": "Öffnen",
    "Connected to {{-port}}": "Verbunden mit {{-Port}}",
    "Console": "Konsole",
    "Min": "Min",
    "Max": "Max",
    "Dimension": "Abmessungen",
    "Sent": "Gesendet",
    "Received": "Empfangen",
    "Start Time": "Startzeit",
    "Elapsed Time": "Verstrichene Zeit",
    "Finish Time": "Endzeit",
    "Remaining Time": "Verbleibende Zeit",
    "Laser": "Laser",
    "Power (%)": "Leistung (%)",
    "Determines how fast the machine moves when it’s not engraving.": "Legt fest, wie schnell sich die Gerät bewegt, wenn sie nicht graviert.",
    "Determines how fast the machine moves when it’s engraving.": "Legt fest, wie schnell sich die Gerät beim Gravieren bewegt.",
    "Dwell Time": "Verweilzeit",
    "Determines how long the laser keeps on when it’s engraving a dot.": "Bestimmt, wie lange der Laser beim Gravieren eines Punktes weiterläuft.",
    "B&W": "S&W",
    "Set the proportion of the black color based on the original color of the image.": "Stellen Sie den Anteil der schwarzen Farbe basierend auf der Originalfarbe des Bildes ein.",
    "Line Direction": "Zeilenrichtung",
    "Select the direction of the engraving path.": "Wählen Sie die Richtung des Gravurweges.",
    "Horizontal": "Horizontal",
    "Vertical": "Vertikal",
    "Diagonal": "Diagonal",
    "Diagonal2": "Diagonal2",
    "Choose an algorithm": "Wähle einen Algorithmus",
    "Density": "Dichte",
    "Contrast": "Kontrast",
    "The difference between the lightest color and the darkest color.": "Der Unterschied zwischen der hellsten und der dunkelsten Farbe.",
    "Brightness": "Helligkeit",
    "The engraved picture is brighter when this value is bigger.": "Das gravierte Bild ist heller, wenn dieser Wert größer ist.",
    "White Clip": "Weiße Klammer",
    "Set the threshold to turn the color that is not pure white into pure white.": "Stellen Sie den Schwellenwert so ein, dass die Farbe, die nicht rein weiß ist, in reines Weiß umgewandelt wird.",
    "Algorithm": "Algorithmus",
    "Choose an algorithm for image processing.": "Wählen Sie einen Algorithmus für die Bildverarbeitung.",
    "Preview Settings": "Vorschau Einstellungen",
    "Parse Image Error": "Analyse- Bild Fehler",
    "Failed to parse image file {{}}": "Bilddatei konnte nicht analysiert werden {{{}}}",
    "GREYSCALE": "GRAUSKALA",
    "VECTOR": "VEKTOR",
    "TEXT": "TEXT",
    "Middle": "Mitte",
    "Center": "Zentrum/Mitte",
    "Bottom Left": "Unten Links",
    "Bottom Middle": "Unten Mitte",
    "Bottom Right": "Unten Rechts",
    "Top Left": "Oben Links",
    "Top Middle": "Oben Mitte",
    "Top Right": "Oben Rechts",
    "Text": "Text",
    "Font": "Schrift",
    "Choose font": "Wähle Schrift",
    "Enter the font size in pt (points).": "Geben Sie die Schriftgröße in pt (Punkte) ein.",
    "Line Height": "Linienhöhe",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "Stellen Sie den Abstand zwischen den einzelnen Zeilen im Text ein. Der eingegebene Wert ist das Vielfache der Schriftgröße.",
    "Align the text in different lines to either the left or right or in the center horizontally.": "Richten Sie den Text in verschiedenen Zeilen entweder nach links, rechts oder in der Mitte horizontal aus.",
    "Impurity Size": "Verunreinigungsgröße",
    "Determines the minimum size of impurity which allows to be showed.": "Bestimmt die minimale Größe der Verunreinigung, die gezeigt werden kann.",
    "Invert": "Umkehren",
    "Inverts black to white and vise versa.": "Invertiert Schwarz nach Weiß und umgekehrt.",
    "Optimize Path": "Pfad optimieren",
    "Optimizes the path based on the proximity of the lines in the image.": "Optimiert den Pfad basierend auf der Nähe der Linien im Bild.",
    "Fine Tune Work Origin": "Feinabstimmung Werkstück Ursprung",
    "How Fine Tune Work Origin Works": "Wie die Feinabstimmung des Werkstück Ursprung funktioniert",
    "Click": "klicken",
    "Focus": "Fokus",
    "and use": "und benutze",
    "Jog Pad": "Jog-Pad",
    "Generate and Load G-code": "G-Code generieren und laden",
    "and the G-code is automatically generated and loaded.": "und der G-code wird automatisch generiert und geladen.",
    "to start laser cutting.": "um das Laserschneiden zu starten.",
    "Determines how fast the machine moves when it’s working.": "Legt fest, wie schnell sich die Gerät bewegt, wenn sie arbeitet.",
    "Power": "Leistung",
    "Power to use when laser is working.": "Leistung, die verwendet werden kann, wenn der Laser arbeitet.",
    "Enable 3D View": "3D-Ansicht aktivieren",
    "Disable 3D View": "3D-Ansicht deaktivieren",
    "Hide Coordinate System": "Koordinatensystem ausblenden",
    "Show Coordinate System": "Koordinatensystem anzeigen",
    "Reset Position": "Position zurücksetzen",
    "Zoom In": "Hineinzoomen",
    "Zoom Out": "Herauszoomen",
    "CNC": "CNC",
    "Save": "Speichern",
    "Quality": "Qualität",
    "Shell": "Gehäuse",
    "Infill": "Füllung",
    "Speed": "Geschwindigkeit",
    "Retract & Z Hop": "Rückzug & Z Sprung",
    "Surface": "Oberfläche",
    "Recommended": "Empfohlen",
    "Customize": "Anpassen",
    "Fast Print": "Schnelldruck",
    "Normal Quality": "Normale Qualität",
    "High Quality": "Hohe Qualität",
    "Show Details": "Details anzeigen",
    "Profile": "Profil",
    "Printing Settings": "Druck Einstellungen",
    "Adhesion": "Adhäsion",
    "Support": "Unterstützung",
    "Loading model...": "Modell lädt...",
    "Preparing for slicing...": "Vorbereitung zum slicen....",
    "Upload File": "Datei hochladen",
    "Scene Objects": "Szenenobjekte",
    "Display G-code Filename": "G-Code-Dateinamen anzeigen",
    "Hide Toolhead": "Werkzeugkopf ausblenden",
    "Show Toolhead": "Werkzeugkopf anzeigen",
    "3D rendering...": "3D Wiedergabe….",
    "Upload G-code": "G-Code hochladen",
    "Run": "Start",
    "Pause": "Pause",
    "Stop": "STOPP",
    "Webcam": "Webcam",
    "Edit": "Bearbeiten",
    "Enable": "Aktivieren",
    "Disable": "Deaktivieren",
    "Webcam Settings": "Webcam-Einstellungen",
    "Media Source": "Medienquelle",
    "Use a built-in camera or a connected webcam": "Verwenden Sie eine integrierte Kamera oder eine angeschlossene Webcam",
    "Use a M-JPEG stream over HTTP": "Verwenden Sie einen M-JPEG-Stream über HTTP",
    "Note: If you are using the CNC Carving Module, make sure the carving bit will not run into the fixtures before you use this feature.": "Hinweis: Wenn Sie das CNC-Schnitzmodul verwenden, stellen Sie sicher, dass der Fräser nicht in die Vorrichtungen läuft, bevor Sie diese Funktion verwenden.",
    "Enter the text you want to engrave. The maximum length of the text is 125 mm. When the text is too long, it will be shrunk automatically. Start a new line manually according to your needs.": "Geben Sie den zu gravierenden Text ein. Die maximale Länge des Textes beträgt 125 mm. Wenn der Text zu lang ist, wird er automatisch verkleinert. Starten Sie eine neue Zeile manuell nach Ihren Bedürfnissen.",
    "Setting work origin is essentially finding the best place for the engraved image in the X and Y directions and determining the distance (Z Offset) between the Engraving & Carving Platform and the Laser Module to acquire the smallest laser dot on the material for the most efficient use of the laser power and the best result. For the 200mW Laser Engraving Module, the Z Offset can be set by judging the size of the laser dot by eyes with low power. However, for the 1600mW Laser Cutting Module, this method is less accurate as the laser dot is too strong and less interpretable. To set the Z Offset more accurately, we can move the module to the position that is close to the optimal Z Offset (Offset A). The software will test the results from a few positions next to Offset A on the same material. The best result determines the best Z Offset.": "Die Einstellung des Arbeitsursprungs besteht im Wesentlichen darin, den besten Platz für das gravierte Bild in X- und Y-Richtung zu finden und den Abstand (Z-Versatz) zwischen der Gravur- und Schneide-Plattform und dem Lasermodul zu bestimmen, um den kleinsten Laserpunkt auf dem Material für die effizienteste Nutzung der Laserleistung und das beste Ergebnis zu erhalten. Für das 200mW Lasergravurmodul kann der Z-Offset eingestellt werden, indem die Größe des Laserpunktes durch Augen mit geringer Leistung beurteilt wird. Für das 1600mW Laserschneidmodul ist diese Methode jedoch weniger genau, da der Laserpunkt zu stark und weniger interpretierbar ist. Um den Z-offset genauer einzustellen, können wir das Modul in die Nähe des optimalen Z-Versatzes (offset A) bringen. Die Software testet die Ergebnisse an einigen Stellen neben dem offset A auf dem gleichen Material. Das beste Ergebnis bestimmt den besten Z-offset.",
    "in the Axes section to move the Laser Cutting Module to the position that is close to the optimal Z Offset (just like how you do with the 200mW Laser Engraving Module).": "im Bereich Achsen, um das Laserschneidmodul in die Nähe des optimalen Z-Versatzes zu bewegen (wie beim 200mW Lasergravurmodul).",
    "Set Work Speed and Power based on the material you are using. If you are using a piece of 1.5 mm wood sheet, it’s recommended to set the Work Speed to a value between 80 mm/s and 120 mm/s and set the Power to 100%.": "Stellen Sie die Arbeitsgeschwindigkeit und Leistung je nach verwendetem Material ein. Wenn Sie ein Stück 1,5 mm Holzplatte verwenden, wird empfohlen, die Arbeitsgeschwindigkeit auf einen Wert zwischen 80 mm/s und 120 mm/s einzustellen und die Leistung auf 100% einzustellen.",
    "Choose the position that can cut the material the most smoothly or engrave the thinnest line and the software will set it as Z Offset. In this example, -2.0 should be the Z Offset.": "Wählen Sie die Position, an der das Material am glattesten geschnitten werden kann, oder gravieren Sie die dünnste Linie und die Software stellt sie als Z-Offset ein. In diesem Beispiel sollte -2.0 der Z-Offset sein.",
    "Failed to parse image file {{filename}}": "Bilddatei konnte nicht analysiert werden {{Dateiname}}}.",
    "Skirt": "Unterteil",
    "Brim": "Rand",
    "Raft": "Floß",
    "Normal": "Normal",
    "Both": "Beide",
    "Warning": "Warnung",
    "Failed to load model.": "Modell konnte nicht geladen werden.",
    "Tabs": "Register",
    "Upload": "Hochladen",
    "Choose algorithms": "Wähle den Algorithmus",
    "A web-based interface for Snapmaker which is able to do 3D Printing, laser engraving and CNC carving.": "Eine Webbasierte Anzeige für den Snapmaker welche 3D-Druck, Lasergravieren und CNC-Fräsen durchführen kann.",
    "Determines how fast the tool moves on the material.": "Bestimmen, wie schnell sich das Werkzeug auf dem Material bewegt.",
    "Select a word font or upload a font from your computer. WOFF, TTF, OTF fonts are supported.": "Auswahl einer Word Schriftart oder eine Schriftart vom Computer laden. WOFF, TTF und OTF Schriftarten werden unterstützt.",
    "Fill Density": "Füll-Dichte",
    "Determines how fine and smooth the engraved picture will be. The bigger this value is, the better quality you will get. The range is 1-10 dot/mm and 10 is recommended.": "Legt fest, wie fein und glatt das gravierte Bild sein wird. Je größer dieser Wert ist, desto bessere Qualität erhalten Sie. Der Bereich beträgt 1-10 Punkt / mm und 10 wird empfohlen.",
    "Center Left": "Mitte Links",
    "Center Right": "Mitte Rechts",
    "Center Selected Model": "Ausgewähltes Modell einmitten",
    "Delete Selected Model": "Ausgewähltes Modell löschen",
    "Duplicate Selected Model": "Ausgewähltes Modell duplizieren",
    "Reset Selected Model Transformation": "Transformation des ausgwählten Modells zurücksetzen",
    "Clear Build Plate": "Bau Platte aufräumen",
    "Arrange All Models": "Alle Modelle arangieren",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the SVG image will be engraved without fill.": "Stellen Sie den Grad ein, bis zu dem ein Bereich mit Laserpunkten gefüllt ist. Die höchste Dichte beträgt 20 Punkte / mm. Wenn es auf 0 gesetzt ist, wird das SVG-Bild ohne Füllung graviert.",
    "Passes": "Durchführungen",
    "Pass Depth": "Durchführungstiefe",
    "STL File (Binary) (*.stl)": "STL Datei (binär) (*.stl)",
    "STL File (ASCII) (*.stl)": "STL Datei (ASCII) (*.stl)",
    "OBJ File (*.obj)": "OBJ Datei (*.obj)",
    "Export Models": "Modelle exportieren",
    "Only STL/OBJ files are supported.": "Nur STL/OBJ Dateien werden unterstützt.",
    "Drop an STL/OBJ file here.": "STL/OBJ Datei hier ablegen.",
    "Only G-code files are supported": "Nur G-code Dateien werden unterstützt",
    "Drop a G-code file here.": "G-Code Datei hier ablegen.",
    "When enabled, the printer will run the G-code multiple times automatically according to the below settings. This feature helps you cut materials that can't be cut with only one pass.": "Wenn diese Option aktiviert ist, führt der Drucker den G-Code gemäß den folgenden Einstellungen mehrmals automatisch aus. Mit dieser Funktion können Sie Materialien schneiden, die nicht mit nur einem Durchgang geschnitten werden können.",
    "Determines how many times the printer will run the G-code automatically.": "Legt fest, wie oft der Drucker den G-Code automatisch ausführt.",
    "Determines how much the laser module will be lowered after each pass.": "Legt fest, um wie viel das Lasermodul nach jedem Durchgang abgesenkt wird.",
    "Fixed Power": "Fixer Strom",
    "Multi-pass": "Mehrfach Durchführung",
    "Fill": "Füllung",
    "Drop an image file here.": "Bilddatei hier ablegen",
    "Lay Flat Selected Model": "Ausgwähltes Modell flach hinlegen",
    "Door detection": "Tür Überwachung",
    "Enclosure": "Gehäuse",
    "Select mode to upload:": "Modus für das Hochladen auswählen",
    "Please wait for automatic preview to complete.": "Bitte warten bis die automatische Vorschau komplett ist",
    "When enabled, the power used to engrave this image will be set in the G-code, so it is not affected by the power you set in Workspace. When engraving multiple images, you can set the power for each image separately.": "Wenn diese Option aktiviert ist, wird die zum Gravieren dieses Bilds verwendete Leistung im G-Code festgelegt, sodass sie nicht von der in Workspace festgelegten Leistung beeinflusst wird. Wenn Sie mehrere Bilder gravieren, können Sie die Leistung für jedes Bild separat einstellen.",
    "When engraving multiple images, this parameter determines the print order of the selected image. When the orders are the same, the image uploaded first will be engraved first.": "Beim Gravieren mehrerer Bilder bestimmt dieser Parameter die Druckreihenfolge des ausgewählten Bildes. Wenn die Bestellungen gleich sind, wird das zuerst hochgeladene Bild zuerst graviert.",
    "Rotate": "Drehen",
    "Rotate the image to the angle you need.": "Das Bild im gewünschten Winkel drehen",
    "Move X (mm)": "Bewege X (mm)",
    "Set the coordinate of the selected image or text in the X direction. You can also drag the image directly.": "Stellen Sie die Koordinate des ausgewählten Bilds oder Textes in X-Richtung ein. Sie können das Bild auch direkt ziehen.",
    "Move Y (mm)": "Bewege Y (mm)",
    "Set the coordinate of the selected image or text in the Y direction. You can also drag the image directly.": "Stellen Sie die Koordinate des ausgewählten Bilds oder Textes in Y-Richtung ein. Sie können das Bild auch direkt ziehen.",
    "Print Order": "Druckreihenfolge",
    "Movement Mode": "Bewegungs Modus",
    "Choose movement mode": "Bewegungs Modus wählen",
    "Line (Normal Quality)": "Linie (normale Qualität)",
    "Dot (High Quality)": "Punkt (hohe Qualität)",
    "Extract": "Extrahieren",
    "Set Laser Background": "Laser Hintergrund einstellen",
    "Side Length": "Seitenlännge",
    "Information": "Information",
    "Please extract background image from photo.": "Bitte das Hintergrundbild vom Foto extrahieren.",
    "Complete": "Komplett",
    "Add Background": "Hintergrund hinzufügen",
    "Remove Background": "Hintergrund entfernen",
    "Error": "Fehler",
    "Transit file failed.": "Dateiübertragung fehlgeschlagen.",
    "File Transit": "Dateiübertragung",
    "Sending": "Übertragung",
    "Send": "Senden",
    "Extract Square Trace": "Quadrat Nachzeichnen extrahieren",
    "Previous": "zurück",
    "Print Square Trace": "Quadrat Nachzeichnen drucken",
    "Next": "weiter",
    "Laser tool head is not connected. Please make sure the laser tool head is installed properly, and then connect to your Snapmaker via Connection widget.": "Laserwerkzeugkopf ist nicht angeschlossen. Sicherstellen, dass der Laser-Werkzeugkopf ordnungsgemäß installiert ist, und dann über das Verbindungs-Widget eine Verbindung zum Snapmaker herstellen.",
    "Config": "Konfiguration",
    "How to Configure Camera Aid Background": "Wie wird der Kamera Hilfshintergrund konfiguriert",
    "The Camera Aid Background feature enables you to place the material and the image to be engraved together                         and adjust their position on the software by using a phone with a camera.                         It helps to engrave the image on your material in a much more accurate way.": "Mit der Camera Aid Background-Funktion können Sie das zu gravierende Material und das Bild zusammenfügen und ihre Position in der Software mithilfe eines Telefons mit einer Kamera anpassen. Es hilft, das Bild viel genauer in Ihr Material zu gravieren.",
    "Place a piece of paper or wood sheet on the Engraving & Carving Platform.": "Ein Stück Papier oder Holz auf die Gravur- und Schnitzplattform legen.",
    "Set the work origin as how you did before.": "Arbeitsursprung wie zuvor einstellen.",
    "Go to": "Gehe zu",
    "Set Background": "Setze Hintergrund",
    "Print a square to locate your material.": "Drucke Quadrat um das Material zu lokalisieren",
    "Set the": "Setze",
    "and": "und",
    "of the square.": "des Quadrates.",
    "The square should be larger than the material that will be engraved.": "Das Material muss grösser sein als die Gravur.",
    "Engrave Square": "Quadrat gravieren",
    "After the square is engraved, place the material inside the square and take a photo. The four corners of the square must be in the photo. Also, to achieve the best result, try to keep the lens and the heated bed parallel.": "Legen Sie das Material nach dem Gravieren des Quadrats in das Quadrat und machen Sie ein Foto. Die vier Ecken des Quadrats müssen auf dem Foto sein. Um das beste Ergebnis zu erzielen, versuchen Sie außerdem, die Linse und das beheizte Bett parallel zu halten.",
    "Send the photo to your computer.": "Foto an den Computer senden",
    "click": "klick",
    "to upload the photo. Move the four corners of the dashed box to overlap the four corners of the engraved square.": "um das Foto hochzuladen. Bewegen Sie die vier Ecken des gestrichelten Felds, um die vier Ecken des gravierten Quadrats zu überlappen.",
    "and then": "und dann",
    "Now the printer knows where your material is on the platform.": "Jetzt weiß der Drucker, wo das Material auf der Plattform befindet.",
    "Add the image or text you need to engrave on the background and complete the settings based on your needs.": "Bild oder den Text hinzufügen, der zum Gravieren auf dem Hintergrund benötigt wird, und Einstellungen entsprechend den Anforderungen vornehmen.",
    "Set the work origin only on the Z direction again so that the printer can engrave on the surface of the material.": "Arbeitsursprung erneut nur in Z-Richtung einstellen, damit der Drucker auf der Oberfläche des Materials gravieren kann.",
    "Z": "Z",
    "Zero Out Temporary Z Axis": "Temporäre Z-Achse auf Null setzen",
    "to save the new origin.": "to save the new origin",
    "Set": "Setzen",
    "Work Power": "Arbeitsleistung",
    "and start the engraving.": "und gravieren starten",
    "Machine": "Gerät",
    "Machine Settings": "Geräteeinstellungen",
    "The temperature used for the heated build plate. If this is 0, the bed temperature will not be adjusted.": "Die Temperatur, die für die erhitzte Druckplatte verwendet wird. Wenn dieser Wert 0 beträgt, wird die Betttemperatur nicht angepasst.",
    "Only {{accept}} files are supported.": "Es werden nur {{accept}} Dateien unterstützt.",
    "X (Width)": "X (Breite)",
    "Y (Depth)": "Y (Tiefe)",
    "Z (Height)": "Z (Höhe)",
    "Failed to rename. Please enter a new name.": "Fehler beim Umbenennen. Bitte einen neuen Namen eingeben.",
    "Failed to rename. \"{{name}}\" already exists.": "Fehler beim Umbenennen. \"{{name}}\" existiert bereits.",
    "Previewing G-code...": "G-Code Vorschau",
    "Failed to load G-code.": "G-Code konnte nicht geladen werden",
    "Failed to preview": "Vorschau konnte nicht geladen werden",
    "Failed to preview, please modify parameters and try again.": "Fehler bei der Vorschau, Parameter ändern und erneut versuchen.",
    "Auto Preview": "Automatische Vorschau",
    "When enabled, the software will show the preview automatically after the settings are changed. You can disable it if Auto Preview takes too much time.": "Wenn diese Option aktiviert ist, zeigt die Software die Vorschau automatisch an, nachdem die Einstellungen geändert wurden. Sie können es deaktivieren, wenn die automatische Vorschau zu lange dauert.",
    "Set the density of the tool head movements. The highest density is 10 dot/mm. When generating G-code, the density will be re-calculated to ensure the process work normally.": "Stellen Sie die Dichte der Werkzeugkopfbewegungen ein. Die höchste Dichte beträgt 10 Punkt / mm. Bei der Generierung von G-Code wird die Dichte neu berechnet, um sicherzustellen, dass der Prozess normal funktioniert.",
    "Estimated Time:": "Geschätzte Zeit",
    "Generating tool path... {{progress}}%": "Generiere ",
    "Generated tool path successfully.": "Werkzeugweg erfolgreich generiert.",
    "Bring to Front": "In den Vordergrund",
    "Send to Back": "In den Hintergrund",
    "Reference Position": "Referenzposition",
    "Failed to upload model.": "Modell konnte nicht hochgeladen werden",
    "Keyboard Shortcuts": "Tastaturkürzel",
    "Working Parameters": "Arbeitsparameter",
    "Image Trace": "Bild nachzeichnen",
    "Black": "Schwarz",
    "Adjust the black trace.": "Schwarzes Nachzeichnen anpassen",
    "Foreground": "Vordergrund",
    "Adjust the foreground.": "Vordergrund anpassen",
    "Dilation": "Erweiterung",
    "Dilate the foreground mask gradually. Bigger values cost more time.": "Vordergrundmaske allmählich erweitern. Größere Werte kosten mehr Zeit.",
    "Color Range": "Farbraum",
    "Adjust the color range of each trace.": "Farbraum für jedes Nachzeichnen anpassen",
    "Objects": "Objekte",
    "The number of the output objects.": "Anzahl der Ausgabeobjekte",
    "Status: {{status}}": "Status: {{status}}",
    "Upload As": "Hochladen als",
    "Upload the selected images.": "Ausgewähltes Bild hochladen",
    "UPLOAD": "HOCHLADEN",
    "Font Size": "Schriftgrösse",
    "Transformation": "Transformation",
    "Flip Model": "Drehmodus",
    "RELIEF": "RELIEF",
    "TRACE": "NACHZEICHNEN",
    "Configurations": "Konfigurationen",
    "Relief": "Relief",
    "Path": "Pfad",
    "Flip": "Drehen",
    "Serial Port": "Serieller Anschluss",
    "Wi-Fi": "Wi-Fi",
    "Choose a machine": "Gerät wählen",
    "Status": "Status",
    "Greyscale": "Grauskala",
    "Vector": "Vektor",
    "Bed": "Bett",
    "Slicing...{{progress}}%": "Schneiden...{{progress}}",
    "Previewed G-code successfully.": "G-Code Vorschau erfolgreich",
    "Failed to upload model": "Modell konnte nicht hochgeladen werden",
    "Automatic detection": "Automatische detektierung",
    "No video devices available": "Keine Videogeräte verfpgbar",
    "Choose a video device": "Videogerät auswählen",
    "No machine detected.": "Kein Gerät gefunden",
    "- Please Select -": "- Bitte wählen -",
    "Flip the selected Model vertically, horizontally or in both directions.": "Model vertikal, horizontal oder in beide Richtungen kippen",
    "Carve away the inner of the image.": "Das Innere des Bildes wegschnitzen",
    "Set the precision at which an area is carved. The highest density is 0.05 mm (20 dot/mm). When it is set to 0, the SVG image will be carved without fill.": "Stellen Sie die Genauigkeit ein, mit der ein Bereich geschnitzt wird. Die höchste Dichte beträgt 0,05 mm (20 Punkte / mm). Wenn es auf 0 gesetzt ist, wird das SVG-Bild ohne Füllung geschnitzt.",
    "No machines detected.": "Kein Gerät gefunden",
    "Connected via Wi-Fi": "Verbindung über Wi-Fi",
    "Set the target temperature of the nozzle in real-time.": "Temperatur der Düse in Echtzeit setzen",
    "Heated Bed": "Wärmeplatte",
    "Set the target temperature of the heated bed in real-time.": "Temperatur der Wärmeplatte in Echtzeit setzen",
    "Loaded model successfully.": "Modell vollständig geladen",
    "Sliced model successfully.": "Modell schneiden erfolgreich",
    "Failed to slice model.": "Schneiden des Modells nicht möglich",
    "Support Placement": "Platzierung Stützstruktur",
    "Adjusts the placement of the support structures. The placement can be set to touching build plate or everywhere. When set to everywhere the support structures will also be printed on the model.": "Es werden Stützstrukturen platziert. Die Platzierung kann auf „Druckbett berühren“ oder „Überall“ eingestellt werden. Wenn „Überall“ eingestellt wird, werden die Stützstrukturen auch auf dem Modell gedruckt.",
    "Touching Buildplate": "Druckbett berühren",
    "Everywhere": "Überall",
    "Support Pattern": "Muster der Stützstruktur",
    "The pattern of the support structures of the print. The different options available result in sturdy or easy to remove support.": "Das Muster der Stützstruktur des Drucks. Die verschiedenen verfügbaren Optionen führen zu einer stabilen oder zu einer leicht entfernbaren Stützstruktur.",
    "Lines": "Linien",
    "Grid": "Gitter",
    "Triangles": "Dreiecke",
    "Concentric": "Konzentrisch",
    "Zig Zag": "Zickzack",
    "Cross": "Quer",
    "Skirt Line Count": "Anzahl der Skirt-Linien",
    "Multiple skirt lines help to prime your extrusion better for small models. Setting this to 0 will disable the skirt.": "Mehrere Skirt-Linien ermöglichen eine bessere Materialbereitstellung für die Extrusion für kleine Modelle. Wird dieser Wert auf 0 eingestellt, wird kein Skirt erstellt.",
    "Brim Line Count": "Anzahl der Brim-Linien",
    "The number of lines used for a brim. More brim lines enhance adhesion to the build plate, but also reduces the effective print area.": "Die Anzahl der Linien für das Brim-Element. Eine größere Anzahl von Brim-Linien verbessert die Haftung am Druckbett, es wird dadurch aber auch der verwendbare Druckbereich verkleinert.",
    "Raft Extra Margin": "Zusätzlicher Abstand für Raft",
    "If the raft is enabled, this is the extra raft area around the model which is also given a raft. Increasing this margin will create a stronger raft while using more material and leaving less area for your print.": "Wenn die Raft-Funktion aktiviert ist, gibt es einen zusätzlichen Raft-Bereich um das Modell herum, für das ein Raft erstellt wird. Bei einem größeren Abstand wird ein kräftigeres Raft-Element hergestellt, wobei jedoch mehr Material verbraucht wird und weniger Platz für das gedruckte Modell verbleibt.",
    "Axes": "Achsen",
    "Connection": "Verbindung",
    "Machine Modal": "Gerätemodal",
    "Motion": "Bewegung",
    "Distance": "Distanz",
    "Feed Rate": "Nachschubrate",
    "Unit": "Einheit",
    "Spindle": "Spindel",
    "Material": "Material",
    "Support Overhang Angle": "Winkel für Überhänge Stützstruktur",
    "The minimum angle of overhangs for which support is added. At a value of 0° all overhangs are supported, 90° will not provide any support.": "Der Mindestwinkel für Überhänge, für welche eine Stützstruktur zugefügt wird. Bei einem Wert von 0° werden alle Überhänge gestützt, bei 90° wird kein Überhang gestützt.",
    "Support Density": "Dichte der Stützstruktur",
    "Adjusts the density of the support structure. A higher value results in better overhangs, but the supports are harder to remove.": "Die Dichte der Stützstruktur wird eingestellt. Ein höherer Wert führt zu besseren Überhängen, aber die Stützstrukturen sind schwieriger zu entfernen.",
    "Outer Before Inner Walls": "Äussere vor Inneren Wänden",
    "Prints walls in order of outside to inside when enabled. This can help improve dimensional accuracy in X and Y when using a high viscosity plastic like ABS; however it can decrease outer surface print quality, especially on overhangs.": "Druckt Wände in der Reihenfolge von außen nach innen, wenn sie aktiviert sind. Dies kann dazu beitragen, die Maßgenauigkeit in X und Y zu verbessern, wenn ein hochviskoser Kunststoff wie ABS verwendet wird. Dies kann jedoch die Druckqualität der Außenfläche beeinträchtigen, insbesondere bei Überhängen.",
    "Confirm": "Bestätigen",
    "Auto": "Auto",
    "Manual": "Manuell",
    "Exit": "verlassen",
    "Margin": "Abstand",
    "current RPM": "aktuelle RPM",
    "Set Origin": "Origin setzen",
    "Protocol Type": "Protokolltyp",
    "Screen": "Bildschirm",
    "Switch": "Schalten",
    "Flush": "Flush",
    "Basic": "Basis",
    "Length": "Länge",
    "Filter": "Filter",
    "Message Filter": "Nachtichten Filter",
    "Clear": "löschen",
    "Show Hex": "Zeige Hex",
    "Calibration": "Kalibrierung",
    "Update": "Aktualisierung",
    "Setting": "Einstellung",
    "Lamp": "Lampe",
    "Failed to upload file": "Datei konnte nicht hochgeladen werden",
    "Update Finished": "Aktualisierung abgeschlossen",
    "The firmware is updated successfully. The calibration data will be reset. For the module update, it may take about one minute to restart the machine. Please wait until the machine is restarted. ": "Die Firmware wurde erfolgreich aktualisiert. Die Kalibrierungsdaten werden zurückgesetzt. Bei der Modulaktualisierung kann es etwa eine Minute dauern, bis der Computer neu gestartet wird. Bitte warten Sie, bis die Maschine neu gestartet wird. ",
    "Update Firmware": "Firmware aktualisieren",
    "Packet Type for Raw Update": "Packet Typ für Rohaktualisierung",
    "Main Controller": "Hauptkontroller",
    "Modules": "Module",
    "Raw Update": "Rohaktualisierung",
    "Version": "Version",
    "Update Filename": "Dateiname aktualisieren",
    "Firmware Version": "Firmware Version",
    "G-code File": "G-Code Datei",
    "Export": "Exportieren",
    "Extruder": "Extruder",
    "Light Bar": "Lichtleiste",
    "Get Status": "Status holen",
    "Switch Light": "Licht ändern",
    "Light": "Licht",
    "Current Power": "Aktuelle Stärke",
    "Set Power": "Stärke setzen",
    "Get Z Focus": "Z Fokus holen",
    "Set Z Focus": "Z Fokus setzen",
    "Draw Bound": "Rahmen anzeigen",
    "Draw Ruler": "Lineal anzeigen",
    "Enter Set Focus": "Fokussierung eingeben",
    "Relative coordinates": "Relative Koordinaten",
    "Absolute coordinates": "Absolute Koordinaten",
    "Move Require": "Bewegung nötig",
    "Offset": "Abstand",
    "Direction": "Richtung",
    "Home Location": "Home Position",
    "Default": "Standard",
    "Reverse": "umkehren",
    "Zero": "Null",
    "DevelopTools": "EntwicklungsWerkzeuge",
    "Case Library": "Fallbibliothek",
    "Control Widget": "Steuerungs-Widget",
    "Yes": "Ja",
    "Featured Projects": "Vorgestellte Projekte",
    "A150": "A150",
    "A250": "A250",
    "A350": "A350",
    "by Snapmaker": "von Snapmaker",
    "load": "laden",
    "Home Reminder": "Home speichern",
    "To continue, the machine needs to go to its home position. Homing works by moving X, Y, Z axes to the pre-defined positions, which will be used as the reference points.": "Um fortzufahren, muss die Maschine in ihre Ausgangsposition gehen. Bei der Referenzfahrt werden die X-, Y- und Z-Achsen an die vordefinierten Positionen verschoben, die als Referenzpunkte verwendet werden.",
    "Laser Focus": "Laser Fokus",
    "Select your machine model": "Gerätnmodell auswählen",
    "Nozzle Temp": "Temp. Düse",
    "Heated Bed Temp": "Temp. Heizplatte",
    "The machine is working, disconnect will stop current print.": "Die Gerät arbeitet aktuell, wird die Verbindung beendet wird der aktuelle Druck angehalten.",
    "Disconnection": "Verbindung beenden",
    "Please tap Yes on Snapmaker touchscreen to confirm Wi-Fi connection.": "Bitte Ja klicken um eine Verbindung über Wi-Fi herzustellen.",
    "Screen Authorization Needed": "Authorisierung auf Bildschirm bestätigen",
    "Connected": "Verbunden",
    "Disconnected": "Verbindung getrennt",
    "Clear All": "Lösche alles",
    "Control": "Kontrolle",
    "Home": "Home",
    "Machine Coordinates": "Gerätnkoordinaten",
    "Work Coordinates": "Arbeitskoordinaten",
    "Machine Position": "Position Gerät",
    "Camera Aid Background": "Kamera Hilfshintergrund",
    "Start": "Start",
    "Comfirm": "Bestätigen",
    "Apply": "Hinzufügen",
    "The camera hasn't calibrated yet. Please go through the Camera Calibration procedures on touchscreen first.": "Die Kamera wurde noch nicht kalibriert. Bitte zuerst die Kalibrierung über den Touchscreen ausführen.",
    "Camera Capture": "Kamera Aufnahme",
    "New Macro": "Neues Makro",
    "Macro Name": "Makro Name",
    "Macro Commands": "Makro Befehle",
    "Repeat": "Wiederholen",
    "Edit Macro": "Makro bearbeiten",
    "Delete Macro": "Makro löschen",
    "Delete this macro?": "Makro löschen?",
    "No": "Nein",
    "Delete": "Löschen",
    "Macro": "Makro",
    "No macros": "Keine Makros",
    "Run Macro": "Makro ausführen",
    "Tool Head": "Werkzeugkopf",
    "Printing Auto Mode": "Drucken Auto Modus",
    "Z Offset": "Z Abstand",
    "Laser Power": "Laserstärke",
    "Nozzle Temp.": "Temp. Düse",
    "Heated Bed Temp.": "Temp. Heizplatte",
    "Filament": "Filament",
    "Unload": "Entladen",
    "Failed to Send File": "Sender der Datei fehlgeschlagen",
    "Send File Successfully": "Senden der Datei erfolgreich",
    "Please confirm and choose whether to start print this file on the touchscreen.": "Bitte bestätigen und auf dem Bildschirm wählen ob der Druck der Datei gestartet werden soll.",
    "Wi-Fi Transport": "Wi-Fi Übertragung",
    "Transfer via Wi-Fi": "Übertragen mit Wi-Fi",
    "Filament Runout Recovery": "Filament Leerlauf Wiederherstellung",
    "Filament has run out. Please load the new filament to continue printing.": "Kein Filament mehr. Bitte neues Filament laden um den Druck fortzusetzen.",
    "Unable to start the job.": "Job kann nicht gestartet werden",
    "Unable to resume the job.": "Job kann nicht weitergeführt werden",
    "Enclosure door was opened": "Gehäuse Türe wurde geöffnet",
    "The enclosure door needs to be closed before laser or CNC printing": "Die Gehäusetür muss geschlossen werden, before mit Laser oder CNC gearbeitet werden kann",
    "Ok": "OK",
    "Zoom with Scroll Wheel; Move horizontally with Right Mouse Button": "Zoom mit Scrollrad; Horizontal bewegen mit rechter Maustaste",
    "This action cannot be undone. Are you sure you want to stop the job?": "Dies kann nicht rückgängig gemacht werden. Sicher dass der Job angehalten werden soll?",
    "On the software": "In der Software",
    "Material Thickness": "Materialdicke",
    "If you reinstalled the laser module, please redo the Camera Calibration on the Touchscreen before proceeding.": "Wenn das Lasermodul gewechselt wurde, bitte die Kamera über den Bildschirm neu kalibrieren bevor weitergefahren wird.",
    "Note: If you use the USB disk to engrave, please make sure you set the work origin in the software instead of on the touchscreen.": "Hinweis: Wenn mit einem USB-Stick graviert wird sicherstellen, dass der Origin in der Software gesetzt wird (nicht über den Touchscreen).",
    "Door Detection": "Tür Überwachung",
    "Time Out": "Auszeit",
    "Wait Time": "Wartezeit",
    "3s": "3S",
    "15s": "15S",
    "30s": "30S"
}
