{
    "Generate Support": "Generazione supporto",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "Genera strutture per supportare le parti del modello a sbalzo. Senza queste strutture, queste parti collasserebbero durante la stampa.",
    "Build Plate Adhesion Type": "Tipo di adesione piano di stampa",
    "Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "Sono previste diverse opzioni che consentono di migliorare l'applicazione dello strato iniziale dell’estrusione e migliorano l’adesione. Il brim aggiunge un'area piana a singolo strato attorno alla base del modello, per evitare deformazioni. Il raft aggiunge un fitto reticolato con un tetto al di sotto del modello. Lo skirt è una linea stampata attorno al modello, ma non collegata al modello.",
    "Initial Layer Line Width": "Larghezza linea strato iniziale",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "Moltiplicatore della larghezza della linea del primo strato Il suo aumento potrebbe migliorare l'adesione al piano",
    "Spiralize Outer Contour": "Stampa del contorno esterno con movimento spiraliforme",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "Appiattisce il contorno esterno attorno all'asse Z con movimento spiraliforme. Questo crea un aumento costante lungo l'asse Z durante tutto il processo di stampa. Questa caratteristica consente di ottenere un modello pieno in una singola stampata con fondo solido. Questa caratteristica deve essere abilitata solo quando ciascuno strato contiene solo una singola parte.",
    "Surface Mode": "Modalità superficie",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "Trattare il modello solo come una superficie, un volume o volumi con superfici libere. Il modo di stampa normale stampa solo volumi delimitati. “Superficie” stampa una parete singola tracciando la superficie della maglia senza riempimento e senza rivestimento esterno superiore/inferiore. “Entrambi” stampa i volumi delimitati come normali ed eventuali poligoni rimanenti come superfici.",
    "Travel Speed": "Velocità degli spostamenti",
    "The speed at which travel moves are made.": "Indica la velocità alla quale vengono effettuati gli spostamenti.",
    "Top/Bottom Speed": "Velocità di stampa delle parti superiore/inferiore",
    "The speed at which top/bottom layers are printed.": "Indica la velocità alla quale vengono stampati gli strati superiore/inferiore.",
    "Inner Wall Speed": "Velocità di stampa della parete interna",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "Indica la velocità alla quale vengono stampate tutte le pareti interne. La stampa della parete interna eseguita più velocemente di quella della parete esterna consentirà di ridurre il tempo di stampa. Si consiglia di impostare questo parametro ad un valore intermedio tra la velocità della parete esterna e quella di riempimento.",
    "Outer Wall Speed": "Velocità di stampa della parete esterna",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "Indica la velocità alla quale vengono stampate le pareti più esterne. La stampa della parete esterna ad una velocità inferiore migliora la qualità finale del rivestimento. Tuttavia, una grande differenza tra la velocità di stampa della parete interna e quella della parete esterna avrà effetti negativi sulla qualità.",
    "Infill Speed": "Velocità di riempimento",
    "The speed at which infill is printed.": "Indica la velocità alla quale viene stampato il riempimento.",
    "Print Speed": "Velocità di stampa",
    "The speed at which printing happens.": "Indica la velocità alla quale viene effettuata la stampa.",
    "Retraction Speed": "Velocità di retrazione",
    "The speed at which the filament is retracted and primed during a retraction move.": "Indica la velocità alla quale il filamento viene retratto e preparato durante un movimento di retrazione.",
    "Retraction Distance": "Distanza di retrazione",
    "The length of material retracted during a retraction move.": "La lunghezza del materiale retratto durante il movimento di retrazione.",
    "Retract at Layer Change": "Retrazione al cambio strato",
    "Retract the filament when the nozzle is moving to the next layer.": "Ritrae il filamento quando l'ugello si sta muovendo allo strato successivo. ",
    "Enable Retraction": "Abilitazione della retrazione",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "Ritrae il filamento quando l'ugello si sta muovendo su un'area non stampata. ",
    "Infill Density": "Densità del riempimento",
    "Adjusts the density of infill of the print.": "Regola la densità del riempimento della stampa.",
    "Bottom Thickness": "Spessore degli strati inferiori",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "Indica lo spessore degli strati inferiori nella stampa. Questo valore diviso per la l’altezza dello strato definisce il numero degli strati inferiori.",
    "Top Thickness": "Spessore dello strato superiore",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "Indica lo spessore degli strati superiori nella stampa. Questo valore diviso per la l’altezza dello strato definisce il numero degli strati superiori.",
    "Wall Thickness": "Spessore delle pareti",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "Spessore delle pareti in direzione orizzontale. Questo valore diviso per la larghezza della linea della parete definisce il numero di pareti.",
    "Initial Layer Height": "Altezza dello strato iniziale",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.": "Indica l’altezza dello strato iniziale in mm. Uno strato iniziale più spesso facilita l’adesione al piano di stampa.",
    "Layer Height": "Altezza dello strato",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "Indica l’altezza di ciascuno strato in mm. Valori più elevati generano stampe più rapide con risoluzione inferiore, valori più bassi generano stampe più lente con risoluzione superiore.",
    "Z Hop Height": "Altezza Z Hop",
    "The height difference when performing a Z Hop.": "La differenza di altezza durante l’esecuzione di uno Z Hop.",
    "Z Hop When Retracted": "Z Hop durante la retrazione",
    "Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.": "Ogniqualvolta avviene una retrazione, il piano di stampa viene abbassato per creare uno spazio tra l’ugello e la stampa. Previene l’urto dell’ugello sulla stampa durante gli spostamenti riducendo la possibilità di far cadere la stampa dal piano.",
    "Initial Layer Travel Speed": "Velocità di spostamento dello strato iniziale",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "Indica la velocità di spostamento per lo strato iniziale. Un valore inferiore è consigliabile per evitare di rimuovere le parti precedentemente stampate dal piano di stampa. Il valore di questa impostazione può essere calcolato automaticamente dal rapporto tra la velocità di spostamento e la velocità di stampa.",
    "Initial Layer Print Speed": "Velocità di stampa strato iniziale",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.": "Indica la velocità di stampa per lo strato iniziale. Un valore inferiore è consigliabile per migliorare l’adesione al piano di stampa.",
    "Has Heated Build Plate": "Piano di stampa riscaldato",
    "Whether the machine has a heated build plate present.": "Indica se la macchina ha un piano di stampa riscaldato.",
    "Printing Temperature": "Temperatura di stampa",
    "The temperature used for printing.": "Indica la temperatura usata per la stampa.",
    "Printing Temperature Initial Layer": "Temperatura di stampa Strato iniziale",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "Indica la temperatura usata per la stampa del primo strato. Impostare a 0 per disabilitare la manipolazione speciale dello strato iniziale.",
    "Final Printing Temperature": "Temperatura di stampa finale",
    "The temperature to which to already start cooling down just before the end of printing.": "La temperatura alla quale può già iniziare il raffreddamento prima della fine della stampa.",
    "Build Plate Temperature": "Temperatura piano di stampa",
    "The temperature used for the heated build plate. If this is 0, the bed will not heat up for this print.": "Indica la temperatura usata per il piano di stampa riscaldato. Se è 0, il piano non si riscalda per questa stampa.",
    "Build Plate Temperature Initial Layer": "Temperatura piano di stampa Strato iniziale",
    "The temperature used for the heated build plate at the first layer.": "Indica la temperatura usata per il piano di stampa riscaldato per il primo strato.",
    "Diameter": "Diametro",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "Regolare il diametro del filamento utilizzato. Abbinare questo valore al diametro del filamento utilizzato.",
    "Flow": "Flusso",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "Determina la compensazione del flusso: la quantità di materiale estruso viene moltiplicata per questo valore.",
    "Records: {{from}} - {{to}} / {{total}}": "Documento: {{da}} - {{a}} / {{totale}}",
    "Records: {{total}}": "Documenti: {{total}}",
    "{{pageLength}} per page": "{{LunghezzaPagina}} per pagina",
    "This is an alpha feature that helps you get started with CNC Carving. Make sure you": "Questa è una caratteristica alfa che ti aiuta a iniziare con il Taglio CNC. Accertati di",
    "Read This First - Safety Information": "Leggi Prima Questo - Informazioi di Sicurezza",
    "before any further instructions.": "prima di ogni ulteriore istruzione.",
    "Don't show again in current session": "Non mostrare più nella sessione corrente",
    "Upload SVG File": "Carica File SVG",
    "Size": "Dimensione",
    "Work Speed": "Velocità di Lavoro",
    "Plunge Speed": "Velocità di Immersione",
    "Jog Speed": "Velocità di Avanzamento",
    "Grey Level": "Livello di Grigio",
    "Target Depth": "Profondità della Sagoma",
    "Cutting Diameter": "Diametro di Taglio",
    "Stop Height": "Ferma Avanzamento",
    "Command succeeded": "Comando riuscito",
    "Command failed ({{err}})": "Comando non riuscito ({{err}})",
    "Options": "Opzioni",
    "Command": "Comando",
    "Show notifications": "Mostra le notifiche",
    "Store": "Memorizza",
    "Server has halted intentionally by you": "Il server si è fermato intenzionalmente a causa tua",
    "Emergency stop triggered, Please restart the Snapmaker then reconnect.": "Arresto di emergenza attivato, Si prega di riavviare Snapmaker e riconnettersi.",
    "Reload": "Ricarica",
    "Reset": "Ripristina",
    "STOP": "FERMARE",
    "User Manual & FAQ": "Manuale dell'utente e FAQ",
    "Forum": "Forum",
    "Authentication failed.": "Autenticazione fallita.",
    "Sign in to {{name}}": "Accedi a {nome}}",
    "Username": "Nome Utente",
    "Password": "Password",
    "Sign In": "Accedi",
    "Forgot your password?": "Hai dimenticato la tua password?",
    "Learn more": "Per saperne di più",
    "Downloads": "Download",
    "Report an issue": "Segnala un problema",
    "Checking for updates...": "Verifica aggiornamenti...",
    "A new version of {{name}} is available": "Una nuova versione di {{nome}} è disponibile",
    "Version {{version}}": "Versione {{versione}}",
    "Latest version": "Ultima versione",
    "You already have the newest version of {{name}}": "Hai già la versione più recente di {{nome}}",
    "Account": "Account",
    "New": "Nuovo",
    "Account status": "Stato dell'account",
    "Confirm Password": "Conferma la Password",
    "Cancel": "Cancella",
    "OK": "OK",
    "An unexpected error has occurred.": "Si è verificato un errore imprevisto.",
    "Loading...": "Caricamento in corso...",
    "No data to display": "Nessun dato da visualizzare",
    "Enabled": "Abilitato",
    "Disabled": "Disabilitato",
    "Date Modified": "Data Modificata",
    "Action": "Azione",
    "Edit Account": "Modifica Account",
    "Delete Account": "Elimina Account",
    "Settings": "Inpostazioni",
    "My Account": "Il mio Account",
    "Are you sure you want to delete the account?": "Sei sicuro di voler eliminare l'account?",
    "Update": "Aggiorna",
    "Old Password": "Vecchia Password",
    "Change Password": "Cambia Password",
    "New Password": "Nuova Password",
    "Commands": "Comandi",
    "Title": "Titolo",
    "and more...": "e altro ancora ...",
    "Delete": "Elimina",
    "Are you sure you want to delete this item?": "Sei sicuro di voler eliminarequesta voce?",
    "Events": "Eventi",
    "Event": "Evento",
    "Choose an event": "Scegli un'evento",
    "Startup (System only)": "Avvio (Solo sistema)",
    "Open a serial port (System only)": "Apri una porta seriale (Solo sistema)",
    "Close a serial port (System only)": "Chiudi una porta seriale (Solo sistema)",
    "G-code: Load": "G-Code: Carica",
    "G-code: Unload": "G-Code: Scarica",
    "G-code: Start": "G-Code: Avvia",
    "G-code: Stop": "G-Code: Arresta",
    "G-code: Pause": "G-Code: Pausa",
    "G-code: Resume": "G-Code: Riprendi",
    "Feed Hold": "Mantenere la alimentazione",
    "Cycle Start": "Inizio del Ciclo",
    "Homing": "Homing",
    "Sleep": "Modalità Sleep",
    "Trigger": "Innesca",
    "Choose an trigger": "Scegli un innesco",
    "System": "Sistema",
    "G-code": "G-Code",
    "Startup": "Avvio",
    "Open a serial port": "Apri una porta seriale",
    "Close a serial port": "Chiudi una porta seriale",
    "Automatically check for updates": "Controlla automaticamente gli aggiornamenti",
    "Language": "Lingua",
    "Save Changes": "Salva Modifiche",
    "General": "Generale",
    "Workspace": "Area di Lavoro",
    "About": "Informazioni",
    "Restore Defaults": "Ropristina Impostazioni Predefinite",
    "Are you sure you want to restore the default settings?": "Sei sicuro di voler ripristinare le impostazioni predefinite?",
    "The account name is already being used. Choose another name.": "Il nome dell'account è già in uso. Scegli un altro nome.",
    "Passwords do not match.": "Le password non corrispondono.",
    "3D Printing G-code Generator": "Generatore di Codici G Stampa 3D",
    "Laser G-code Generator": "Generatore di Codici G Laser",
    "CNC G-code Generator": "Generatore di Codici G CNC",
    "Fork Widget": "Inserisci Widget",
    "Are you sure you want to fork this widget?": "Sei sicuro di voler inserire questo widget?",
    "Remove Widget": "Rimuovi Widget",
    "Are you sure you want to remove this widget?": "Sei sicuro di voler rimuovere questo widget?",
    "On": "Acceso",
    "Off": "Spento",
    "Visualizer Widget": "Visualizzatore Widget",
    "This widget visualizes a G-code file and simulates the tool path.": "Questo widget visualizza un file G-code e simula il percorso dello strumento.",
    "Connection Widget": "Connessione Widget",
    "This widget lets you establish a connection to a serial port.": "Questo widget ti consente di stabilire una connessione a una porta seriale.",
    "Console Widget": "Quadro di Comando Wiget",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "Questo widget consente di leggere e scrivere dati sul controller CNC collegato a una porta seriale.",
    "Grbl Widget": "Widget Grbi",
    "This widget can view Grbl state and settings.": "Questo widget può visualizzare lo stato e le impostazioni di Grbl.",
    "Marlin Widget": "Widget Marlin",
    "This widget can view Marlin state and settings.": "Questo widget può visualizzare lo stato e le impostazioni di Marlin.",
    "Smoothie Widget": "Widget Smoothie",
    "This widget can view Smoothie state and settings.": "Questo widget può visualizzare lo stato e le impostazioni di Smoothie",
    "TinyG Widget": "Widget TinyG",
    "This widget can view TinyG state and settings.": "Questo widget può visualizzare lo stato e le impostazioni di TinyG",
    "Axes Widget": "Widget Axes",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Questo widget mostra la posizione XYZ. Include controlli di avanzamento, homing e azzeramento dell'asse.",
    "G-code Widget": "Widget G-Code",
    "This widget shows the current status of G-code commands.": "Questo widget mostra lo stato corrente dei comandi G-code.",
    "Laser Widget": "Widget Laser",
    "This widget allows you control laser intensity and turn the laser on/off.": "Questo widget ti consente di controllare l'intensità del laser e accendere / spegnere il laser.",
    "Webcam Widget": "Widget Webcam",
    "This widget lets you monitor a webcam.": "Questo widget ti consente di monitorare una webcam.",
    "Widgets": "Widget",
    "Server has stopped working": "Il server ha smesso di funzionare",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "Un problema ha causato il corretto funzionamento del server. Controlla lo stato del server e riprova.",
    "Close": "Chiudi",
    "This field is required.": "Questo campo è obbligatorio.",
    "Passwords should be equal.": "Le password dovrebbero essere uguali.",
    "mm": "mm",
    "in": "in",
    "Axis": "Asse",
    "Work Position": "Posizione di Lavoro",
    "Go To Work Zero On X Axis (G0 X0)": "Lavora su Zero On sull'asse X (G0 X0)",
    "Zero Out Temporary X Axis (G92 X0)": "Asse X Zero out Temporaneo (G92 X0)",
    "Go To Work Zero On Y Axis (G0 Y0)": "Lavora su Zero On sull'asse Y (G0 Y0)",
    "Zero Out Temporary Y Axis (G92 Y0)": "Asse Y Zero out Temporaneo (G92 Y0)",
    "Go To Work Zero On Z Axis (G0 Z0)": "Lavora su Zero On sull'asse Z (G0 Z0)",
    "Zero Out Temporary Z Axis (G92 Z0)": "Asse Z Zero out Temporaneo (G92 Z0)",
    "Axes": "Asse",
    "Keypad jogging": "Jogging della tastiera",
    "Expand": "Espandi",
    "Collapse": "Collassa",
    "More": "Altro",
    "Enter Full Screen": "Entra nella Modalità a Schermo Intero",
    "Exit Full Screen": "Esci dalla Modalità a Schermo Intero",
    "User Defined": "Definito dall'utente",
    "Custom distance for every move operation": "Distanza personalizzata per ogni operazione di spostamento",
    "Increase custom distance by one unit": "Aumenta la distanza personalizzata di un'unità",
    "Decrease custom distance by one unit": "Diminuisci la distanza personalizzata di un'unità",
    "Move X- Y+": "Sposta X-Y +",
    "Move Y+": "Sposta Y+",
    "Move X+ Y+": "Sposta X+ Y+",
    "Move Z+": "Sposta Z+",
    "Move X-": "Sposta X-",
    "Move To XY Zero (G0 X0 Y0)": "Passare a XY Zero (G0 X0 Y0)",
    "Move X+": "Sposta X+",
    "Move To Z Zero (G0 Z0)": "Passare a Z Zero (G0 Z0)",
    "Move X- Y-": "Sposta X- Y-",
    "Move Y-": "Sposta Y-",
    "Move X+ Y-": "Sposta X+ Y-",
    "Move Z-": "Sposta Z-",
    "Right": "Destra",
    "Left": "Sinistra",
    "Up": "Sopra",
    "Down": "Sotto",
    "Page Up": "Pagina su",
    "Page Down": "Pagina giù",
    "0.1x Move": "Sposta di 0.1x",
    "Alt": "Alt",
    "10x Move": "Sposta di 10x",
    "⇧ Shift": "⇧ Shift",
    "Run Boundary": "Esegui il Contorno",
    "Click to check the boundary of the image to be engraved.": "Clicca per controllare il contorno dell'immagine da incidere.",
    "Go To Work Origin": "Vai su Risorsa di Lavoro",
    "Move the head to the last saved work origin.": "Sposta la testa sull'ultima risorsa di lavoro salvata.",
    "Set Work Origin": "Imposta l'Origine del Lavoro",
    "Set the current position of the head as the work origin.": "Imposta la posizione corrente della testina come origine del lavoro.",
    "Shuttle Settings": "Impostazione della Spola",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "Intervallo di frequenza di alimentazione: {{min}} - {{max}} mm / min",
    "Repeat Rate: {{hertz}}Hz": "Frequenza di ripetizione: {{hertz}} Hz",
    "60 Times per Second": "60 volte al secondo",
    "45 Times per Second": "45 volte al secondo",
    "30 Times per Second": "30 volte al secondo",
    "15 Times per Second": "15 volte al secondo",
    "10 Times per Second": "10 volte al secondo",
    "5 Times per Second": "5 volte al secondo",
    "2 Times per Second": "2 volte al secondo",
    "Once Every Second": "1 al secondo",
    "Distance Overshoot: {{overshoot}}x": "Distanza Sformaneti: {sforamenti}}x",
    "Determines how fast the tool moves when it’s not carving.": "Determina la velocità con cui lo strumento si muove quando non intaglia.",
    "Determines how fast the tool feeds into the material.": "Determina la velocità di avanzamento dello strumento nel materiale.",
    "Generate G-code": "Genera codice G",
    "Output": "Uscita",
    "Load G-code to Workspace": "Carica il Codice G su Workspace",
    "Export G-code to file": "Esporta il codice G nel file",
    "Carving Path": "Percorso di intaglio",
    "Carve Path": "Percorso  d'intaglio",
    "Select a carve path:": "Seleziona il percorso di intaglio",
    "Carve along the contour of the image.": "Scolpisci lungo il contorno dell'immagine.",
    "Carve along the shape of the image.": "Scolpisci lungo la forma dell'immagine.",
    "Outline": "Contorno",
    "On the Path": "Sul Percorso",
    "Choose carve path": "Scegli il percorso d'intaglio",
    "Resolution": "Risoluzione",
    "The detected resolution of the loaded image.": "La risoluzione rilevata dell'immagine caricata.",
    "Size (mm)": "Dimensione (mm)",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "Inserisci la dimensione dell'immagine incisa La dimensione non può essere superiore a 125 x 125 mm o la dimensione del tuo materiale.",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "Inserisci la profondità dell'immagine incisa La profondità non può essere più profonda della lunghezza del flauto.",
    "Step Down": "Abbassa",
    "Enter the depth of each carving step.": "Immettere la profondità di ogni passaggio di intaglio.",
    "Jog Height": "Quota di Avanzamento",
    "The distance between the tool and the material when it’s not carving.": "La distanza tra lo strumento e il materiale quando non si intaglia.",
    "The distance between the tool and the material when the machine stops.": "La distanza tra lo strumento e il materiale quando la macchina si ferma.",
    "Alignment": "Allineamento",
    "None": "Nessuno",
    "Tab Height": "Altezza della Scheda",
    "Enter the height of the tabs.": "Inserisci l'altezza della scheda",
    "Tab Space": "Spazio della Scheda",
    "Enter the space between any two tabs.": "Inserisci lo spazio tra due schede qualsiasi.",
    "Tab Width": "Larghezza della Scheda",
    "Enter the width of the tabs.": "Inserisci la larghezza delle schede.",
    "Preview": "Anteprima",
    "Carving Tool": "Strumento d'Intaglio",
    "Carving V-Bit": "Intaglio a V",
    "Flat End Mill": "Flat End Mill",
    "Ball End Mill": "Ball End Mill",
    "Use Other Bit": "Usa altro bit",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "Inserisci il diametro della parte più larga della lama. Si prega di notare che non è il diametro dello stelo.",
    "For the carving bits that we provide, please enter the following value:": "Per i pezzi di intaglio che forniamo, inserisci il seguente valore:",
    "Point Angle": "Angolo a Punta",
    "Enter the angle of the blade.": "Inserisci l'angolo della lama.",
    "fullscreen": "A schermo intero",
    "Manufacturer: {{manufacturer}}": "Produttore: {{produttore}}",
    "Port": "Porta",
    "No ports available": "Nessuna porta disponibile",
    "Choose a port": "Scegli una porta",
    "Refresh": "Ricarica",
    "Open": "Apri",
    "Error opening serial port '{{- port}}'": "Errore durante l'apertura della porta seriale '{{- port}}'",
    "Connection": "Connessione",
    "No serial connection": "Nessuna connessione seriale",
    "Connected to {{-port}}": "Connesso a {{-port}}",
    "Console": "Quadro di comando",
    "Clear all": "Cancella tutto",
    "Min": "Minimo",
    "Max": "Massimo",
    "Dimension": "Dimensione",
    "Sent": "Invia",
    "Received": "Ricevuto",
    "Start Time": "Ora di inizio",
    "Elapsed Time": "Tempo trascorso",
    "Finish Time": "Tempo finale",
    "Remaining Time": "Tempo rimanente",
    "Laser": "Laser",
    "Laser On": "Laser Acceso",
    "Laser Off": "Laser Spento",
    "Save (SD Card)": "Salva (scheda SD)",
    "Hide": "Nascondi",
    "Show": "Mostra",
    "Laser Test": "Test Laser",
    "Power (%)": "Energia",
    "Test duration": "Durata del test",
    "ms": "ms",
    "Maximum value": "Valore massimo",
    "Determines how fast the machine moves when it’s not engraving.": "Determina la velocità con cui la macchina si muove quando non sta incidendo.",
    "Determines how fast the machine moves when it’s engraving.": "Determina la velocità con cui la macchina si muove quando incide.",
    "Dwell Time": "Tempo di sosta",
    "Determines how long the laser keeps on when it’s engraving a dot.": "Determina per quanto tempo il laser rimane acceso quando incide un punto.",
    "B&W": "B&W",
    "Set the proportion of the black color based on the original color of the image.": "Imposta la proporzione del colore nero in base al colore originale dell'immagine.",
    "Line Direction": "Direzione della linea",
    "Select the direction of the engraving path.": "Seleziona la direzione dell'intaglio.",
    "Horizontal": "Orizzontale",
    "Vertical": "Verticale",
    "Diagonal": "Diagonale",
    "Diagonal2": "Diagonale2",
    "Choose an algorithm": "Scegli un algoritmo",
    "Density": "Densità",
    "Contrast": "Contrasto",
    "The difference between the lightest color and the darkest color.": "Seleziona la direzione del percorso di incisione.",
    "Brightness": "Luminosità",
    "The engraved picture is brighter when this value is bigger.": "L'immagine incisa è più luminosa quando questo valore è più grande.",
    "White Clip": "Clip bianca",
    "Set the threshold to turn the color that is not pure white into pure white.": "Imposta la soglia per trasformare il colore che non è bianco puro in bianco puro.",
    "Algorithm": "Algoritmo",
    "Choose an algorithm for image processing.": "Scegli un algoritmo per l'elaborazione dell'immagine.",
    "Preview Settings": "Impostazioni di anteprima",
    "(default image)": "(immagine predefinita)",
    "Parse Image Error": "Errore di Analisi dell'Immagine",
    "Failed to parse image file {{}}": "Impossibile analizzare il file immagine {{}}",
    "GREYSCALE": "SCALA DI GRIGI",
    "VECTOR": "VETTORE",
    "TEXT": "TESTO",
    "Source Type": "Tipo di fonte",
    "Raster": "Trama",
    "SVG": "SVG",
    "Upload Image": "Carica immagine",
    "Middle": "Intermedio",
    "Center": "Centrare",
    "Bottom Left": "In basso a sinistra",
    "Bottom Middle": "In basso in mezzo",
    "Bottom Right": "In basso a destra",
    "Top Left": "In alto a sinistra",
    "Top Middle": "In alto in mezzo",
    "Top Right": "In alto a destra",
    "Text": "Testo",
    "Font": "Fonte",
    "Choose font": "Scegli il carattere",
    "Enter the font size in pt (points).": "Immettere la dimensione del carattere in pt (punti).",
    "Line Height": "Altezza della Linea",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "Imposta la distanza tra ogni riga nel testo. Il valore inserito è il multiplo della dimensione del carattere.",
    "Align the text in different lines to either the left or right or in the center horizontally.": "Allinea orizzontalmente il testo su linee diverse a sinistra o destra o al centro.",
    "Anchor": "Ancora",
    "Find the anchor of the text to correspond to the (0, 0) coordinate.": "Trova l'ancora del testo per corrispondere alla coordinata (0, 0).",
    "Impurity Size": "Dimensione dell'impurità",
    "Determines the minimum size of impurity which allows to be showed.": "Determina la dimensione minima di impurità che consente di essere mostrata.",
    "Invert": "Inverti",
    "Inverts black to white and vise versa.": "Inverti il nero al bianco e viceversa.",
    "Optimize Path": "Ottimizza il percorso",
    "Optimizes the path based on the proximity of the lines in the image.": "Ottimizza il percorso in base alla vicinanza delle linee nell'immagine.",
    "Fine Tune Work Origin": "Origine di Lavoro Sintonizzazione",
    "How Fine Tune Work Origin Works": "Come Funziona la Macchina per Affinare",
    "Click": "Clicca",
    "Focus": "Mettere a fuoco",
    "and use": "e usa",
    "Jog Pad": "Avvio Imbottitura",
    "Generate and Load G-code": "Genera e carica il codice G",
    "and the G-code is automatically generated and loaded.": "e il codice G viene generato e caricato automaticamente.",
    "to start laser cutting.": "per iniziare il taglio laser.",
    "Determines how fast the machine moves when it’s working.": "Determina la velocità di movimento della macchina quando è in funzionamento",
    "Power": "Energia",
    "Power to use when laser is working.": "Energia da usare quando il laser sta funzionando.",
    "Enable 3D View": "Abilita la prospettiva in 3D",
    "Disable 3D View": "Disabilita la prospettiva in 3D",
    "Hide Coordinate System": "Nascondi sistema di coordinate",
    "Show Coordinate System": "Mostra sistema di coordinate",
    "File folder": "Cartella di file",
    "{{extname}} File": "{{extname}} File",
    "File": "File",
    "Reset Position": "Ripristina posizione",
    "Zoom In": "Ingrandisci",
    "Zoom Out": "Rimpicciolisci",
    "Controller State": "Stato del Controller",
    "Controller Settings": "Impostazioni del Controller",
    "3D Printer": "Stampante 3d",
    "CNC": "CNC",
    "Set": "Impostato",
    "Save": "Salva",
    "F": "F",
    "Adjust feedrate percentage, which applies to moves along all axis.": "Regola la percentuale di avanzamento, che si applica agli spostamenti lungo tutto l'asse.",
    "Nozzle Temperature": "Temperatura dell'Ugello",
    "Bed Temperature": "Cattiva Temperatura",
    "Tool Head Power": "Potenza della testa dell'utensile",
    "ON": "ACCESO",
    "OFF": "Spento",
    "Quality": "Qualità",
    "Shell": "Involucro",
    "Infill": "Riempimento",
    "Speed": "Velocità",
    "Retract & Z Hop": "Ritrai e Z Hop",
    "Surface": "Superficie",
    "Recommended": "Consigliato",
    "Customize": "Personalizzata",
    "Fast Print": "Stampa veloce",
    "Normal Quality": "Qualità Normale",
    "High Quality": "Alta Qualità",
    "Show Details": "Mostra Dettagli",
    "Profile": "Profilo",
    "Printing Settings": "Impostazioni di stampa",
    "Material & Support": "Materiale e Supporto",
    "Custom Material": "Materiale Personalizzato",
    "Adhesion": "Adesione",
    "Support": "Supporto",
    "Touch Building Plate": "Touch Building Plate",
    "Everywhere": "Ovunque",
    "Slicing {{progress}}%": "Tagliando {{progress}}%",
    "Slice error: ": "",
    "Parsing G-code...": "Analizzando il codice G…",
    "Loading model...": "Caricamento del modello ...",
    "Pre-processing model...": "Modello di pre-elaborazione ...",
    "Preparing for slicing...": "Preparando a tagliare...",
    "Upload File": "Carica file",
    "G-code not loaded": "File G-Code non caricato",
    "Projection": "Proiezione",
    "Perspective Projection": "Proiezione della Prospettiva",
    "Orthographic Projection": "Proiezione Ortografica",
    "Scene Objects": "Oggetti di scena",
    "Display G-code Filename": "Visualizza nome file G-Code",
    "Hide Toolhead": "Nascondi la testa di comando",
    "Show Toolhead": "Mostra la testa di comando",
    "3D rendering...": "esecuzione 3D...",
    "Move the camera": "Sposta la videocamera",
    "Rotate the camera": "Ruota la videocamera",
    "Watch Directory": "Guarda l'elenco",
    "Name": "Nome",
    "Type": "Tipo",
    "Load G-code": "Carica G-Code",
    "Upload G-code": "Carica il G-Code",
    "Run": "Avvia",
    "Pause": "Pausa",
    "Stop": "Arresta",
    "Webcam": "Webcam",
    "Edit": "Modifica",
    "Enable": "Abilita",
    "Disable": "Disabilita",
    "Webcam Settings": "Impostazioni della Webcam",
    "Media Source": "Fonte multimediale",
    "Use a built-in camera or a connected webcam": "Utilizzare una fotocamera integrata o una webcam collegata",
    "Use a M-JPEG stream over HTTP": "Usa uno stream M-JPEG su HTTP",
    "Webcam is off": "La webcam è spenta",
    "Rotate Left": "Ruota a sinistra",
    "Rotate Right": "Ruota a destra",
    "Flip Horizontally": "Capovolgi orizzontalmente",
    "Flip Vertically": "Capovolgi verticalmente",
    "Crosshair": "Mirino",
    "Note: If you are using the CNC Carving Module, make sure the carving bit will not run into the fixtures before you use this feature.": "Nota: se si utilizza il modulo di taglio del CNC, assicurarsi che la punta di taglio non entri nei dispositivi prima di utilizzare questa funzione.",
    "Enter the text you want to engrave. The maximum length of the text is 125 mm. When the text is too long, it will be shrunk automatically. Start a new line manually according to your needs.": "Inserisci il testo che desideri incidere. La lunghezza massima del testo è di 125 mm. Quando il testo è troppo lungo, verrà ridotto automaticamente. Inizia una nuova linea manualmente in base alle tue esigenze.",
    "Setting work origin is essentially finding the best place for the engraved image in the X and Y directions and determining the distance (Z Offset) between the Engraving & Carving Platform and the Laser Module to acquire the smallest laser dot on the material for the most efficient use of the laser power and the best result. For the 200mW Laser Engraving Module, the Z Offset can be set by judging the size of the laser dot by eyes with low power. However, for the 1600mW Laser Cutting Module, this method is less accurate as the laser dot is too strong and less interpretable. To set the Z Offset more accurately, we can move the module to the position that is close to the optimal Z Offset (Offset A). The software will test the results from a few positions next to Offset A on the same material. The best result determines the best Z Offset.": "L'impostazione dell'origine del lavoro consiste essenzialmente nel trovare il posto migliore per l'immagine incisa nelle direzioni X e Y e nel determinare la distanza (Offset Z) tra la piattaforma di Incisione e Tahlio e il modulo laser per acquisire il più piccolo punto laser sul materiale per l'uso più efficiente della potenza del laser e il miglior risultato. Per il Modulo di Incisione Laser da 200 mW, l'offset Z può essere impostato giudicando a vista le dimensioni del punto laser a bassa potenza. Tuttavia, per il Modulo di Taglio Laser da 1600 mW, questo metodo è meno preciso in quanto il punto laser è troppo forte e meno interpretabile. Per impostare l'offset Z in modo più accurato, possiamo spostare il modulo nella posizione che si trova vicino all'offset Z ottimale (offset A). Il software testerà i risultati da poche posizioni accanto a Offset A sullo stesso materiale. Il miglior risultato determina il miglior Z Offset.",
    "in the Axes section to move the Laser Cutting Module to the position that is close to the optimal Z Offset (just like how you do with the 200mW Laser Engraving Module).": "nella sezione Assi per spostare il modulo di taglio laser nella posizione che si trova vicino all'offset Z ottimale (proprio come nel caso del modulo di incisione laser da 200 mW).",
    "Set Work Speed and Power based on the material you are using. If you are using a piece of 1.5 mm wood sheet, it’s recommended to set the Work Speed to a value between 80 mm/s and 120 mm/s and set the Power to 100%.": "Imposta la velocità di lavoro e la potenza in base al materiale che stai utilizzando. Se si utilizza un foglio di legno da 1,5 mm, si consiglia di impostare la velocità di lavoro su un valore compreso tra 80 mm / se 120 mm / se impostare la potenza su 100%.",
    "Choose the position that can cut the material the most smoothly or engrave the thinnest line and the software will set it as Z Offset. In this example, -2.0 should be the Z Offset.": "Scegli la posizione che può tagliare il materiale nel modo più fluido o incidere la linea più sottile e il software la imposta come Offset Z. In questo esempio, -2.0 dovrebbe essere l'offset Z.",
    "Parse File Error": "Errore di Analisi del File",
    "Failed to parse image file {{filename}}": "Impossibile analizzare il file immagine {{nomefile}}",
    "Tool Head Status (M3)": "Stato testa utensile (M3)",
    "Skirt": "Fiancheggiare",
    "Brim": "Margine",
    "Raft": "Serie",
    "Normal": "Normale",
    "Both": "Entrambi",
    "Warning": "Avvertimento",
    "Slicing completed.": "Taglio completato",
    "Parsed G-code successfully.": "Codice G analizzato con successo.",
    "Failed to parse G-code: ": "",
    "Loaded model successfully.": "Modello caricato con successo.",
    "Failed to load model.": "Impossibile caricare il modello.",
    "Rendered G-code successfully.": "Codice G Reso con Successo",
    "Tabs": "Scheda",
    "Upload": "",
    "Find the anchor of the image to correspond to the (0, 0) coordinate.": "",
    "Choose algorithms": "",
    "New Update Available": "Nuovo aggiornamento disponibile",
    "A web-based interface for Snapmaker which is able to do 3D Printing, laser engraving and CNC carving.": "",
    "Determines how fast the tool moves on the material.": "Determina la velocità con cui lo strumento si sposta sul materiale.",
    "Select the type of the image you want to upload. Raster supports PNG and JPEG images, while SVG only supports SVG images. The Raster images will be transferred into SVG automatically.": "Imposta la velocità di lavoro e la potenza in base al materiale che stai utilizzando. Se si utilizza un foglio di legno da 1,5 mm, si consiglia di impostare la velocità di lavoro su un valore compreso tra 80 mm/s e 120 mm/s e impostare la potenza su 100%.",
    "Select a word font or upload a font from your computer. WOFF, TTF, OTF fonts are supported.": "",
    "Fill Density": "",
    "Determines how fine and smooth the engraved picture will be. The bigger this value is, the better quality you will get. The range is 1-10 dot/mm and 10 is recommended.": "",
    "Center Left": "",
    "Center Right": "",
    "Center Selected Model": "",
    "Delete Selected Model": "",
    "Duplicate Selected Model": "",
    "Reset Selected Model Transformation": "",
    "Clear Build Plate": "",
    "Arrange All Models": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the text will be engraved without fill.": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the SVG image will be engraved without fill.": "",
    "Next": "",
    "Clip": "",
    "Passes": "",
    "Pass Depth": "",
    "STL File (Binary) (*.stl)": "",
    "STL File (ASCII) (*.stl)": "",
    "OBJ File (*.obj)": "",
    "Export Models": "",
    "Only SVG files are supported.": "",
    "Drop an SVG file here.": "",
    "Only STL/OBJ files are supported.": "",
    "Drop an STL/OBJ file here.": "",
    "Only G-code files are supported": "",
    "Drop a G-code file here.": "",
    "When enabled, the printer will run the G-code multiple times automatically according to the below settings. This feature helps you cut materials that can't be cut with only one pass.": "",
    "Determines how many times the printer will run the G-code automatically.": "",
    "Determines how much the laser module will be lowered after each pass.": "",
    "Fixed Power": "",
    "Multi-pass": "",
    "When enabled, the power used to engrave this image will be set in the G-code, so it is not affected by the power you set in Workspace.": "",
    "Fill": "",
    "Only {{accept}} files are supported.": "",
    "Drop an image file here.": "",
    "Lay Flat Selected Model": ""
}
