{
    "Generate Support": "Stützstruktur generieren",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "Damit werden Strukturen zur Unterstützung von Modellteilen mit Überhängen generiert. Ohne diese Strukturen würden solche Teile während des Druckvorgangs zusammenfallen.",
    "Build Plate Adhesion Type": "Druckplattenhaftungstyp",
    "Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "Verschiedene Optionen, die die Materialbereitstellung für die Extrusion und die Haftung am Druckbett verbessern. Durch die Brim-Funktion wird ein flacher, einschichtiger Bereich um die Basis des Modells herum hinzugefügt, um Warping zu verhindern. Durch die Raft-Funktion wird ein dickes Gitter mit Dach unter dem Modell hinzugefügt. Das Skirt-Element ist eine Linie, die um das Modell herum gedruckt wird, aber nicht mit dem Modell verbunden ist.",
    "Initial Layer Line Width": "Linienbreite der ersten Schicht",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "Multiplikator der Linienbreite der ersten Schicht. Eine Erhöhung dieses Werts verbessert möglicherweise die Betthaftung.",
    "Spiralize Outer Contour": "Spiralisieren der äußeren Konturen",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "Durch Spiralisieren wird die Z-Bewegung der äußeren Kante geglättet. Dies führt zu einem konstanten Z-Anstieg des gesamten Drucks. Diese Funktion wandelt ein solides Modell in einen Druck mit Einzelwänden und einem soliden Boden um. Diese Funktion sollte nur aktiviert werden, wenn jede Schicht nur ein einzelnes Teil enthält.",
    "Surface Mode": "Oberflächenmodus",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "Behandelt das Modell nur als Oberfläche, Volumen oder Volumen mit losen Oberflächen. Der Normaldruck-Modus druckt nur umschlossene Volumen. „Oberfläche“ druckt eine einzelne Wand und verfolgt die Mesh-Oberfläche ohne Füllung und ohne obere/untere Außenhaut. „Beide“ druckt umschlossene Volumen wie üblich und alle verbleibenden Polygone als Oberflächen.",
    "Travel Speed": "Bewegungsgeschwindigkeit",
    "The speed at which travel moves are made.": "Die Geschwindigkeit, mit der Bewegungen durchgeführt werden.",
    "Top/Bottom Speed": "Geschwindigkeit obere/untere Schicht",
    "The speed at which top/bottom layers are printed.": "Die Geschwindigkeit, mit der die oberen/unteren Schichten gedruckt werden.",
    "Inner Wall Speed": "Geschwindigkeit Innenwand",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "Die Geschwindigkeit, mit der alle Innenwände gedruckt werden. Wenn die Innenwand schneller als die Außenwand gedruckt wird, wird die Druckzeit reduziert. Es wird empfohlen, diese Geschwindigkeit zwischen der Geschwindigkeit für die Außenwand und der Füllgeschwindigkeit einzustellen.",
    "Outer Wall Speed": "Geschwindigkeit Außenwand",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "Die Geschwindigkeit, mit der die Außenwände gedruckt werden. Durch das Drucken der Außenwand bei einer niedrigeren Geschwindigkeit wird eine bessere Endqualität der Außenhaut erreicht. Wenn allerdings zwischen der Geschwindigkeit für die Innenwand und jener für die Außenwand ein zu großer Unterschied besteht, wird die Qualität negativ beeinträchtigt.",
    "Infill Speed": "Füllgeschwindigkeit",
    "The speed at which infill is printed.": "Die Geschwindigkeit, mit der die Füllung gedruckt wird.",
    "Print Speed": "Druckgeschwindigkeit",
    "The speed at which printing happens.": "Die Geschwindigkeit, mit der gedruckt wird.",
    "Retraction Speed": "Einzugsgeschwindigkeit",
    "The speed at which the filament is retracted and primed during a retraction move.": "Die Geschwindigkeit, mit der das Filament während einer Einzugsbewegung eingezogen und zurückgeschoben wird.",
    "Retraction Distance": "Einzugsabstand",
    "The length of material retracted during a retraction move.": "Die Länge des Materials, das während der Einzugsbewegung eingezogen wird.",
    "Retract at Layer Change": "Einziehen bei Schichtänderung",
    "Retract the filament when the nozzle is moving to the next layer.": "Ziehen Sie das Filament ein, wenn die Düse zur nächsten Schicht fährt. ",
    "Enable Retraction": "Einzug aktivieren",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "Das Filament wird eingezogen, wenn sich die Düse über einen nicht zu bedruckenden Bereich bewegt. ",
    "Infill Density": "Fülldichte",
    "Adjusts the density of infill of the print.": "Passt die Fülldichte des Drucks an.",
    "Bottom Thickness": "Untere Dicke",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "Die Dicke der unteren Schichten des Drucks. Dieser Wert geteilt durch die Schichtdicke bestimmt die Anzahl der unteren Schichten.",
    "Top Thickness": "Obere Dicke",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "Die Dicke der oberen Schichten des Drucks. Dieser Wert geteilt durch die Schichtdicke bestimmt die Anzahl der oberen Schichten.",
    "Wall Thickness": "Wanddicke",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "Die Dicke der Wände in horizontaler Richtung. Dieser Wert geteilt durch die Wandliniendicke bestimmt die Anzahl der Wände.",
    "Initial Layer Height": "Dicke der ersten Schicht",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.": "Die Dicke der ersten Schicht in mm. Eine dicke erste Schicht erleichtert die Haftung am Druckbett.",
    "Layer Height": "Schichtdicke",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "Die Dicke jeder Schicht in mm. Bei höheren Werten werden schnellere Drucke mit niedrigerer Auflösung hergestellt, bei niedrigeren Werten langsamere Drucke mit höherer Auflösung.",
    "Z Hop Height": "Z-Spring Höhe",
    "The height difference when performing a Z Hop.": "Der Höhenunterschied bei Ausführung eines Z-Sprungs.",
    "Z Hop When Retracted": "Z-Sprung beim Einziehen",
    "Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.": "Nach dem Einzug wird das Druckbett gesenkt, um einen Abstand zwischen Düse und Druck herzustellen. Das verhindert, dass die Düse den Druck während der Bewegungen anschlägt und verringert die Möglichkeit, dass der Druck vom Druckbett heruntergestoßen wird.",
    "Initial Layer Travel Speed": "Bewegungsgeschwindigkeit für die erste Schicht",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "Die Bewegungsgeschwindigkeit für die erste Schicht. Ein niedrigerer Wert wird empfohlen, um das Wegziehen zuvor gedruckter Teile von der Druckplatte zu vermeiden. Der Wert dieser Einstellung kann automatisch aus dem Verhältnis zwischen Bewegungsgeschwindigkeit und Druckgeschwindigkeit errechnet werden.",
    "Initial Layer Print Speed": "Druckgeschwindigkeit für die erste Schicht",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.": "Die Druckgeschwindigkeit für die erste Schicht. Ein niedrigerer Wert wird empfohlen, um die Haftung an der Druckplatte zu verbessern.",
    "Has Heated Build Plate": "Mit beheizter Druckplatte",
    "Whether the machine has a heated build plate present.": "Option für vorhandene beheizte Druckplatte.",
    "Printing Temperature": "Drucktemperatur",
    "The temperature used for printing.": "Die Temperatur, die für das Drucken verwendet wird.",
    "Printing Temperature Initial Layer": "Drucktemperatur erste Schicht",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "Die Temperatur, die für das Drucken der ersten Schicht verwendet wird. Wählen Sie hier 0, um eine spezielle Behandlung der ersten Schicht zu deaktivieren.",
    "Final Printing Temperature": "Endgültige Drucktemperatur",
    "The temperature to which to already start cooling down just before the end of printing.": "Die Temperatur, bei der das Abkühlen bereits beginnen kann, bevor der Druck beendet wird.",
    "Build Plate Temperature": "Temperatur Druckplatte",
    "The temperature used for the heated build plate. If this is 0, the bed will not heat up for this print.": "Die Temperatur, die für die erhitzte Druckplatte verwendet wird. Wenn dieser Wert 0 beträgt, wird das Bett für diesen Druck nicht erhitzt.",
    "Build Plate Temperature Initial Layer": "Temperatur der Druckplatte für die erste Schicht",
    "The temperature used for the heated build plate at the first layer.": "Die Temperatur, die für die erhitzte Druckplatte an der ersten Schicht verwendet wird.",
    "Diameter": "Durchmesser",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "Der Durchmesser des verwendeten Filaments wird angepasst. Stellen Sie hier den Durchmesser des verwendeten Filaments ein.",
    "Flow": "Fluss",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "Fluss-Kompensation: Die extrudierte Materialmenge wird mit diesem Wert multipliziert.",
    "Records: {{from}} - {{to}} / {{total}}": "Aufnahmen {{from}} - {{to}} / {{total}}",
    "Records: {{total}}": "Aufnahmen {{total}}",
    "{{pageLength}} per page": "{{pageLength}} pro Seite",
    "This is an alpha feature that helps you get started with CNC Carving. Make sure you": "Dies ist eine Alpha-Funktion, die Ihnen den Einstieg in das Fräsen mit CNC ermöglicht. Stellen Sie sicher",
    "Read This First - Safety Information": "Information Zuerst lesen - Sicherheitshinweise",
    "before any further instructions.": "Vor jeder weiteren Anweisung.",
    "Don't show again in current session": "In der aktuellen Sitzung nicht mehr anzeigen",
    "Upload SVG File": "SVG- Datei hochladen",
    "Size": "Größe",
    "Work Speed": "Arbeitsgeschwindigkeit",
    "Plunge Speed": "Eintauchgeschwindigkeit",
    "Jog Speed": "Jog-Geschwindigkeit",
    "Grey Level": "Graustufe",
    "Target Depth": "Zieltiefe",
    "Cutting Diameter": "Schnittdurchmesser",
    "Stop Height": "Stopphöhe",
    "New Update Available": "Neues Update verfügbar",
    "Command succeeded": "Befehl erfolgreich",
    "Command failed ({{err}})": "Befehl fehlgeschlagen ({{err}})",
    "Options": "Optionen",
    "Command": "Befehl",
    "Show notifications": "Benachrichtigungen anzeigen",
    "Store": "Geschäft",
    "Server has halted intentionally by you": "Server wurde absichtlich von Ihnen angehalten",
    "Emergency stop triggered, Please restart the Snapmaker then reconnect.": "Notstopp ausgelöst, Bitte starten Sie den Snapmaker neu und verbinden Sie erneut.",
    "Reload": "Neuladen",
    "Reset": "Zurücksetzen",
    "STOP": "STOPP",
    "User Manual & FAQ": "Benutzerhandbuch & FAQ",
    "Forum": "Forum",
    "Authentication failed.": "Authentifizierung fehlgeschlagen.",
    "Sign in to {{name}}": "Anmelden als {{name}}",
    "Username": "Nutzername",
    "Password": "Passwort",
    "Sign In": "Anmelden",
    "Forgot your password?": "Haben Sie Ihr Passwort vergessen?",
    "Learn more": "Mehr erfahren",
    "Downloads": "Downloads",
    "Report an issue": "Ein Problem melden",
    "Checking for updates...": "Nach Updates suchen...",
    "A new version of {{name}} is available": "Eine neue Version von {{name}} ist verfügbar",
    "Version {{version}}": "Version {{Version}}",
    "Latest version": "Letzte Version",
    "You already have the newest version of {{name}}": "Sie haben bereits die neueste Version von {{name}}",
    "Account": "Konto",
    "New": "Neu",
    "Account status": "Kontostatus",
    "Confirm Password": "Passwort bestätigen",
    "Cancel": "Stornieren",
    "OK": "OK",
    "An unexpected error has occurred.": "Ein unerwarteter Fehler ist aufgetreten.",
    "Loading...": "Wird geladen...",
    "No data to display": "Keine Daten zum Anzeigen",
    "Enabled": "Aktiviert",
    "Disabled": "Deaktiviert",
    "Date Modified": "Datum geändert",
    "Action": "Aktion",
    "Edit Account": "Konto bearbeiten",
    "Delete Account": "Konto löschen",
    "Settings": "Einstellungen",
    "My Account": "Mein Konto",
    "Are you sure you want to delete the account?": "Möchten Sie das Konto wirklich löschen?",
    "Update": "Aktualisieren",
    "Old Password": "Altes Passwort",
    "Change Password": "Passwort ändern",
    "New Password": "Neues Passwort",
    "Commands": "Befehle",
    "Title": "Titel",
    "and more...": "und mehr...",
    "Delete": "Löschen",
    "Are you sure you want to delete this item?": "Sind Sie sicher, dass Sie diesen Artikel löschen möchten?",
    "Events": "Events",
    "Event": "Event",
    "Choose an event": "Wählen Sie ein Event",
    "Startup (System only)": "Startup (nur System)",
    "Open a serial port (System only)": "Eine serielle Schnittstelle öffnen (nur System)",
    "Close a serial port (System only)": "Eine serielle Schnittstelle schließen (nur System)",
    "G-code: Load": "G-Code: Laden",
    "G-code: Unload": "G-Code: Entladen",
    "G-code: Start": "G-Code: Start",
    "G-code: Stop": "G-Code: Stopp",
    "G-code: Pause": "G-Code: Pause",
    "G-code: Resume": "G-code: Fortsetzen",
    "Feed Hold": "Feed halten",
    "Cycle Start": "Zyklus starten",
    "Homing": "Homing",
    "Sleep": "Schlaf",
    "Trigger": "Auslöser",
    "Choose an trigger": "Wählen Sie einen Auslöser",
    "System": "System",
    "G-code": "G-Code",
    "Startup": "Starten",
    "Open a serial port": "Eine serielle Schnittstelle öffnen",
    "Close a serial port": "Eine serielle Schnittstelle schließen",
    "Automatically check for updates": "Automatisch nach Aktualisierungen suchen",
    "Language": "Sprache",
    "Save Changes": "Änderungen speichern",
    "General": "Allgemeines",
    "Workspace": "Arbeitsplatz",
    "About": "Über",
    "Restore Defaults": "Standardeinstellungen wiederherstellen",
    "Are you sure you want to restore the default settings?": "Möchten Sie die Standardeinstellungen wirklich wiederherstellen?",
    "The account name is already being used. Choose another name.": "Der Kontoname wird bereits verwendet. Wählen Sie einen anderen Namen.",
    "Passwords do not match.": "Passwörter stimmen nicht überein.",
    "3D Printing G-code Generator": "3D-Druck G-Code-Generator",
    "Laser G-code Generator": "Laser G-Code Generator",
    "CNC G-code Generator": "CNC G-Code Generator",
    "Fork Widget": "Fork-Widget",
    "Are you sure you want to fork this widget?": "Sind Sie sicher, dass Sie dieses Widget abzeigen wollen?",
    "Remove Widget": "Widget entfernen",
    "Are you sure you want to remove this widget?": "Möchten Sie dieses Widget wirklich entfernen?",
    "On": "Ein",
    "Off": "Aus",
    "Visualizer Widget": "Visualizer-Widget",
    "This widget visualizes a G-code file and simulates the tool path.": "Dieses Widget visualisiert eine G-Code-Datei und simuliert den Werkzeugweg.",
    "Connection Widget": "Verbindungs-Widget",
    "This widget lets you establish a connection to a serial port.": "Mit diesem Widget können Sie eine Verbindung zu einem seriellen Port herstellen.",
    "Console Widget": "Konsolen-Widget",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "Mit diesem Widget können Sie Daten an die CNC-Steuerung lesen und schreiben, die an eine serielle Schnittstelle angeschlossen ist.",
    "Grbl Widget": "Grbl-Widget",
    "This widget can view Grbl state and settings.": "Dieses Widget kann den Grbl-Status und die Einstellungen anzeigen.",
    "Marlin Widget": "Marlin-Widget",
    "This widget can view Marlin state and settings.": "Dieses Widget kann den Marlin-Status und die Einstellungen anzeigen.",
    "Smoothie Widget": "Smoothie-Widget",
    "This widget can view Smoothie state and settings.": "Dieses Widget kann den Smoothie-Status und die Einstellungen anzeigen.",
    "TinyG Widget": "TinyG-Widget",
    "This widget can view TinyG state and settings.": "Dieses Widget kann den Status und die Einstellungen von TinyG anzeigen.",
    "Axes Widget": "Achsen-Widget",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Dieses Widget zeigt die XYZ-Position an. Es beinhaltet Jog-Controls, Homing und Achsen-Nullstellung.",
    "G-code Widget": "G-Code-Widget",
    "This widget shows the current status of G-code commands.": "Dieses Widget zeigt den aktuellen Status von G-Code-Befehlen an.",
    "Laser Widget": "Laser-Widget",
    "This widget allows you control laser intensity and turn the laser on/off.": "Mit diesem Widget können Sie die Laserintensität steuern und den Laser ein- und ausschalten.",
    "Webcam Widget": "Webcam-Widget",
    "This widget lets you monitor a webcam.": "Mit diesem Widget können Sie eine Webcam überwachen.",
    "Widgets": "Widgets",
    "Server has stopped working": "Der Server funktioniert nicht mehr",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "Ein Problem hat dazu geführt, dass der Server nicht mehr ordnungsgemäß funktioniert. Überprüfen Sie den Serverstatus und versuchen Sie es erneut.",
    "Close": "Schließen",
    "This field is required.": "Dieses Feld wird benötigt.",
    "Passwords should be equal.": "Passwörter sollten gleich sein.",
    "mm": "mm",
    "in": "im",
    "Axis": "Achse",
    "Work Position": "Arbeitsposition",
    "Go To Work Zero On X Axis (G0 X0)": "Go To Work Zero auf X Achse (G0 X0)",
    "Zero Out Temporary X Axis (G92 X0)": "Zero-Out Temporäre X Achse (G92 X0)",
    "Go To Work Zero On Y Axis (G0 Y0)": "Go To Work Zero auf Y Achse (G0 Y0)",
    "Zero Out Temporary Y Axis (G92 Y0)": "Zero-Out Temporäre Y Achse (G92 Y0)",
    "Go To Work Zero On Z Axis (G0 Z0)": "Go To Work Zero auf  Z Achse (G0 Z0)",
    "Zero Out Temporary Z Axis (G92 Z0)": "Zero-Out Temporäre Z Achse (G92 Z0)",
    "Axes": "Achsen",
    "Keypad jogging": "Tastatur Joggen",
    "Expand": "Erweitern",
    "Collapse": "Zusammenklappen",
    "More": "Mehr",
    "Enter Full Screen": "Vollbildmodus aktivieren",
    "Exit Full Screen": "Vollbildmodus beenden",
    "User Defined": "Benutzerdefiniert",
    "Custom distance for every move operation": "Individueller Abstand für jede Bewegung",
    "Increase custom distance by one unit": "Erhöhen Sie den benutzerdefinierten Abstand um eine Einheit",
    "Decrease custom distance by one unit": "Verringern Sie den benutzerdefinierten Abstand um eine Einheit",
    "Move X- Y+": "X- Y+ verschieben",
    "Move Y+": "Y+ verschieben",
    "Move X+ Y+": "X+ Y+ verschieben",
    "Move Z+": "Z+ verschieben",
    "Move X-": "X- verschieben",
    "Move To XY Zero (G0 X0 Y0)": "Zu XY Null bewegen (G0 X0 Y0)",
    "Move X+": "X+ verschieben",
    "Move To Z Zero (G0 Z0)": "Gehe zu Z Null (G0 Z0)",
    "Move X- Y-": "X- Y- verschieben",
    "Move Y-": "Y- verschieben",
    "Move X+ Y-": "X+ Y- verschieben",
    "Move Z-": "Z- bewegen",
    "Right": "Rechts",
    "Left": "Links",
    "Up": "Hoch",
    "Down": "Runter",
    "Page Up": "Seite nach oben",
    "Page Down": "Seite nach unten",
    "0.1x Move": "0.1x Bewegen",
    "Alt": "Alt",
    "10x Move": "10x Bewegen",
    "⇧ Shift": "⇧ Verschieben",
    "Run Boundary": "Grenze ausführen",
    "Click to check the boundary of the image to be engraved.": "Klicken Sie, um die Grenze des zu gravierenden Bildes zu überprüfen.",
    "Go To Work Origin": "Zum Ursprung gehen",
    "Move the head to the last saved work origin.": "Kopf zum letzten gespeicherten Arbeitsursprung verschieben.",
    "Set Work Origin": "Arbeitsursprung festlegen",
    "Set the current position of the head as the work origin.": "Stellen Sie die aktuelle Position des Kopfes als Arbeitsursprung ein.",
    "Shuttle Settings": "Shuttle-Einstellungen",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "Vorschubbereich: {{min}} - {{max}} mm/min",
    "Repeat Rate: {{hertz}}Hz": "Wiederholungsrate: {{hertz}} Hz",
    "60 Times per Second": "60 Mal pro Sekunde",
    "45 Times per Second": "45 Mal pro Sekunde",
    "30 Times per Second": "30 Mal pro Sekunde",
    "15 Times per Second": "15 Mal pro Sekunde",
    "10 Times per Second": "10 Mal pro Sekunde",
    "5 Times per Second": "5 Mal pro Sekunde",
    "2 Times per Second": "2 Mal pro Sekunde",
    "Once Every Second": "Einmal jede Sekunde",
    "Distance Overshoot: {{overshoot}}x": "Distanzüberschreitung: {{overshoot}}x",
    "Determines how fast the tool moves when it’s not carving.": "Festlegen, wie schnell sich das Werkzeug bewegt, wenn nicht bearbeitet wird.",
    "Determines how fast the tool feeds into the material.": "Bestimmen, wie schnell das Werkzeug in das Material eindringt.",
    "Generate G-code": "G-Code generieren",
    "Output": "Ausgang",
    "Load G-code to Workspace": "G-Code in den Arbeitsbereich laden",
    "Export G-code to file": "G-Code in Datei exportieren",
    "Carving Path": "Schnitzender Pfad",
    "Carve Path": "Schnitzweg",
    "Select a carve path:": "Einen Schnitzpfad auswählen:",
    "Carve along the contour of the image.": "Schnitzen Sie entlang der Kontur des Bildes.",
    "Carve along the shape of the image.": "Schnitzpfad Sie entlang der Form des Bildes.",
    "Outline": "Aussenlinie",
    "On the Path": "auf dem Weg",
    "Choose carve path": "Wähle Schnitzweg",
    "Resolution": "Auflösung",
    "The detected resolution of the loaded image.": "Die erkannte Auflösung des geladenen Bildes.",
    "Size (mm)": "Grösse (mm)",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "Geben Sie die Größe des eingravierten Bildes ein. Die Größe kann nicht größer als 125 x 125 mm oder die Größe Ihres Materials sein.",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "Geben Sie die Tiefe des geschnitzten Bildes ein. Die Tiefe kann nicht tiefer als die Flötenlänge sein.",
    "Step Down": "Schritt nach unten",
    "Enter the depth of each carving step.": "Geben Sie die Tiefe für jeden Schnitzschritt ein.",
    "Jog Height": "Jog-Höhe",
    "The distance between the tool and the material when it’s not carving.": "Der Abstand zwischen dem Werkzeug und dem Material, wenn nicht bearbeitet wird.",
    "The distance between the tool and the material when the machine stops.": "Der Abstand zwischen Werkzeug und Material beim Anhalten der Maschine.",
    "Alignment": "Ausrichtung",
    "None": "Keine",
    "Tab Height": "Tabhöhe",
    "Enter the height of the tabs.": "Geben Sie die Höhe der Registerkarten ein.",
    "Tab Space": "Tabulatorraum",
    "Enter the space between any two tabs.": "Geben Sie den Abstand zwischen zwei beliebigen Tabs ein.",
    "Tab Width": "Tabulatorbreite",
    "Enter the width of the tabs.": "Geben Sie die Breite der Tabs ein.",
    "Preview": "Vorschau",
    "Carving Tool": "Schnitzwerkzeug",
    "Carving V-Bit": "Schnitz-V-Bit",
    "Flat End Mill": "Flache Schaftfräser",
    "Ball End Mill": "Kugelfräser",
    "Use Other Bit": "Anderes Werkzeug verwenden",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "Geben Sie den Durchmesser der breitesten Stelle der Klinge ein. Bitte beachten Sie, dass es sich nicht um den Schaftdurchmesser handelt.",
    "For the carving bits that we provide, please enter the following value:": "Für die von uns bereitgestellten Schnitz-Bits geben Sie bitte folgenden Wert ein:",
    "Point Angle": "Punktwinkel",
    "Enter the angle of the blade.": "Geben Sie den Winkel der Klinge ein.",
    "fullscreen": "Vollbild",
    "Manufacturer: {{manufacturer}}": "Hersteller: {{Hersteller}}",
    "Port": "Port",
    "No ports available": "Keine Ports verfügbar",
    "Choose a port": "Wählen Sie einen Port",
    "Refresh": "Aktualisierung",
    "Open": "Öffnen",
    "Error opening serial port '{{- port}}'": "Fehler beim Öffnen des seriellen Ports '{{- port}}'",
    "Connection": "Verbindung",
    "No serial connection": "Keine serielle Verbindung",
    "Connected to {{-port}}": "Verbunden mit {{-Port}}",
    "Console": "Konsole",
    "Clear all": "Alles löschen",
    "Min": "Min",
    "Max": "Max",
    "Dimension": "Abmessungen",
    "Sent": "Gesendet",
    "Received": "Empfangen",
    "Start Time": "Startzeit",
    "Elapsed Time": "Verstrichene Zeit",
    "Finish Time": "Endzeit",
    "Remaining Time": "Verbleibende Zeit",
    "Laser": "Laser",
    "Laser On": "Laser An",
    "Laser Off": "Laser aus",
    "Save (SD Card)": "Speichern (SD Karte)",
    "Hide": "Verbergen",
    "Show": "Anzeigen",
    "Laser Test": "Lasertest",
    "Power (%)": "Leistung (%)",
    "Test duration": "Testdauer",
    "ms": "ms",
    "Maximum value": "Maximalwert",
    "Determines how fast the machine moves when it’s not engraving.": "Legt fest, wie schnell sich die Maschine bewegt, wenn sie nicht graviert.",
    "Determines how fast the machine moves when it’s engraving.": "Legt fest, wie schnell sich die Maschine beim Gravieren bewegt.",
    "Dwell Time": "Verweilzeit",
    "Determines how long the laser keeps on when it’s engraving a dot.": "Bestimmt, wie lange der Laser beim Gravieren eines Punktes weiterläuft.",
    "B&W": "S&W",
    "Set the proportion of the black color based on the original color of the image.": "Stellen Sie den Anteil der schwarzen Farbe basierend auf der Originalfarbe des Bildes ein.",
    "Line Direction": "Zeilenrichtung",
    "Select the direction of the engraving path.": "Wählen Sie die Richtung des Gravurweges.",
    "Horizontal": "Horizontal",
    "Vertical": "Vertikal",
    "Diagonal": "Diagonal",
    "Diagonal2": "Diagonal2",
    "Choose an algorithm": "Wähle einen Algorithmus",
    "Density": "Dichte",
    "Contrast": "Kontrast",
    "The difference between the lightest color and the darkest color.": "Der Unterschied zwischen der hellsten und der dunkelsten Farbe.",
    "Brightness": "Helligkeit",
    "The engraved picture is brighter when this value is bigger.": "Das gravierte Bild ist heller, wenn dieser Wert größer ist.",
    "White Clip": "Weißer Clip",
    "Set the threshold to turn the color that is not pure white into pure white.": "Stellen Sie den Schwellenwert so ein, dass die Farbe, die nicht rein weiß ist, in reines Weiß umgewandelt wird.",
    "Algorithm": "Algorithmus",
    "Choose an algorithm for image processing.": "Wählen Sie einen Algorithmus für die Bildverarbeitung.",
    "Preview Settings": "Vorschau Einstellungen",
    "(default image)": "(Standardbild)",
    "Parse Image Error": "Analyse- Bild Fehler",
    "Failed to parse image file {{}}": "Bilddatei konnte nicht analysiert werden {{{}}}",
    "GREYSCALE": "GRAUSKALA",
    "VECTOR": "ÜBERTRÄGER",
    "TEXT": "Text",
    "Source Type": "Quellenart",
    "Raster": "Raster",
    "SVG": "SVG",
    "Upload Image": "Bild hochladen",
    "Middle": "Mitte",
    "Center": "Zentrum/Mitte",
    "Bottom Left": "Unten Links",
    "Bottom Middle": "Unten Mitte",
    "Bottom Right": "Unten Rechts",
    "Top Left": "Oben Links",
    "Top Middle": "Oben Mitte",
    "Top Right": "Oben Rechts",
    "Text": "Text",
    "Font": "Schrift",
    "Choose font": "Wähle Schrift",
    "Enter the font size in pt (points).": "Geben Sie die Schriftgröße in pt (Punkte) ein.",
    "Line Height": "Linienhöhe",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "Stellen Sie den Abstand zwischen den einzelnen Zeilen im Text ein. Der eingegebene Wert ist das Vielfache der Schriftgröße.",
    "Align the text in different lines to either the left or right or in the center horizontally.": "Richten Sie den Text in verschiedenen Zeilen entweder nach links oder rechts oder in der Mitte horizontal aus.",
    "Anchor": "Anker",
    "Find the anchor of the text to correspond to the (0, 0) coordinate.": "Suchen Sie den Anker des Textes, der der (0, 0) Koordinate entspricht.",
    "Impurity Size": "Verunreinigungsgröße",
    "Determines the minimum size of impurity which allows to be showed.": "Bestimmt die minimale Größe der Verunreinigung, die gezeigt werden kann.",
    "Invert": "Umkehren",
    "Inverts black to white and vise versa.": "Invertiert Schwarz nach Weiß und umgekehrt.",
    "Optimize Path": "Pfad optimieren",
    "Optimizes the path based on the proximity of the lines in the image.": "Optimiert den Pfad basierend auf der Nähe der Linien im Bild.",
    "Fine Tune Work Origin": "Feinabstimmung Arbeit Ursprung",
    "How Fine Tune Work Origin Works": "Wie Feinabstimmung Arbeit Ursprung funktioniert",
    "Click": "klicken",
    "Focus": "Fokus",
    "and use": "und benutze",
    "Jog Pad": "Jog-Pad",
    "Generate and Load G-code": "G-Code generieren und laden",
    "and the G-code is automatically generated and loaded.": "und der G-Code wird automatisch generiert und geladen.",
    "to start laser cutting.": "beginnen sie das Laserschneiden.",
    "Determines how fast the machine moves when it’s working.": "Legt fest, wie schnell sich die Maschine bewegt, wenn sie arbeitet.",
    "Power": "Leistung",
    "Power to use when laser is working.": "Leistung, die verwendet werden kann, wenn der Laser arbeitet.",
    "Enable 3D View": "3D-Ansicht aktivieren",
    "Disable 3D View": "3D-Ansicht deaktivieren",
    "Hide Coordinate System": "Koordinatensystem ausblenden",
    "Show Coordinate System": "Koordinatensystem anzeigen",
    "File folder": "Dateiordner",
    "{{extname}} File": "{{extname}} Datei",
    "File": "Datei",
    "Reset Position": "Position zurücksetzen",
    "Zoom In": "Hineinzoomen",
    "Zoom Out": "Rauszoomen",
    "Controller State": "Steuerungszustand",
    "Controller Settings": "Steuerungseinstellungen",
    "3D Printer": "3D Drucker",
    "CNC": "CNC",
    "Set": "Einstellen",
    "Save": "Speichern",
    "F": "F",
    "Adjust feedrate percentage, which applies to moves along all axis.": "Vorschubprozentsatz einstellen, der für alle Achsen gilt.",
    "Nozzle Temperature": "Düse Temperatur",
    "Bed Temperature": "Bett Temperatur",
    "Tool Head Power": "Leistung des Werkzeugkopfes",
    "ON": "AN",
    "OFF": "Aus",
    "Quality": "Qualität",
    "Shell": "Gehäuse",
    "Infill": "Füllung",
    "Speed": "Geschwindigkeit",
    "Retract & Z Hop": "Rückzug & Z Hopfen",
    "Surface": "Oberfläche",
    "Recommended": "Empfohlen",
    "Customize": "Anpassen",
    "Fast Print": "Schnelldruck",
    "Normal Quality": "Normale Qualität",
    "High Quality": "Hohe Qualität",
    "Show Details": "Details anzeigen",
    "Profile": "Profil",
    "Printing Settings": "Druck Einstellungen",
    "Material & Support": "Material & Unterstützung",
    "Custom Material": "Kundenspezifisches Material",
    "Adhesion": "Adhäsion",
    "Support": "Unterstützung",
    "Touch Building Plate": "Berühren Sie die Bauplatte",
    "Everywhere": "Überall",
    "Slicing {{progress}}%": "Schneiden {{Fortschritt}}%",
    "Slice error: ": "",
    "Parsing G-code...": "Analysiere G-Code…",
    "Loading model...": "Modell lädt...",
    "Pre-processing model...": "Vorverarbeitungsmodell....",
    "Preparing for slicing...": "Vorbereitung zum Schneiden....",
    "Upload File": "Datei hochladen",
    "G-code not loaded": "G-Code nicht geladen",
    "Projection": "Projektion",
    "Perspective Projection": "Perspektive Projektion",
    "Orthographic Projection": "Orthographische Projektion",
    "Scene Objects": "Szenenobjekte",
    "Display G-code Filename": "G-Code-Dateinamen anzeigen",
    "Hide Toolhead": "Werkzeugkopf ausblenden",
    "Show Toolhead": "Werkzeugkopf anzeigen",
    "3D rendering...": "3D Wiedergabe….",
    "Move the camera": "Kamera bewegen",
    "Rotate the camera": "Kamera rotieren",
    "Watch Directory": "Uhr-Verzeichnis",
    "Name": "Name",
    "Type": "Art",
    "Load G-code": "G-Code laden",
    "Upload G-code": "G-Code hochladen",
    "Run": "Durchführen",
    "Pause": "Pause",
    "Stop": "STOPP",
    "Webcam": "Webcam",
    "Edit": "Bearbeiten",
    "Enable": "Aktivieren",
    "Disable": "Deaktivieren",
    "Webcam Settings": "Webcam-Einstellungen",
    "Media Source": "Medienquelle",
    "Use a built-in camera or a connected webcam": "Verwenden Sie eine integrierte Kamera oder eine angeschlossene Webcam",
    "Use a M-JPEG stream over HTTP": "Verwenden Sie einen M-JPEG-Stream über HTTP",
    "Webcam is off": "Die Webcam ist ausgeschaltet",
    "Rotate Left": "Nach links drehen",
    "Rotate Right": "Nach rechts drehen",
    "Flip Horizontally": "Horizontal spiegeln",
    "Flip Vertically": "Vertikal spiegeln",
    "Crosshair": "Fadenkreuz",
    "Note: If you are using the CNC Carving Module, make sure the carving bit will not run into the fixtures before you use this feature.": "Hinweis: Wenn Sie das CNC-Schnitzmodul verwenden, stellen Sie sicher, dass der Fräser nicht in die Vorrichtungen läuft, bevor Sie diese Funktion verwenden.",
    "Enter the text you want to engrave. The maximum length of the text is 125 mm. When the text is too long, it will be shrunk automatically. Start a new line manually according to your needs.": "Geben Sie den zu gravierenden Text ein. Die maximale Länge des Textes beträgt 125 mm. Wenn der Text zu lang ist, wird er automatisch verkleinert. Starten Sie eine neue Zeile manuell nach Ihren Bedürfnissen.",
    "Setting work origin is essentially finding the best place for the engraved image in the X and Y directions and determining the distance (Z Offset) between the Engraving & Carving Platform and the Laser Module to acquire the smallest laser dot on the material for the most efficient use of the laser power and the best result. For the 200mW Laser Engraving Module, the Z Offset can be set by judging the size of the laser dot by eyes with low power. However, for the 1600mW Laser Cutting Module, this method is less accurate as the laser dot is too strong and less interpretable. To set the Z Offset more accurately, we can move the module to the position that is close to the optimal Z Offset (Offset A). The software will test the results from a few positions next to Offset A on the same material. The best result determines the best Z Offset.": "Die Einstellung des Arbeitsursprungs besteht im Wesentlichen darin, den besten Platz für das gravierte Bild in X- und Y-Richtung zu finden und den Abstand (Z-Versatz) zwischen der Gravur- und Schneide-Plattform und dem Lasermodul zu bestimmen, um den kleinsten Laserpunkt auf dem Material für die effizienteste Nutzung der Laserleistung und das beste Ergebnis zu erhalten. Für das 200mW Lasergravurmodul kann der Z-Offset eingestellt werden, indem die Größe des Laserpunktes durch Augen mit geringer Leistung beurteilt wird. Für das 1600mW Laserschneidmodul ist diese Methode jedoch weniger genau, da der Laserpunkt zu stark und weniger interpretierbar ist. Um den Z-offset genauer einzustellen, können wir das Modul in die Nähe des optimalen Z-Versatzes (offset A) bringen. Die Software testet die Ergebnisse an einigen Stellen neben dem offset A auf dem gleichen Material. Das beste Ergebnis bestimmt den besten Z-offset.",
    "in the Axes section to move the Laser Cutting Module to the position that is close to the optimal Z Offset (just like how you do with the 200mW Laser Engraving Module).": "im Bereich Achsen, um das Laserschneidmodul in die Nähe des optimalen Z-Versatzes zu bewegen (wie beim 200mW Lasergravurmodul).",
    "Set Work Speed and Power based on the material you are using. If you are using a piece of 1.5 mm wood sheet, it’s recommended to set the Work Speed to a value between 80 mm/s and 120 mm/s and set the Power to 100%.": "Stellen Sie die Arbeitsgeschwindigkeit und Leistung je nach verwendetem Material ein. Wenn Sie ein Stück 1,5 mm Holzplatte verwenden, wird empfohlen, die Arbeitsgeschwindigkeit auf einen Wert zwischen 80 mm/s und 120 mm/s einzustellen und die Leistung auf 100% einzustellen.",
    "Choose the position that can cut the material the most smoothly or engrave the thinnest line and the software will set it as Z Offset. In this example, -2.0 should be the Z Offset.": "Wählen Sie die Position, an der das Material am glattesten geschnitten werden kann, oder gravieren Sie die dünnste Linie und die Software stellt sie als Z-Offset ein. In diesem Beispiel sollte -2.0 der Z-Offset sein.",
    "Parse File Error": "Analyse-Datei Fehler",
    "Failed to parse image file {{filename}}": "Bilddatei konnte nicht analysiert werden {{Dateiname}}}.",
    "Tool Head Status (M3)": "Werkzeugkopfstatus (M3)",
    "Skirt": "Unterteil",
    "Brim": "Rand",
    "Raft": "Floß",
    "Normal": "Normal",
    "Both": "Beide",
    "Warning": "Warnhinweis",
    "Slicing completed.": "Schneiden abgeschlossen.",
    "Parsed G-code successfully.": "Analysierter G-Code erfolgreich.",
    "Failed to parse G-code: ": "",
    "Loaded model successfully.": "Modell erfolgreich geladen.",
    "Failed to load model.": "Modell konnte nicht geladen werden.",
    "Rendered G-code successfully.": "G-Code erfolgreich übertragen.",
    "Tabs": "Register",
    "Upload": "",
    "Find the anchor of the image to correspond to the (0, 0) coordinate.": "",
    "Choose algorithms": "",
    "A web-based interface for Snapmaker which is able to do 3D Printing, laser engraving and CNC carving.": "",
    "Determines how fast the tool moves on the material.": "Bestimmen, wie schnell sich das Werkzeug auf dem Material bewegt.",
    "Select the type of the image you want to upload. Raster supports PNG and JPEG images, while SVG only supports SVG images. The Raster images will be transferred into SVG automatically.": "Wählen Sie den Typ des Bildes, das Sie hochladen möchten. Raster unterstützt PNG- und JPEG-Bilder, während SVG nur SVG-Bilder unterstützt. Die Rasterbilder werden automatisch in SVG übertragen.",
    "Select a word font or upload a font from your computer. WOFF, TTF, OTF fonts are supported.": "",
    "Fill Density": "",
    "Determines how fine and smooth the engraved picture will be. The bigger this value is, the better quality you will get. The range is 1-10 dot/mm and 10 is recommended.": "",
    "Center Left": "",
    "Center Right": "",
    "Center Selected Model": "",
    "Delete Selected Model": "",
    "Duplicate Selected Model": "",
    "Reset Selected Model Transformation": "",
    "Clear Build Plate": "",
    "Arrange All Models": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the text will be engraved without fill.": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the SVG image will be engraved without fill.": "",
    "Next": "",
    "Clip": "",
    "Passes": "",
    "Pass Depth": "",
    "STL File (Binary) (*.stl)": "",
    "STL File (ASCII) (*.stl)": "",
    "OBJ File (*.obj)": "",
    "Export Models": "",
    "Only SVG files are supported.": "",
    "Drop an SVG file here.": "",
    "Only STL/OBJ files are supported.": "",
    "Drop an STL/OBJ file here.": "",
    "Only G-code files are supported": "",
    "Drop a G-code file here.": "",
    "When enabled, the printer will run the G-code multiple times automatically according to the below settings. This feature helps you cut materials that can't be cut with only one pass.": "",
    "Determines how many times the printer will run the G-code automatically.": "",
    "Determines how much the laser module will be lowered after each pass.": "",
    "Fixed Power": "",
    "Multi-pass": "",
    "When enabled, the power used to engrave this image will be set in the G-code, so it is not affected by the power you set in Workspace.": "",
    "Fill": "",
    "Only {{accept}} files are supported.": "",
    "Drop an image file here.": "",
    "Lay Flat Selected Model": ""
}
