{
    "Records: {{from}} - {{to}} / {{total}}": "",
    "Records: {{total}}": "",
    "{{pageLength}} per page": "",
    "Upload SVG File": "",
    "Notice: You are printing! Pause the print if you want to preview again.": "",
    "Please upload image!": "",
    "Adjust parameter then preview!": "",
    "Now you can:": "",
    "New update available": "",
    "Command succeeded": "",
    "Command failed ({{err}})": "",
    "Options": "",
    "Command": "",
    "Show notifications": "",
    "Server has halted intentionally by you": "",
    "Emergency stop triggered, Please restart the Snapmaker then reconnect.": "",
    "Reload": "",
    "Reset": "",
    "STOP": "",
    "New Update Available!": "",
    "User Manual & FAQ": "",
    "Forum": "",
    "Authentication failed.": "",
    "Sign in to {{name}}": "",
    "Username": "",
    "Password": "",
    "Sign In": "",
    "Forgot your password?": "",
    "Learn more": "",
    "Downloads": "",
    "Report an issue": "",
    "Checking for updates...": "",
    "A new version of {{name}} is available": "",
    "Version {{version}}": "",
    "Latest version": "",
    "You already have the newest version of {{name}}": "",
    "Account": "",
    "New": "",
    "Account status": "",
    "Confirm Password": "",
    "Cancel": "",
    "OK": "",
    "An unexpected error has occurred.": "",
    "Loading...": "",
    "No data to display": "",
    "Enabled": "",
    "Disabled": "",
    "Date Modified": "",
    "Action": "",
    "Edit Account": "",
    "Delete Account": "",
    "Settings": "",
    "My Account": "",
    "Are you sure you want to delete the account?": "",
    "Update": "",
    "Old Password": "",
    "Change Password": "",
    "New Password": "",
    "Commands": "",
    "Title": "",
    "and more...": "",
    "Delete": "",
    "Are you sure you want to delete this item?": "",
    "Events": "",
    "Event": "",
    "Choose an event": "",
    "Startup (System only)": "",
    "Open a serial port (System only)": "",
    "Close a serial port (System only)": "",
    "G-code: Load": "",
    "G-code: Unload": "",
    "G-code: Start": "",
    "G-code: Stop": "",
    "G-code: Pause": "",
    "G-code: Resume": "",
    "Feed Hold": "",
    "Cycle Start": "",
    "Homing": "",
    "Sleep": "",
    "Trigger": "",
    "Choose an trigger": "",
    "System": "",
    "G-code": "",
    "Startup": "",
    "Open a serial port": "",
    "Close a serial port": "",
    "Automatically check for updates": "",
    "Language": "",
    "Save Changes": "",
    "General": "",
    "Workspace": "",
    "About": "",
    "Restore Defaults": "",
    "Are you sure you want to restore the default settings?": "",
    "The account name is already being used. Choose another name.": "",
    "Passwords do not match.": "",
    "3D Printing G-code Generator": "",
    "Laser G-code Generator": "",
    "CNC G-code Generator": "",
    "Fork Widget": "",
    "Are you sure you want to fork this widget?": "",
    "Remove Widget": "",
    "Are you sure you want to remove this widget?": "",
    "On": "",
    "Off": "끔",
    "Visualizer Widget": "",
    "This widget visualizes a G-code file and simulates the tool path.": "",
    "Connection Widget": "",
    "This widget lets you establish a connection to a serial port.": "",
    "Console Widget": "",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "",
    "Grbl Widget": "",
    "This widget can view Grbl state and settings.": "",
    "Marlin Widget": "",
    "This widget can view Marlin state and settings.": "",
    "Smoothie Widget": "",
    "This widget can view Smoothie state and settings.": "",
    "TinyG Widget": "",
    "This widget can view TinyG state and settings.": "",
    "Axes Widget": "",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "",
    "G-code Widget": "",
    "This widget shows the current status of G-code commands.": "",
    "Laser Widget": "",
    "This widget allows you control laser intensity and turn the laser on/off.": "",
    "Webcam Widget": "",
    "This widget lets you monitor a webcam.": "",
    "Widgets": "",
    "Server has stopped working": "",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "",
    "Drop G-code file here": "",
    "Close": "",
    "This field is required.": "",
    "Passwords should be equal.": "",
    "mm": "",
    "in": "",
    "Axis": "",
    "Work Position": "",
    "Go To Work Zero On X Axis (G0 X0)": "",
    "Zero Out Temporary X Axis (G92 X0)": "",
    "Go To Work Zero On Y Axis (G0 Y0)": "",
    "Zero Out Temporary Y Axis (G92 Y0)": "",
    "Go To Work Zero On Z Axis (G0 Z0)": "",
    "Zero Out Temporary Z Axis (G92 Z0)": "",
    "Axes": "",
    "Keypad jogging": "",
    "Expand": "",
    "Collapse": "",
    "More": "",
    "Enter Full Screen": "",
    "Exit Full Screen": "",
    "User Defined": "",
    "Custom distance for every move operation": "",
    "Increase custom distance by one unit": "",
    "Decrease custom distance by one unit": "",
    "Move X- Y+": "",
    "Move Y+": "",
    "Move X+ Y+": "",
    "Move Z+": "",
    "Move X-": "",
    "Move To XY Zero (G0 X0 Y0)": "",
    "Move X+": "",
    "Move To Z Zero (G0 Z0)": "",
    "Move X- Y-": "",
    "Move Y-": "",
    "Move X+ Y-": "",
    "Move Z-": "",
    "Right": "",
    "Left": "",
    "Up": "",
    "Down": "",
    "Page Up": "",
    "Page Down": "",
    "0.1x Move": "",
    "Alt": "",
    "10x Move": "",
    "⇧ Shift": "",
    "Run Boundary": "",
    "Click to check the boundary of the image to be engraved.": "",
    "Go To Work Origin": "",
    "Move the head to the last saved work origin.": "",
    "Set Work Origin": "",
    "Set the current position of the head as the work origin.": "",
    "Shuttle Settings": "",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "",
    "Repeat Rate: {{hertz}}Hz": "",
    "60 Times per Second": "",
    "45 Times per Second": "",
    "30 Times per Second": "",
    "15 Times per Second": "",
    "10 Times per Second": "",
    "5 Times per Second": "",
    "2 Times per Second": "",
    "Once Every Second": "",
    "Distance Overshoot: {{overshoot}}x": "",
    "Jog Speed": "",
    "Determines how fast the tool moves when it’s not carving.": "",
    "Work Speed": "",
    "Determines how fast the tool moves on the meterial.": "",
    "Plunge Speed": "",
    "Determines how fast the tool feeds into the material.": "",
    "Carve Path": "",
    "Select a carve path:": "",
    "Carve along the contour of the image.": "",
    "Carve along the shape of the image.": "",
    "Resolution": "",
    "The detected resolution of the loaded image.": "",
    "Size": "",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "",
    "Target Depth": "",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "",
    "Step Down": "",
    "Enter the depth of each carving step.": "",
    "Jog Height": "",
    "The distance between the tool and the material when it’s not carving.": "",
    "Stop Height": "",
    "The distance between the tool and the material when the machine stops.": "",
    "Alignment": "",
    "Alignment of generated G-code.": "",
    "Tab Height": "",
    "Enter the height of the tabs.": "",
    "Tab Space": "",
    "Enter the space between any two tabs.": "",
    "Tab Width": "",
    "Enter the width of the tabs.": "",
    "Cutting Diameter": "",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "",
    "For the carving bits that we provide, please enter the following value:": "",
    "Carving V-Bit": "",
    "Ball End Mill": "",
    "Flat End Mill": "",
    "Point Angle": "",
    "Enter the angle of the blade.": "",
    "fullscreen": "",
    "Manufacturer: {{manufacturer}}": "",
    "Port": "",
    "No ports available": "",
    "Choose a port": "",
    "Refresh": "",
    "Open": "",
    "Error opening serial port '{{- port}}'": "",
    "Connection": "",
    "No serial connection": "",
    "Connected to {{-port}}": "",
    "Console": "",
    "Clear all": "",
    "Min": "",
    "Max": "",
    "Dimension": "",
    "Sent": "",
    "Received": "",
    "Start Time": "",
    "Elapsed Time": "",
    "Finish Time": "",
    "Remaining Time": "",
    "Laser": "",
    "Laser Off": "",
    "Hide": "",
    "Show": "",
    "Laser Test": "",
    "Power (%)": "",
    "Test duration": "",
    "ms": "",
    "Maximum value": "",
    "Determines how fast the machine moves when it’s not engraving.": "",
    "Determines how fast the machine moves when it’s engraving.": "",
    "Dwell Time": "",
    "Determines how long the laser keeps on when it’s engraving a dot.": "",
    "B&W": "",
    "Set the proportion of the black color based on the original color of the image.": "",
    "Line Direction": "",
    "Select the direction of the engraving path.": "",
    "Density": "",
    "Contrast": "",
    "The difference between the lightest color and the darkest color.": "",
    "Brightness": "",
    "The engraved picture is brighter when this value is bigger.": "",
    "White Clip": "",
    "Set the threshold to turn the color that is not pure white into pure white.": "",
    "Algorithm": "",
    "Choose an algorithm for image processing.": "",
    "Source Type": "",
    "Text": "",
    "Font": "",
    "Select a word font.": "",
    "Enter the font size in pt (points).": "",
    "Line Height": "",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "",
    "Align the text in different lines to either the left or right or in the center horizontally.": "",
    "Anchor": "",
    "Find the anchor of the text to correspond to the (0, 0) coordinate.": "",
    "Impurity Size": "",
    "Determines the minimum size of impurity which allows to be showed.": "",
    "Invert": "",
    "Inverts black to white and vise versa.": "",
    "Optimize Path": "",
    "Optimizes the path based on the proximity of the lines in the image.": "",
    "How Fine Tune Work Origin Works": "",
    "Click": "",
    "and use": "",
    "and the G-code is automatically generated and loaded.": "",
    "to start laser cutting.": "",
    "Determines how fast the machine moves when it’s working.": "",
    "Power": "",
    "Power to use when laser is working.": "",
    "Generate and Load G-code": "",
    "Enable 3D View": "",
    "Disable 3D View": "",
    "Hide Coordinate System": "",
    "Show Coordinate System": "",
    "File folder": "",
    "{{extname}} File": "",
    "File": "",
    "3D rendering": "",
    "Reset Position": "",
    "Zoom In": "",
    "Zoom Out": "",
    "Controller State": "",
    "Controller Settings": "",
    "F": "",
    "Adjust feedrate percentage, which applies to moves along all axis.": "",
    "Adhesion": "부착",
    "Support": "서포트",
    "Upload File": "",
    "G-code not loaded": "",
    "Projection": "",
    "Perspective Projection": "",
    "Orthographic Projection": "",
    "Scene Objects": "",
    "Display G-code Filename": "",
    "Hide Toolhead": "",
    "Show Toolhead": "",
    "3D rendering...": "",
    "Move the camera": "",
    "Rotate the camera": "",
    "Watch Directory": "",
    "Name": "",
    "Date modified": "",
    "Type": "",
    "Load G-code": "",
    "Upload G-code": "",
    "Run": "",
    "Pause": "",
    "Stop": "",
    "Webcam": "",
    "Edit": "",
    "Enable": "",
    "Disable": "",
    "Webcam Settings": "",
    "Media Source": "",
    "Use a built-in camera or a connected webcam": "",
    "Use a M-JPEG stream over HTTP": "",
    "Webcam is off": "",
    "Rotate Left": "",
    "Rotate Right": "",
    "Flip Horizontally": "",
    "Flip Vertically": "",
    "Crosshair": "",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "오버행이 있는 모델 부분을 서포트하는 구조를 생성합니다. 이러한 구조가 없으면 이런 부분이 프린팅 중에 붕괴됩니다.",
    "Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "빌드 플레이트에 대한 접착력을 향상시키는 데 도움이되는 다양한 옵션. 브림은 뒤틀림을 방지하기 위해 모델 바닥 주위에 단층 평면 영역을 추가합니다. 래프트는 모델 아래에 지붕이있는 두꺼운 격자를 추가합니다. 스커트는 모델 주변에 프린팅 된 선이지만 모델에는 연결되어 있지 않습니다.",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "첫 번째 레이어의 라인 폭 승수입니다. 이것을 늘리면 베드 접착력을 향상시킬 수 있습니다.",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "바깥 쪽 브림의 Z 이동을 부드럽게합니다. 이렇게 하면 출력물 전체에 걸쳐 꾸준히 Z가 증가합니다. 이 기능은 솔리드 모델을 단단한 바닥이있는 단일 벽으로 프린팅합니다. 이 기능은 각 레이어에 단일 부품 만 포함되어 있을 때만 활성화 해야 합니다.",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "모델을 표면만, 볼륨 또는 느슨한 표면이있는 볼륨으로 취급합니다. 일반 프린팅 모드는 볼륨만 프린팅합니다. \"표면\"은 아무런 내부채움없이 상단 / 하단 스킨없이 메쉬 표면을 추적하는 단일 벽을 프린팅합니다. \"둘 다\"는 정상 및 나머지 폴리곤과 같은 닫힌 볼륨을 서피스로 프린팅합니다.",
    "The speed at which travel moves are made.": "움직일때의 이동 속도.",
    "The speed at which top/bottom layers are printed.": "위쪽/아래쪽 레이어가 프린팅되는 속도입니다.",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "모든 내부 벽이 프린팅되는 속도입니다. 내벽을 외벽보다 빠르게 프린팅하면 프린팅 시간이 단축됩니다. 외벽 속도와 충전 속도 사이에서 이것을 설정하는 것이 효과적입니다.",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "가장 바깥 쪽 벽이 프린팅되는 속도입니다. 외벽을 더 낮은 속도로 프린팅하면 최종 스킨 품질이 향상됩니다. 그러나 내벽 속도와 외벽 속도 사이에 큰 차이가있을 경우 부정적인 방식으로 품질에 영향을 미칩니다.",
    "The speed at which infill is printed.": "내부채움이 프린팅되는 속도.",
    "The speed at which printing happens.": "프린팅 속도.",
    "The speed at which the filament is retracted and primed during a retraction move.": "리트렉션 속도입니다.",
    "The length of material retracted during a retraction move.": "리트렉션 이동 중에 수축 된 재료의 길이입니다.",
    "Retract the filament when the nozzle is moving to the next layer.": "노즐이 다음 층으로 이동할 때 필라멘트를 리트렉션 시킵니다.",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "노즐이 프린팅되지 않은 영역 위로 움직일 때 필라멘트를 리트렉션합니다. ",
    "Adjusts the density of infill of the print.": "출력물의 내부채움을 조절합니다.",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "출력물의 아래쪽 레이어의 두께. 이 값을 레이어 높이로 나눈 값은 맨 아래 레이어의 수 입니다.",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "출력물의 상단 레이어의 두께. 이 값을 레이어 높이로 나눈 값이 최상위 레이어 수 입니다.",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "가로 방향의 벽 두께입니다. 이 값을 벽 선 너비로 나눈 값은 벽의 수 입니다.",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.": "첫번째 레이어의 높이 (mm)입니다. 첫번째 레이어를 두껍게하면 빌드 플레이트에 쉽게 부착됩니다.",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "각 층의 높이 (mm)입니다. 값이 클수록 해상도가 낮고 프린팅 속도가 빨라지며, 값이 작을수록 해상도가 높고 프린팅 속도가 느려집니다.",
    "The height difference when performing a Z Hop.": "Z 홉을 수행 할 때의 높이 차이.",
    "Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.": "리트렉션이 일어날 때마다 빌드 플레이트가 낮아져 노즐과 출력물 사이에 여유 공간이 생깁니다. 이동 중에 노즐이 출력물에 부딪치지 않도록 합니다.",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "이동 속도는 초기 레이어에서 이동합니다. 이전에 프린팅 된 부품을 빌드 플레이트에서 떨어지는 것을 방지하려면 더 낮은 값을 권합니다. 이 설정의 값은 이동 속도와 프린팅 속도 사이의 비율로부터 자동으로 계산 될 수 있습니다.",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.": "초기 레이어의 프린팅 속도입니다. 빌드 플레이트에 대한 접착력을 향상 시키려면 낮은 값을 권합니다.",
    "Generate Support": "서포트 생성",
    "Build Plate Adhesion Type": "빌드 플레이트 고정 유형",
    "Initial Layer Line Width": "초기 레이어 라인 폭",
    "Spiralize Outer Contour": "외부 윤곽선을 나선형으로 만듦",
    "Surface Mode": "표면 모드",
    "Travel Speed": "이동 속도",
    "Top/Bottom Speed": "상단/하단 속도",
    "Inner Wall Speed": "내벽 속도",
    "Outer Wall Speed": "외벽 속도",
    "Infill Speed": "내부채움 속도",
    "Print Speed": "프린팅 속도",
    "Retraction Speed": "리트렉션 속도",
    "Retraction Distance": "리트렉션 거리",
    "Retract at Layer Change": "레이어 변경시 리트렉션",
    "Enable Retraction": "리트렉션 활성화",
    "Infill Density": "내부채움 밀도",
    "Bottom Thickness": "바닥 두께",
    "Top Thickness": "상단 두께",
    "Wall Thickness": "벽 두께",
    "Initial Layer Height": "첫번째 레이어 높이",
    "Layer Height": "층 높이",
    "Z Hop Height": "Z 홉 높이",
    "Z Hop When Retracted": "리트렉션했을 때의 Z Hop",
    "Initial Layer Travel Speed": "초기 레이어 이동 속도",
    "Initial Layer Print Speed": "초기 레이어 프린팅 속도",
    "Has Heated Build Plate": "히팅 빌드 플레이트가 있음",
    "Whether the machine has a heated build plate present.": "기기에 히팅 빌드 플레이트가 있는지 여부.",
    "Printing Temperature": "프린팅 온도",
    "The temperature used for printing.": "프린팅에 사용되는 온도.",
    "Printing Temperature Initial Layer": "첫번째 레이어의 프린팅 온도",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "첫 번째 레이어에 프린팅에 사용되는 온도입니다. 초기 레이어의 특수 처리를 사용하지 않으려면 0으로 설정합니다.",
    "Final Printing Temperature": "최종 프린팅 온도",
    "The temperature to which to already start cooling down just before the end of printing.": "프린팅 종료 직전에 냉각이 시작될 온도입니다.",
    "Build Plate Temperature": "빌드 플레이트 온도",
    "The temperature used for the heated build plate. If this is 0, the bed will not heat up for this print.": "가열 된 빌드 플레이트에 사용되는 온도. 이 값이 0이면이 출력물에 베드가 가열되지 않습니다.",
    "Build Plate Temperature Initial Layer": "초기 레이어의 빌드 플레이트 온도",
    "The temperature used for the heated build plate at the first layer.": "첫 번째 레이어에서 가열 된 빌드 플레이트에 사용되는 온도.",
    "Diameter": "직경",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "사용 된 필라멘트의 직경을 조정합니다. 이 값을 사용될 필라멘트의 직경과 일치시킵니다.",
    "Flow": "공급량",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "압출량 보상: 압출 된 재료의 양에 이 값을 곱합니다.",
    "Recommended": "",
    "Customize": "",
    "Fast Print": "",
    "Normal Quality": "",
    "High Quality": "",
    "Adjust parameter then generate G-code!": "",
    "1. Click \"Load\" to load generated G-code and then you are ready for printing. Or": "",
    "2. Click \"Export\" to export generated G-code file for later printing.": "",
    "Show Details": "",
    "Printing Settings": "",
    "Material & Support": "",
    "Custom Material": "",
    "Output": "",
    "Quality": "품질",
    "Profile": "",
    "Shell": "외곽",
    "Infill": "내부채움",
    "Speed": "속도",
    "Retract & Z Hop": "",
    "Surface": "표면",
    "Generate G-code": "",
    "Load G-code to Workspace": "",
    "Export G-code to file": "",
    "Store": "",
    "Upload Image": "",
    "Size (mm)": "",
    "Horizontal": "",
    "Vertical": "",
    "Diagonal": "",
    "Diagonal2": "",
    "Choose an algorithm": "",
    "None": "",
    "Clip to axes": "",
    "Align center to origin": "",
    "GREYSCALE": "",
    "VECTOR": "",
    "TEXT": "",
    "(default image)": "",
    "Preview": ""
}
