{
    "Generate Support": "Generar soporte",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "Generar estructuras para soportar piezas del modelo que tengan voladizos. Sin estas estructuras, estas piezas se romperían durante la impresión.",
    "Build Plate Adhesion Type": "Tipo adherencia de la placa de impresión",
    "Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "Opciones diferentes que ayudan a mejorar tanto la extrusión como la adherencia a la placa de impresión. El borde agrega una zona plana de una sola capa alrededor de la base del modelo para impedir que se deforme. La balsa agrega una rejilla gruesa con un techo por debajo del modelo. La falda es una línea impresa alrededor del modelo, pero que no está conectada al modelo.",
    "Initial Layer Line Width": "Ancho de línea de la capa inicial",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "Multiplicador del ancho de la línea de la primera capa. Si esta se aumenta, se puede mejorar la adherencia a la plataforma.",
    "Spiralize Outer Contour": "Espiralizar el contorno exterior",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "La opción de espiralizar suaviza el movimiento en Z del borde exterior. Esto creará un incremento en Z constante durante toda la impresión. Esta función convierte un modelo sólido en una impresión de una sola pared con una parte inferior sólida. Esta función solo se debería habilitar cuando cada capa contenga una única pieza.",
    "Surface Mode": "Modo de superficie",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "Tratar el modelo como una superficie solo, un volumen o volúmenes con superficies sueltas. El modo de impresión normal solo imprime volúmenes cerrados. «Superficie» imprime una sola pared trazando la superficie de la malla sin relleno ni forro superior/inferior. «Ambos» imprime volúmenes cerrados de la forma habitual y cualquier polígono restante como superficies.",
    "Travel Speed": "Velocidad de desplazamiento",
    "The speed at which travel moves are made.": "Velocidad a la que tienen lugar los movimientos de desplazamiento.",
    "Top/Bottom Speed": "Velocidad superior/inferior",
    "The speed at which top/bottom layers are printed.": "Velocidad a la que se imprimen las capas superiores/inferiores.",
    "Inner Wall Speed": "Velocidad de pared interior",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "Velocidad a la que se imprimen todas las paredes interiores. Imprimir la pared interior más rápido que la exterior reduce el tiempo de impresión. Ajustar este valor entre la velocidad de la pared exterior y la velocidad a la que se imprime el relleno puede ir bien.",
    "Outer Wall Speed": "Velocidad de pared exterior",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "Velocidad a la que se imprimen las paredes exteriores. Imprimir la pared exterior a una velocidad inferior mejora la calidad final del forro. Sin embargo, una gran diferencia entre la velocidad de la pared interior y de la pared exterior afectará negativamente a la calidad.",
    "Infill Speed": "Velocidad de relleno",
    "The speed at which infill is printed.": "Velocidad a la que se imprime el relleno.",
    "Print Speed": "Velocidad de impresión",
    "The speed at which printing happens.": "Velocidad a la que se realiza la impresión.",
    "Retraction Speed": "Velocidad de retracción",
    "The speed at which the filament is retracted and primed during a retraction move.": "Velocidad a la que se retrae el filamento y se prepara durante un movimiento de retracción.",
    "Retraction Distance": "Distancia de retracción",
    "The length of material retracted during a retraction move.": "Longitud del material retraído durante un movimiento de retracción.",
    "Retract at Layer Change": "Retracción en el cambio de capa",
    "Retract the filament when the nozzle is moving to the next layer.": "Retrae el filamento cuando la tobera se mueve a la siguiente capa.",
    "Enable Retraction": "Habilitar la retracción",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "Retrae el filamento cuando la tobera se mueve sobre un área no impresa. ",
    "Infill Density": "Densidad de relleno",
    "Adjusts the density of infill of the print.": "Ajusta la densidad del relleno de la impresión.",
    "Bottom Thickness": "Grosor inferior",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "Grosor de las capas inferiores en la impresión. Este valor dividido por la altura de capa define el número de capas inferiores.",
    "Top Thickness": "Grosor superior",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "Grosor de las capas superiores en la impresión. Este valor dividido por la altura de capa define el número de capas superiores.",
    "Wall Thickness": "Grosor de la pared",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "Grosor de las paredes en dirección horizontal. Este valor dividido por el ancho de la línea de pared define el número de paredes.",
    "Initial Layer Height": "Altura de capa inicial",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.": "Altura de capa inicial en mm. Una capa inicial más gruesa se adhiere a la placa de impresión con mayor facilidad.",
    "Layer Height": "Altura de capa",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "Altura de cada capa en mm. Los valores más altos producen impresiones más rápidas con una menor resolución, los valores más bajos producen impresiones más lentas con una mayor resolución.",
    "Z Hop Height": "Altura del salto en Z",
    "The height difference when performing a Z Hop.": "Diferencia de altura cuando se realiza un salto en Z.",
    "Z Hop When Retracted": "Salto en Z en la retracción",
    "Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.": "Siempre que se realiza una retracción, la placa de impresión se baja para crear holgura entre la tobera y la impresión. Impide que la tobera golpee la impresión durante movimientos de desplazamiento, reduciendo las posibilidades de alcanzar la impresión de la placa de impresión.",
    "Initial Layer Travel Speed": "Velocidad de desplazamiento de la capa inicial",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "Velocidad de impresión de la capa inicial. Se recomienda un valor más bajo para evitar que las partes ya impresas se separen de la placa de impresión. El valor de este ajuste se puede calcular automáticamente a partir del ratio entre la velocidad de desplazamiento y la velocidad de impresión.",
    "Initial Layer Print Speed": "Velocidad de impresión de la capa inicial",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.": "Velocidad de impresión de la capa inicial. Se recomienda un valor más bajo para mejorar la adherencia a la placa de impresión.",
    "Has Heated Build Plate": "Tiene una placa de impresión caliente",
    "Whether the machine has a heated build plate present.": "Indica si la máquina tiene una placa de impresión caliente.",
    "Printing Temperature": "Temperatura de impresión",
    "The temperature used for printing.": "Temperatura de la impresión.",
    "Printing Temperature Initial Layer": "Temperatura de impresión de la capa inicial",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "Temperatura que se usa para imprimir la primera capa. Se ajusta a 0 para desactivar la manipulación especial de la capa inicial.",
    "Final Printing Temperature": "Temperatura de impresión final",
    "The temperature to which to already start cooling down just before the end of printing.": "La temperatura a la que se puede empezar a enfriar justo antes de finalizar la impresión.",
    "Build Plate Temperature": "Temperatura de la placa de impresión",
    "The temperature used for the heated build plate. If this is 0, the bed will not heat up for this print.": "Temperatura de la placa de impresión una vez caliente. Si el valor es 0, la plataforma no se calentará en esta impresión.",
    "Build Plate Temperature Initial Layer": "Temperatura de la capa de impresión en la capa inicial",
    "The temperature used for the heated build plate at the first layer.": "Temperatura de la placa de impresión una vez caliente en la primera capa.",
    "Diameter": "Diámetro",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "Ajusta el diámetro del filamento utilizado. Este valor debe coincidir con el diámetro del filamento utilizado.",
    "Flow": "Flujo",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "Compensación de flujo: la cantidad de material extruido se multiplica por este valor.",
    "Records: {{from}} - {{to}} / {{total}}": "Grabar: {{desde}} - {{a}} / {{total}}",
    "Records: {{total}}": "Grabar: {{total}}",
    "{{pageLength}} per page": "{{pageLength}} por página",
    "This is an alpha feature that helps you get started with CNC Carving. Make sure you": "Esta es una característica alfa que lo ayuda a comenzar con el Corte CNC. Asegúrese",
    "Read This First - Safety Information": "Lea Esto Primero - Información de Seguridad",
    "before any further instructions.": "antes de cualquier otra instrucción.",
    "Don't show again in current session": "No volver a mostrar en la sesión actual",
    "Upload SVG File": "Subir Archivo SVG",
    "Size": "Tamaño",
    "Work Speed": "Velocidad de trabajo",
    "Plunge Speed": "Velocidad de inmersión",
    "Jog Speed": "Velocidad de avance",
    "Grey Level": "Nivel de Gris",
    "Target Depth": "Profundidad de la silueta",
    "Cutting Diameter": "Diámetro de corte",
    "Stop Height": "Detener avance",
    "Command succeeded": "El comando tuvo éxito",
    "Command failed ({{err}})": "Comando fallido ({{err}})",
    "Options": "Opciones",
    "Command": "Comando",
    "Show notifications": "Mostrar notificaciones",
    "Store": "Archivar",
    "Server has halted intentionally by you": "El servidor se detuvo intencionalmente debido a ti",
    "Emergency stop triggered, Please restart the Snapmaker then reconnect.": "Parada de emergencia activada, reiniciar Snapmaker y volver a conectar.",
    "Reload": "Recargar",
    "Reset": "Restaurar",
    "STOP": "DETENER",
    "User Manual & FAQ": "Manual de usuario y preguntas frecuentes",
    "Forum": "Foro",
    "Authentication failed.": "Autenticación fallida",
    "Sign in to {{name}}": "Iniciar sesión en {nombre}}",
    "Username": "Nombre de usuario",
    "Password": "Contraseña",
    "Sign In": "Acceder",
    "Forgot your password?": "Olvidó su contraseña?",
    "Learn more": "Conozca más",
    "Downloads": "descargar",
    "Report an issue": "Informar un problema",
    "Checking for updates...": "Buscar actualizaciones ...",
    "A new version of {{name}} is available": "Una nueva versión de {{nombre}} está disponible",
    "Version {{version}}": "Versión {{version}}",
    "Latest version": "Última versión",
    "You already have the newest version of {{name}}": "Ya tienes la última versión de {{nmbre}}",
    "Account": "Cuenta",
    "New": "Nuevo",
    "Account status": "Estado de la cuenta",
    "Confirm Password": "Confirmar la contraseña",
    "Cancel": "Cancelar",
    "OK": "OK",
    "An unexpected error has occurred.": "Se produjo un error inesperado.",
    "Loading...": "Cargando ...",
    "No data to display": "No hay información para mostrar",
    "Enabled": "Habilitado",
    "Disabled": "Discapacitado",
    "Date Modified": "Fecha modificada",
    "Action": "Acción",
    "Edit Account": "Editar cuenta",
    "Delete Account": "Eliminar cuenta",
    "Settings": "Configuraciones",
    "My Account": "Mi cuenta",
    "Are you sure you want to delete the account?": "¿Seguro que quieres eliminar la cuenta?",
    "Update": "Actualizar",
    "Old Password": "Contraseña anterior",
    "Change Password": "Cambiar contraseña",
    "New Password": "Nueva contraseña",
    "Commands": "Comandos",
    "Title": "Título",
    "and more...": "y más ...",
    "Delete": "Eliminar",
    "Are you sure you want to delete this item?": "¿Seguro que quieres eliminar este artículo?",
    "Events": "Eventos",
    "Event": "Evento",
    "Choose an event": "Elegir un evento",
    "Startup (System only)": "Inicio (solo sistema)",
    "Open a serial port (System only)": "Abrir un puerto serial (solo sistema)",
    "Close a serial port (System only)": "Cerrar un puerto serial (solo sistema)",
    "G-code: Load": "Código G: Cargar",
    "G-code: Unload": "Código G: Desargar",
    "G-code: Start": "Código G: Iniciar",
    "G-code: Stop": "Código G: Detener",
    "G-code: Pause": "Código G: Pausar",
    "G-code: Resume": "Código G: Continuar",
    "Feed Hold": "Mantener la fuente de alimentación",
    "Cycle Start": "Inicio del ciclo",
    "Homing": "Homing",
    "Sleep": "Modo de suspensión",
    "Trigger": "Disparadores",
    "Choose an trigger": "Elige un disparador",
    "System": "Sistema",
    "G-code": "Código G",
    "Startup": "Inicio",
    "Open a serial port": "Abrir un puerto serial",
    "Close a serial port": "Cerrar un puerto serial",
    "Automatically check for updates": "Buscar actualizaciones automáticamente",
    "Language": "Idioma",
    "Save Changes": "Guardar cambios",
    "General": "General",
    "Workspace": "Área de trabajo",
    "About": "Información",
    "Restore Defaults": "Restaurar los valores predeterminados",
    "Are you sure you want to restore the default settings?": "¿Estás seguro de que quieres restablecer la configuración predeterminada?",
    "The account name is already being used. Choose another name.": "El nombre de la cuenta ya está en uso. Eligir otro nombre",
    "Passwords do not match.": "Las contraseñas no coinciden.",
    "3D Printing G-code Generator": "Generador de código G de impresión 3D",
    "Laser G-code Generator": "Generador de código G de láser",
    "CNC G-code Generator": "Generador de código G de CNC",
    "Fork Widget": "Inserir el widget",
    "Are you sure you want to fork this widget?": "¿Seguro que quieres inserir este widget?",
    "Remove Widget": "Eliminar Widget",
    "Are you sure you want to remove this widget?": "¿Seguro que quieres eliminar este widget?",
    "On": "Encendido",
    "Off": "Apagado",
    "Visualizer Widget": "Visualizador de widget",
    "This widget visualizes a G-code file and simulates the tool path.": "Este widget muestra un file G.Code y simula la trayectoria del instrumento.",
    "Connection Widget": "Conexión de widget",
    "This widget lets you establish a connection to a serial port.": "Este widget te permite establecer una conexión a un puerto serial.",
    "Console Widget": "Panel de comando de Widget",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "Este widget  permite leer y escribir datos en el controlador CNC conectado a un puerto serial.",
    "Grbl Widget": "Widget Grbl",
    "This widget can view Grbl state and settings.": "Este widget puede mostrar el estado y la configuración de Grbl.",
    "Marlin Widget": "Widget Marlin",
    "This widget can view Marlin state and settings.": "Este widget puede mostrar el estado y la configuración de Marlin.",
    "Smoothie Widget": "Widget de Smoothie",
    "This widget can view Smoothie state and settings.": "Este widget puede ver el estado y la configuración de Smoothie",
    "TinyG Widget": "Widget TinyG",
    "This widget can view TinyG state and settings.": "Este widget puede mostrar el estado y la configuración de TinyG",
    "Axes Widget": "Haces de widgets",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Este widget muestra la posición XYZ. Incluye control de progreso, homing y axis cero.",
    "G-code Widget": "Widget código G",
    "This widget shows the current status of G-code commands.": "Este widget muestra el estado actual de los comandos del G.Code.",
    "Laser Widget": "Widget láser",
    "This widget allows you control laser intensity and turn the laser on/off.": "Este widget le permite controlar la intensidad del láser y encender / apagar el láser.",
    "Webcam Widget": "Widget de la webcam",
    "This widget lets you monitor a webcam.": "Este widget le permite monitorear unawebcam.",
    "Widgets": "Widgets",
    "Server has stopped working": "El servidor ha dejado de funcionar",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "Un problema hizo que el servidor funcionara correctamente. Verificar el estado del servidor y volver a intentarlo.",
    "Close": "Cerrar",
    "This field is required.": "Este campo es obligatorio.",
    "Passwords should be equal.": "Las contraseñas deben ser iguales.",
    "mm": "mm",
    "in": "en",
    "Axis": "Eje",
    "Work Position": "Posición de trabajo",
    "Go To Work Zero On X Axis (G0 X0)": "Trabajar en Zero On en el eje X (G0 X0)",
    "Zero Out Temporary X Axis (G92 X0)": "Eje temporal X Zero out (G92 X0)",
    "Go To Work Zero On Y Axis (G0 Y0)": "Trabajar en Zero On en el eje Y (G0 Y0)",
    "Zero Out Temporary Y Axis (G92 Y0)": "Eje temporal Zero out (G92 Y0)",
    "Go To Work Zero On Z Axis (G0 Z0)": "Trabajar en Zero On en el eje Z (G0 Z0)",
    "Zero Out Temporary Z Axis (G92 Z0)": "Eje temporal Zero cero (G92 Z0)",
    "Axes": "Eje",
    "Keypad jogging": "Teclado para correr",
    "Expand": "Expandir",
    "Collapse": "Plegar",
    "More": "Más",
    "Enter Full Screen": "Ingresar al modo de pantalla completa",
    "Exit Full Screen": "Salir del modo de pantalla completa",
    "User Defined": "Definido por el usuario",
    "Custom distance for every move operation": "Distancia personalizada para cada operación de movimiento",
    "Increase custom distance by one unit": "Aumentar la distancia personalizada de una unidad",
    "Decrease custom distance by one unit": "Disminuir la distancia personalizada de una unidad",
    "Move X- Y+": "Mover X- Y+",
    "Move Y+": "Mover Y +",
    "Move X+ Y+": "Mover X + Y +",
    "Move Z+": "Mover Z +",
    "Move X-": "Mover X-",
    "Move To XY Zero (G0 X0 Y0)": "Cambiar a XY Zero (G0 X0 Y0)",
    "Move X+": "Mover X +",
    "Move To Z Zero (G0 Z0)": "Cambiar a Z Zero (G0 Z0)",
    "Move X- Y-": "Mover X- Y-",
    "Move Y-": "Mover Y-",
    "Move X+ Y-": "Mover X + Y-",
    "Move Z-": "Mover Z-",
    "Right": "Derecha",
    "Left": "Izquierda",
    "Up": "Arriba",
    "Down": "Abajo",
    "Page Up": "Página arriba",
    "Page Down": "Página abajo",
    "0.1x Move": "Mover 0.1x",
    "Alt": "Alt",
    "10x Move": "Mover 10x",
    "⇧ Shift": "⇧ Shift",
    "Run Boundary": "Ejecutar Contorno",
    "Click to check the boundary of the image to be engraved.": "Hacer clic para verificar el contorno de la imagen que se grabará.",
    "Go To Work Origin": "Ir al recurso de trabajo",
    "Move the head to the last saved work origin.": "Mover la cabeza al último recurso de trabajo guardado.",
    "Set Work Origin": "Establecer Origen de Trabajo",
    "Set the current position of the head as the work origin.": "Establece la posición actual de la cabeza como fuente de trabajo.",
    "Shuttle Settings": "Configuraciones de Shuttle",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "Rango de frecuencia de alimentación: {{min}} - {{max}} mm / min",
    "Repeat Rate: {{hertz}}Hz": "Frecuencia de repetición: {{hertz}} Hz",
    "60 Times per Second": "60 veces por segundo",
    "45 Times per Second": "45 veces por segundo",
    "30 Times per Second": "30 veces por segundo",
    "15 Times per Second": "15 veces por segundo",
    "10 Times per Second": "10 veces por segundo",
    "5 Times per Second": "5 veces por segundo",
    "2 Times per Second": "2 veces por segundo",
    "Once Every Second": "1 vez por segundo",
    "Distance Overshoot: {{overshoot}}x": "Distancia Sformaneti: {sfamenti}} x",
    "Determines how fast the tool moves when it’s not carving.": "Determinar la velocidad a la que se mueve el instrumento cuando no se talla.",
    "Determines how fast the tool feeds into the material.": "Determinra la velocidad de avance del instrumento en el material.",
    "Generate G-code": "Generar código G",
    "Output": "Salida",
    "Load G-code to Workspace": "Cargue el Código G en Workspace",
    "Export G-code to file": "Exportar código G al archivo",
    "Carving Path": "Camino de talla",
    "Carve Path": "Camino del tallado",
    "Select a carve path:": "Seleccionr la ruta de tallado",
    "Carve along the contour of the image.": "Esculpir a lo largo del contorno de la imagen.",
    "Carve along the shape of the image.": "Esculpir a lo largo de la forma de la imagen.",
    "Outline": "Contorno",
    "On the Path": "En l trayectoria",
    "Choose carve path": "Elige tallar el camino",
    "Resolution": "Resolución",
    "The detected resolution of the loaded image.": "La resolución detectada de la imagen cargada.",
    "Size (mm)": "Tamaño (mm)",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "Ingresar el tamaño de la imagen grabada El tamaño no puede ser más de 125 x 125 mm o el tamaño de su material.",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "ingresar la profundidad de la imagen grabada La profundidad no puede ser más profunda que la longitud de la flauta.",
    "Step Down": "Reducir",
    "Enter the depth of each carving step.": "ingresar la profundidad de cada pasaje de muesca.",
    "Jog Height": "Participación anticipada",
    "The distance between the tool and the material when it’s not carving.": "La distancia entre el instrumento y el material cuando no está tallado.",
    "The distance between the tool and the material when the machine stops.": "La distancia entre la herramienta y el material cuando la máquina se detiene.",
    "Alignment": "Alineación",
    "None": "Ninguno",
    "Tab Height": "Altura de la tabla",
    "Enter the height of the tabs.": "ingresar el alto de la pestaña",
    "Tab Space": "Espacio de la pestaña.",
    "Enter the space between any two tabs.": "Ingresar el espacio entre dos pestañas.",
    "Tab Width": "Ancho de la pestaña",
    "Enter the width of the tabs.": "Ingresar el ancho de las pestañas.",
    "Preview": "Vista Previa",
    "Carving Tool": "Instrumento de tallado",
    "Carving V-Bit": "Talla V-Bit",
    "Flat End Mill": "Flat End Mill",
    "Ball End Mill": "Ball End Mill",
    "Use Other Bit": "Usar otro bit",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "Ingresar el diámetro de la parte más ancha de la hoja. Tener en cuenta que no es el diámetro del vástago.",
    "For the carving bits that we provide, please enter the following value:": "Para las piezas de talla que proporcionamos, ingresar el siguiente valor:",
    "Point Angle": "Ángulo apuntado",
    "Enter the angle of the blade.": "Ingresar el ángulo de la cuchilla.",
    "fullscreen": "Pantalla completa",
    "Manufacturer: {{manufacturer}}": "Fabricante: {{producer}}",
    "Port": "Puerta",
    "No ports available": "Sin puerta disponible",
    "Choose a port": "Eligir una puerta",
    "Refresh": "Recargar",
    "Open": "Abrir",
    "Error opening serial port '{{- port}}'": "Error al abrir el puerto serial '{{- port}}'",
    "Connection": "Conexión",
    "No serial connection": "Sin conexión serial",
    "Connected to {{-port}}": "Conectado a {{-port}}",
    "Console": "Panel de comando",
    "Clear all": "Borrar todo",
    "Min": "Mín",
    "Max": "Máx",
    "Dimension": "Dimensiones",
    "Sent": "Enviado",
    "Received": "Recibido",
    "Start Time": "Hora de inicio",
    "Elapsed Time": "Tiempo gastado",
    "Finish Time": "Hora de finalización",
    "Remaining Time": "Tiempo restante",
    "Laser": "Láser",
    "Laser On": "Laser Encendido",
    "Laser Off": "Láser apagado",
    "Save (SD Card)": "Guardar (memoria SD)",
    "Hide": "Ocultar",
    "Show": "Mostrar",
    "Laser Test": "Prueba láser",
    "Power (%)": "Energía(%)",
    "Test duration": "Duración de la prueba",
    "ms": "ms",
    "Maximum value": "Valor máximo",
    "Determines how fast the machine moves when it’s not engraving.": "Determinar la velocidad a la que la máquina se mueve cuando no está cortando.",
    "Determines how fast the machine moves when it’s engraving.": "Determinar qué tan rápido se mueve la máquina está cortando.",
    "Dwell Time": "Detener el tiempo",
    "Determines how long the laser keeps on when it’s engraving a dot.": "Determinar cuánto tiempo permanece encendido el láser cuando está cortando un punto.",
    "B&W": "B & W",
    "Set the proportion of the black color based on the original color of the image.": "Establece la proporción de color negro en función del color original de la imagen.",
    "Line Direction": "Dirección de la línea",
    "Select the direction of the engraving path.": "Seleccione la dirección de la ruta de grabado.",
    "Horizontal": "Horizontal",
    "Vertical": "Vertical",
    "Diagonal": "Diagonal",
    "Diagonal2": "Diagonal2",
    "Choose an algorithm": "Elija un algoritmo",
    "Density": "Densidad",
    "Contrast": "Contraste",
    "The difference between the lightest color and the darkest color.": "Seleccionar la dirección de la ruta de grabado.",
    "Brightness": "Brillo",
    "The engraved picture is brighter when this value is bigger.": "La imagen grabada es más brillante cuando este valor es más grande.",
    "White Clip": "Clip blanco",
    "Set the threshold to turn the color that is not pure white into pure white.": "Establecer el umbral para transformar el color que no es blanco puro en blanco puro.",
    "Algorithm": "Aalgoritmo",
    "Choose an algorithm for image processing.": "Elija un algoritmo para el procesamiento de imagen",
    "Preview Settings": "Configuración de vista previa",
    "(default image)": "(imagen predeterminada)",
    "Parse Image Error": "Error de análisis de imagen",
    "Failed to parse image file {{}}": "Error al analizar el archivo de imagen {{}}",
    "GREYSCALE": "ESCALA DE GRISES",
    "VECTOR": "VECTOR",
    "TEXT": "TEXTO",
    "Source Type": "Tipo de fuente",
    "Raster": "Trama",
    "SVG": "SVG",
    "Upload Image": "Subir Imagen",
    "Middle": "Intermedio",
    "Center": "Centrar",
    "Bottom Left": "Abajo a la izquierda",
    "Bottom Middle": "Abajo en el medio",
    "Bottom Right": "Abajo a la derecha",
    "Top Left": "Arriba a la izquierda",
    "Top Middle": "Arriba Medio",
    "Top Right": "Parte superior derecha",
    "Text": "Texto",
    "Font": "Fuente",
    "Choose font": "Elija el tipo de letra",
    "Enter the font size in pt (points).": "Ingrese el tamaño de letra en pt (puntos).",
    "Line Height": "Altura de la Línea",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "Establezca la distancia entre cada línea en el texto. El valor que ingresa es el múltiplo del tamaño de la letra.",
    "Align the text in different lines to either the left or right or in the center horizontally.": "Alinee el texto horizontalmente en diferentes líneas a la izquierda o derecha o al centro.",
    "Anchor": "Enclaje",
    "Find the anchor of the text to correspond to the (0, 0) coordinate.": "Encuentra el anclaje del texto para que corresponda con la coordenada (0, 0).",
    "Impurity Size": "Tamaño de impureza",
    "Determines the minimum size of impurity which allows to be showed.": "Determinar el tamaño mínimo de impureza que se puede mostrar.",
    "Invert": "Invertir",
    "Inverts black to white and vise versa.": "Invertir negro a blanco y viceversa.",
    "Optimize Path": "Optimizar la ruta",
    "Optimizes the path based on the proximity of the lines in the image.": "Optimizar la ruta en función de la proximidad de las líneas en la imagen.",
    "Fine Tune Work Origin": "Fuente de Trabajo de la Afinación",
    "How Fine Tune Work Origin Works": "Cómo Funciona la Maquina para Afinar",
    "Click": "Haga clic",
    "Focus": "Enfocar",
    "and use": "y use",
    "Jog Pad": "Comienzo del relleno",
    "Generate and Load G-code": "Generar y Subir el código G",
    "and the G-code is automatically generated and loaded.": "y el código G se genera y carga automáticamente.",
    "to start laser cutting.": "para iniciar el corte por láser",
    "Determines how fast the machine moves when it’s working.": "Determina la velocidad de movimiento de la máquina cuando está en funcionamiento",
    "Power": "Poder",
    "Power to use when laser is working.": "Poder para usar cuando el láser está funcionando.",
    "Enable 3D View": "Habilitar perspectiva 3D",
    "Disable 3D View": "Deshabilitar la perspectiva 3D",
    "Hide Coordinate System": "Ocultar sistema de coordenadas",
    "Show Coordinate System": "Mostrar sistema de coordenadas",
    "File folder": "Carpeta de archivos",
    "{{extname}} File": "{{extname}} Archivo",
    "File": "File",
    "Reset Position": "Restablecer posición",
    "Zoom In": "Acercar",
    "Zoom Out": "Alejar",
    "Controller State": "Estado del controlador",
    "Controller Settings": "Configuración del controlador",
    "3D Printer": "Impresora 3d",
    "CNC": "CNC",
    "Set": "Conjunto",
    "Save": "Guardar",
    "F": "F",
    "Adjust feedrate percentage, which applies to moves along all axis.": "Ajusta el porcentaje de avance, que se aplica a los movimientos a lo largo de todo el eje.",
    "Nozzle Temperature": "Temperatura de la Boquilla",
    "Bed Temperature": "Mala Temperatura",
    "Tool Head Power": "Herramienta eléctrica Cabeza",
    "ON": "ENCENDIDO",
    "OFF": "Apagado",
    "Quality": "Calidad",
    "Shell": "Capa",
    "Infill": "Relleno",
    "Speed": "Velocidad",
    "Retract & Z Hop": "Retraer y Z Hop",
    "Surface": "Superficie",
    "Recommended": "Recomendado",
    "Customize": "Personalizada",
    "Fast Print": "Impresión rápida",
    "Normal Quality": "Calidad Normal",
    "High Quality": "Alta Calidad",
    "Show Details": "Mostrar Detalles",
    "Profile": "Perfil",
    "Printing Settings": "Configuración de impresión",
    "Material & Support": "Material y Soporte",
    "Custom Material": "Material Personalizado",
    "Adhesion": "Adhesión",
    "Support": "Apoyo",
    "Touch Building Plate": "Placa toque de construcción",
    "Everywhere": "En todas partes",
    "Slicing {{progress}}%": "Cortando {{progress}}%",
    "Slice error: ": "",
    "Parsing G-code...": "Analizando el còdigo G…",
    "Loading model...": "Cargando modelo ...",
    "Pre-processing model...": "Modelo de preprocesamiento...",
    "Preparing for slicing...": "Preparándose para cortar...",
    "Upload File": "Subir archivo",
    "G-code not loaded": "Código G no cargado",
    "Projection": "Proyección",
    "Perspective Projection": "Proyección de la perspectiva",
    "Orthographic Projection": "Proyección ortográfica",
    "Scene Objects": "Objetos de escena",
    "Display G-code Filename": "Mostrar nombre de archivo de código G",
    "Hide Toolhead": "Ocultar herramienta",
    "Show Toolhead": "Mostrar herramienta",
    "3D rendering...": "ejecución 3D…",
    "Move the camera": "Mover la cámara",
    "Rotate the camera": "Girar la cámara",
    "Watch Directory": "Mirar la lista",
    "Name": "Nombre",
    "Type": "Tipo",
    "Load G-code": "Cargar código G",
    "Upload G-code": "Subir código G",
    "Run": "Iniciar",
    "Pause": "Pausa",
    "Stop": "Detener",
    "Webcam": "Cámara Web",
    "Edit": "Editar",
    "Enable": "Habilitar",
    "Disable": "Inhabilitar",
    "Webcam Settings": "Configuración de webcam",
    "Media Source": "Fuente de medios",
    "Use a built-in camera or a connected webcam": "Utilizar una cámara integrada o una webcam conectada",
    "Use a M-JPEG stream over HTTP": "Utilizar una secuencia M-JPEG a través de HTTP",
    "Webcam is off": "La webcam está apagada",
    "Rotate Left": "Girar a la izquierda",
    "Rotate Right": "Girar a la derecha",
    "Flip Horizontally": "Voltear horizontalmente",
    "Flip Vertically": "Voltear verticalmente",
    "Crosshair": "Punto de mira",
    "Note: If you are using the CNC Carving Module, make sure the carving bit will not run into the fixtures before you use this feature.": "Nota: Si usa el módulo de corte CNC, asegúrese de que la punta de corte no entre en los dispositivos antes de usar esta función.",
    "Enter the text you want to engrave. The maximum length of the text is 125 mm. When the text is too long, it will be shrunk automatically. Start a new line manually according to your needs.": "Ingrese el texto que desea editar. La longitud máxima del texto es 125 mm. Cuando el texto es demasiado largo, se reducirá automáticamente. Comience una nueva línea manualmente según sus necesidades.",
    "Setting work origin is essentially finding the best place for the engraved image in the X and Y directions and determining the distance (Z Offset) between the Engraving & Carving Platform and the Laser Module to acquire the smallest laser dot on the material for the most efficient use of the laser power and the best result. For the 200mW Laser Engraving Module, the Z Offset can be set by judging the size of the laser dot by eyes with low power. However, for the 1600mW Laser Cutting Module, this method is less accurate as the laser dot is too strong and less interpretable. To set the Z Offset more accurately, we can move the module to the position that is close to the optimal Z Offset (Offset A). The software will test the results from a few positions next to Offset A on the same material. The best result determines the best Z Offset.": "El ajuste del origen del trabajo consiste esencialmente en encontrar el mejor lugar para la imagen grabada en las direcciones X e Y y en determinar la distancia Offset Z) entre la plataforma de grabado y Tahlio y el módulo láser para adquirir el más pequeño mancha láser en el material para un uso más eficiente de la potencia del láser y el mejor resultado. Para el módulo de grabado láser de 200 mW, la compensación Z se puede establecer evaluando visualmente el tamaño del punto láser de baja potencia. Sin embargo, para el Módulo de corte láser de 1600 mW, este método es menos preciso porque el punto del láser es demasiado fuerte y menos interpretable. Para establecer el desplazamiento Z con mayor precisión, podemos mover el módulo a la posición cercana al desplazamiento Z óptimo (desplazamiento A). El software probará los resultados de algunas ubicaciones junto al Compensador A en el mismo material. El mejor resultado determina la mejor compensación de Offset Z.",
    "in the Axes section to move the Laser Cutting Module to the position that is close to the optimal Z Offset (just like how you do with the 200mW Laser Engraving Module).": "en la sección Eje para mover el Módulo de Corte por Láser a la posición cercana al Z Offset óptimo (al igual que el Módulo de Grabado Láser de 200 mW).",
    "Set Work Speed and Power based on the material you are using. If you are using a piece of 1.5 mm wood sheet, it’s recommended to set the Work Speed to a value between 80 mm/s and 120 mm/s and set the Power to 100%.": "Establezca la velocidad y la potencia de trabajo en función del material que esté utilizando. Si está utilizando una pieza de lámina de madera de 1,5 mm, se recomienda ajustar la Velocidad de trabajo a un valor entre 80 mm / sy 120 mm / sy ajustar la potencia al 100%.",
    "Choose the position that can cut the material the most smoothly or engrave the thinnest line and the software will set it as Z Offset. In this example, -2.0 should be the Z Offset.": "Elija la posición que pueda cortar el material de la manera más suave o grabe la línea más delgada y el software lo configurará como Z Offset. En este ejemplo, -2.0 debería ser el Z Offset.",
    "Parse File Error": "Error de análisis de archivo",
    "Failed to parse image file {{filename}}": "Error al analizar el archivo de imagen {{filename}}",
    "Tool Head Status (M3)": "Cabeza herramienta Estado (M3)",
    "Skirt": "Bordear",
    "Brim": "Borde",
    "Raft": "Serie",
    "Normal": "Normal",
    "Both": "Ambos",
    "Warning": "Advertencia",
    "Slicing completed.": "Corte completado",
    "Parsed G-code successfully.": "Còdigo G analizado con éxito.",
    "Failed to parse G-code: ": "",
    "Loaded model successfully.": "Modelo cargado con éxito.",
    "Failed to load model.": "Error al cargar el modelo.",
    "Rendered G-code successfully.": "Còdigo G Renderizado con éxito.",
    "Tabs": "Pestaña",
    "Upload": "",
    "Find the anchor of the image to correspond to the (0, 0) coordinate.": "",
    "Choose algorithms": "",
    "New Update Available": "Nueva actualización disponible",
    "A web-based interface for Snapmaker which is able to do 3D Printing, laser engraving and CNC carving.": "",
    "Determines how fast the tool moves on the material.": "Determinar la velocidad a la que el instrumento se mueve sobre el material.",
    "Select the type of the image you want to upload. Raster supports PNG and JPEG images, while SVG only supports SVG images. The Raster images will be transferred into SVG automatically.": "Establezca la velocidad y la potencia de su trabajo en función del material que esté utilizando. Si se utiliza una hoja de madera de 1,5 mm, se recomienda establecer la velocidad de trabajo a un valor entre 80 mm / sy 120 mm / sy ajustar la potencia al 100%.",
    "Select a word font or upload a font from your computer. WOFF, TTF, OTF fonts are supported.": "",
    "Fill Density": "",
    "Determines how fine and smooth the engraved picture will be. The bigger this value is, the better quality you will get. The range is 1-10 dot/mm and 10 is recommended.": "",
    "Center Left": "",
    "Center Right": "",
    "Center Selected Model": "",
    "Delete Selected Model": "",
    "Duplicate Selected Model": "",
    "Reset Selected Model Transformation": "",
    "Clear Build Plate": "",
    "Arrange All Models": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the text will be engraved without fill.": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the SVG image will be engraved without fill.": "",
    "Next": "",
    "Clip": "",
    "Passes": "",
    "Pass Depth": "",
    "STL File (Binary) (*.stl)": "",
    "STL File (ASCII) (*.stl)": "",
    "OBJ File (*.obj)": "",
    "Export Models": "",
    "Only SVG files are supported.": "",
    "Drop an SVG file here.": "",
    "Only STL/OBJ files are supported.": "",
    "Drop an STL/OBJ file here.": "",
    "Only G-code files are supported": "",
    "Drop a G-code file here.": "",
    "When enabled, the printer will run the G-code multiple times automatically according to the below settings. This feature helps you cut materials that can't be cut with only one pass.": "",
    "Determines how many times the printer will run the G-code automatically.": "",
    "Determines how much the laser module will be lowered after each pass.": "",
    "Fixed Power": "",
    "Multi-pass": "",
    "When enabled, the power used to engrave this image will be set in the G-code, so it is not affected by the power you set in Workspace.": "",
    "Fill": "",
    "Only {{accept}} files are supported.": "",
    "Drop an image file here.": "",
    "Lay Flat Selected Model": ""
}
