{
    "Generate Support": "Generar soporte",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "Generar estructuras para soportar piezas del modelo que tengan voladizos. Sin estas estructuras, estas piezas se romperían durante la impresión.",
    "Build Plate Adhesion Type": "Tipo adherencia de la placa de impresión",
    "Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "Opciones diferentes que ayudan a mejorar tanto la extrusión como la adherencia a la placa de impresión. El borde agrega una zona plana de una sola capa alrededor de la base del modelo para impedir que se deforme. La balsa agrega una rejilla gruesa con un techo por debajo del modelo. La falda es una línea impresa alrededor del modelo, pero que no está conectada al modelo.",
    "Initial Layer Line Width": "Ancho de línea de la capa inicial",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "Multiplicador del ancho de la línea de la primera capa. Si esta se aumenta, se puede mejorar la adherencia a la plataforma.",
    "Spiralize Outer Contour": "Espiralizar el contorno exterior",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "La opción de espiralizar suaviza el movimiento en Z del borde exterior. Esto creará un incremento en Z constante durante toda la impresión. Esta función convierte un modelo sólido en una impresión de una sola pared con una parte inferior sólida. Esta función solo se debería habilitar cuando cada capa contenga una única pieza.",
    "Surface Mode": "Modo de superficie",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "Tratar el modelo como una superficie solo, un volumen o volúmenes con superficies sueltas. El modo de impresión normal solo imprime volúmenes cerrados. «Superficie» imprime una sola pared trazando la superficie de la malla sin relleno ni forro superior/inferior. «Ambos» imprime volúmenes cerrados de la forma habitual y cualquier polígono restante como superficies.",
    "Travel Speed": "Velocidad de desplazamiento",
    "The speed at which travel moves are made.": "Velocidad a la que tienen lugar los movimientos de desplazamiento.",
    "Top/Bottom Speed": "Velocidad superior/inferior",
    "The speed at which top/bottom layers are printed.": "Velocidad a la que se imprimen las capas superiores/inferiores.",
    "Inner Wall Speed": "Velocidad de pared interior",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "Velocidad a la que se imprimen todas las paredes interiores. Imprimir la pared interior más rápido que la exterior reduce el tiempo de impresión. Ajustar este valor entre la velocidad de la pared exterior y la velocidad a la que se imprime el relleno puede ir bien.",
    "Outer Wall Speed": "Velocidad de pared exterior",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "Velocidad a la que se imprimen las paredes exteriores. Imprimir la pared exterior a una velocidad inferior mejora la calidad final del forro. Sin embargo, una gran diferencia entre la velocidad de la pared interior y de la pared exterior afectará negativamente a la calidad.",
    "Infill Speed": "Velocidad de relleno",
    "The speed at which infill is printed.": "Velocidad a la que se imprime el relleno.",
    "Print Speed": "Velocidad de impresión",
    "The speed at which printing happens.": "Velocidad a la que se realiza la impresión.",
    "Retraction Speed": "Velocidad de retracción",
    "The speed at which the filament is retracted and primed during a retraction move.": "Velocidad a la que se retrae el filamento y se prepara durante un movimiento de retracción.",
    "Retraction Distance": "Distancia de retracción",
    "The length of material retracted during a retraction move.": "Longitud del material retraído durante un movimiento de retracción.",
    "Retract at Layer Change": "Retracción en el cambio de capa",
    "Retract the filament when the nozzle is moving to the next layer.": "Retrae el filamento cuando la tobera se mueve a la siguiente capa.",
    "Enable Retraction": "Habilitar la retracción",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "Retrae el filamento cuando la tobera se mueve sobre un área no impresa. ",
    "Infill Density": "Densidad de relleno",
    "Adjusts the density of infill of the print.": "Ajusta la densidad del relleno de la impresión.",
    "Bottom Thickness": "Grosor inferior",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "Grosor de las capas inferiores en la impresión. Este valor dividido por la altura de capa define el número de capas inferiores.",
    "Top Thickness": "Grosor superior",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "Grosor de las capas superiores en la impresión. Este valor dividido por la altura de capa define el número de capas superiores.",
    "Wall Thickness": "Grosor de la pared",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "Grosor de las paredes en dirección horizontal. Este valor dividido por el ancho de la línea de pared define el número de paredes.",
    "Initial Layer Height": "Altura de capa inicial",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.": "Altura de capa inicial en mm. Una capa inicial más gruesa se adhiere a la placa de impresión con mayor facilidad.",
    "Layer Height": "Altura de capa",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "Altura de cada capa en mm. Los valores más altos producen impresiones más rápidas con una menor resolución, los valores más bajos producen impresiones más lentas con una mayor resolución.",
    "Z Hop Height": "Altura del salto en Z",
    "The height difference when performing a Z Hop.": "Diferencia de altura cuando se realiza un salto en Z.",
    "Z Hop When Retracted": "Salto en Z en la retracción",
    "Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.": "Siempre que se realiza una retracción, la placa de impresión se baja para crear holgura entre la tobera y la impresión. Impide que la tobera golpee la impresión durante movimientos de desplazamiento, reduciendo las posibilidades de alcanzar la impresión de la placa de impresión.",
    "Initial Layer Travel Speed": "Velocidad de desplazamiento de la capa inicial",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "Velocidad de impresión de la capa inicial. Se recomienda un valor más bajo para evitar que las partes ya impresas se separen de la placa de impresión. El valor de este ajuste se puede calcular automáticamente a partir del ratio entre la velocidad de desplazamiento y la velocidad de impresión.",
    "Initial Layer Print Speed": "Velocidad de impresión de la capa inicial",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.": "Velocidad de impresión de la capa inicial. Se recomienda un valor más bajo para mejorar la adherencia a la placa de impresión.",
    "Has Heated Build Plate": "Tiene una placa de impresión caliente",
    "Whether the machine has a heated build plate present.": "Indica si la máquina tiene una placa de impresión caliente.",
    "Printing Temperature": "Temperatura de impresión",
    "The temperature used for printing.": "Temperatura de la impresión.",
    "Printing Temperature Initial Layer": "Temperatura de impresión de la capa inicial",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "Temperatura que se usa para imprimir la primera capa. Se ajusta a 0 para desactivar la manipulación especial de la capa inicial.",
    "Final Printing Temperature": "Temperatura de impresión final",
    "The temperature to which to already start cooling down just before the end of printing.": "La temperatura a la que se puede empezar a enfriar justo antes de finalizar la impresión.",
    "Build Plate Temperature": "Temperatura de la placa de impresión",
    "The temperature used for the heated build plate. If this is 0, the bed will not heat up for this print.": "Temperatura de la placa de impresión una vez caliente. Si el valor es 0, la plataforma no se calentará en esta impresión.",
    "Build Plate Temperature Initial Layer": "Temperatura de la capa de impresión en la capa inicial",
    "The temperature used for the heated build plate at the first layer.": "Temperatura de la placa de impresión una vez caliente en la primera capa.",
    "Diameter": "Diámetro",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "Ajusta el diámetro del filamento utilizado. Este valor debe coincidir con el diámetro del filamento utilizado.",
    "Flow": "Flujo",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "Compensación de flujo: la cantidad de material extruido se multiplica por este valor.",
    "Records: {{from}} - {{to}} / {{total}}": "Registros: {{from}} - {{to}} / {{total}}",
    "Records: {{total}}": "Registros: {{total}}",
    "{{pageLength}} per page": "{{pageLength}} por página",
    "This is an alpha feature that helps you get started with CNC Carving. Make sure you": "",
    "Read This First - Safety Information": "",
    "before any further instructions.": "",
    "Don't show again in current session": "",
    "Upload SVG File": "",
    "Size": "Tamaño",
    "Work Speed": "",
    "Plunge Speed": "",
    "Jog Speed": "",
    "Grey Level": "",
    "Target Depth": "",
    "Cutting Diameter": "",
    "Stop Height": "",
    "New update available": "Nueva actualización disponible",
    "Command succeeded": "",
    "Command failed ({{err}})": "",
    "Options": "Opciones",
    "Command": "",
    "Show notifications": "",
    "Store": "",
    "Server has halted intentionally by you": "",
    "Emergency stop triggered, Please restart the Snapmaker then reconnect.": "",
    "Reload": "",
    "Reset": "",
    "STOP": "",
    "New Update Available!": "",
    "User Manual & FAQ": "",
    "Forum": "",
    "Authentication failed.": "",
    "Sign in to {{name}}": "",
    "Username": "Nombre de usuario",
    "Password": "Contraseña",
    "Sign In": "Iniciar sesión",
    "Forgot your password?": "",
    "A web-based interface for Snapmaker based 3D Printing, laser engraving and CNC carving.": "",
    "Learn more": "Más información",
    "Downloads": "Descargas",
    "Report an issue": "Señalar un problema",
    "Checking for updates...": "Buscando actualizaciones...",
    "A new version of {{name}} is available": "Hay una nueva versión de {{name}}",
    "Version {{version}}": "Versión {{version}}",
    "Latest version": "Versión más reciente",
    "You already have the newest version of {{name}}": "Ya tiene la versión más reciente de {{name}}",
    "Account": "Cuenta",
    "New": "",
    "Account status": "",
    "Confirm Password": "",
    "Cancel": "Cancelar",
    "OK": "",
    "An unexpected error has occurred.": "",
    "Loading...": "Cargando...",
    "No data to display": "",
    "Enabled": "Activada",
    "Disabled": "Desactivada",
    "Date Modified": "",
    "Action": "Acción",
    "Edit Account": "",
    "Delete Account": "",
    "Settings": "Configuración",
    "My Account": "",
    "Are you sure you want to delete the account?": "",
    "Update": "",
    "Old Password": "",
    "Change Password": "",
    "New Password": "",
    "Commands": "",
    "Title": "",
    "and more...": "",
    "Delete": "Eliminar",
    "Are you sure you want to delete this item?": "",
    "Events": "",
    "Event": "",
    "Choose an event": "",
    "Startup (System only)": "",
    "Open a serial port (System only)": "",
    "Close a serial port (System only)": "",
    "G-code: Load": "",
    "G-code: Unload": "",
    "G-code: Start": "",
    "G-code: Stop": "",
    "G-code: Pause": "",
    "G-code: Resume": "",
    "Feed Hold": "",
    "Cycle Start": "",
    "Homing": "",
    "Sleep": "Suspensión",
    "Trigger": "",
    "Choose an trigger": "",
    "System": "",
    "G-code": "",
    "Startup": "",
    "Open a serial port": "",
    "Close a serial port": "",
    "Automatically check for updates": "",
    "Language": "Idioma",
    "Save Changes": "Guardar cambios",
    "General": "General",
    "Workspace": "Espacio de trabajo",
    "About": "Acerca de",
    "Restore Defaults": "Restaurar predeterminadas",
    "Are you sure you want to restore the default settings?": "",
    "The account name is already being used. Choose another name.": "",
    "Passwords do not match.": "Contraseñas no coinciden.",
    "3D Printing G-code Generator": "",
    "Laser G-code Generator": "",
    "CNC G-code Generator": "",
    "Fork Widget": "",
    "Are you sure you want to fork this widget?": "",
    "Remove Widget": "",
    "Are you sure you want to remove this widget?": "",
    "On": "Activado",
    "Off": "Desactivado",
    "Visualizer Widget": "",
    "This widget visualizes a G-code file and simulates the tool path.": "",
    "Connection Widget": "",
    "This widget lets you establish a connection to a serial port.": "",
    "Console Widget": "",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "",
    "Grbl Widget": "",
    "This widget can view Grbl state and settings.": "",
    "Marlin Widget": "",
    "This widget can view Marlin state and settings.": "",
    "Smoothie Widget": "",
    "This widget can view Smoothie state and settings.": "",
    "TinyG Widget": "",
    "This widget can view TinyG state and settings.": "",
    "Axes Widget": "",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "",
    "G-code Widget": "",
    "This widget shows the current status of G-code commands.": "",
    "Laser Widget": "",
    "This widget allows you control laser intensity and turn the laser on/off.": "",
    "Webcam Widget": "",
    "This widget lets you monitor a webcam.": "",
    "Widgets": "",
    "Server has stopped working": "",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "",
    "Drop G-code file here": "",
    "Close": "Cerrar",
    "This field is required.": "",
    "Passwords should be equal.": "",
    "mm": "",
    "in": "",
    "Axis": "",
    "Work Position": "",
    "Go To Work Zero On X Axis (G0 X0)": "",
    "Zero Out Temporary X Axis (G92 X0)": "",
    "Go To Work Zero On Y Axis (G0 Y0)": "",
    "Zero Out Temporary Y Axis (G92 Y0)": "",
    "Go To Work Zero On Z Axis (G0 Z0)": "",
    "Zero Out Temporary Z Axis (G92 Z0)": "",
    "Axes": "",
    "Keypad jogging": "",
    "Expand": "",
    "Collapse": "",
    "More": "Más",
    "Enter Full Screen": "",
    "Exit Full Screen": "",
    "User Defined": "Definido por el usuario",
    "Custom distance for every move operation": "",
    "Increase custom distance by one unit": "",
    "Decrease custom distance by one unit": "",
    "Move X- Y+": "",
    "Move Y+": "",
    "Move X+ Y+": "",
    "Move Z+": "",
    "Move X-": "",
    "Move To XY Zero (G0 X0 Y0)": "",
    "Move X+": "",
    "Move To Z Zero (G0 Z0)": "",
    "Move X- Y-": "",
    "Move Y-": "",
    "Move X+ Y-": "",
    "Move Z-": "",
    "Right": "",
    "Left": "",
    "Up": "",
    "Down": "",
    "Page Up": "",
    "Page Down": "",
    "0.1x Move": "",
    "Alt": "",
    "10x Move": "",
    "⇧ Shift": "",
    "Run Boundary": "",
    "Click to check the boundary of the image to be engraved.": "",
    "Go To Work Origin": "",
    "Move the head to the last saved work origin.": "",
    "Set Work Origin": "",
    "Set the current position of the head as the work origin.": "",
    "Shuttle Settings": "",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "",
    "Repeat Rate: {{hertz}}Hz": "",
    "60 Times per Second": "",
    "45 Times per Second": "",
    "30 Times per Second": "",
    "15 Times per Second": "",
    "10 Times per Second": "",
    "5 Times per Second": "",
    "2 Times per Second": "",
    "Once Every Second": "",
    "Distance Overshoot: {{overshoot}}x": "",
    "Determines how fast the tool moves when it’s not carving.": "",
    "Determines how fast the tool moves on the meterial.": "",
    "Determines how fast the tool feeds into the material.": "",
    "Generate G-code": "",
    "Output": "",
    "Load G-code to Workspace": "",
    "Export G-code to file": "",
    "Carving Path": "",
    "Carve Path": "",
    "Select a carve path:": "",
    "Carve along the contour of the image.": "",
    "Carve along the shape of the image.": "",
    "Outline": "",
    "On the Path": "",
    "Choose carve path": "",
    "Resolution": "",
    "The detected resolution of the loaded image.": "",
    "Size (mm)": "",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "",
    "Step Down": "",
    "Enter the depth of each carving step.": "",
    "Jog Height": "",
    "The distance between the tool and the material when it’s not carving.": "",
    "The distance between the tool and the material when the machine stops.": "",
    "Alignment": "",
    "Alignment of generated G-code.": "",
    "None": "",
    "Clip to axes": "",
    "Align center to origin": "",
    "Tab Height": "",
    "Enter the height of the tabs.": "",
    "Tab Space": "",
    "Enter the space between any two tabs.": "",
    "Tab Width": "",
    "Enter the width of the tabs.": "",
    "Preview": "",
    "Carving Tool": "",
    "Carving V-Bit": "",
    "Flat End Mill": "",
    "Ball End Mill": "",
    "Use Other Bit": "",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "",
    "For the carving bits that we provide, please enter the following value:": "",
    "Point Angle": "",
    "Enter the angle of the blade.": "",
    "fullscreen": "",
    "Manufacturer: {{manufacturer}}": "",
    "Port": "",
    "No ports available": "",
    "Choose a port": "",
    "Refresh": "Actualizar",
    "Open": "Abrir",
    "Error opening serial port '{{- port}}'": "",
    "Connection": "",
    "No serial connection": "",
    "Connected to {{-port}}": "",
    "Console": "",
    "Clear all": "",
    "Min": "",
    "Max": "",
    "Dimension": "",
    "Sent": "",
    "Received": "",
    "Start Time": "",
    "Elapsed Time": "",
    "Finish Time": "",
    "Remaining Time": "",
    "Laser": "",
    "Laser On": "",
    "Laser Off": "",
    "Save (SD Card)": "",
    "Hide": "Ocultar",
    "Show": "Mostrar",
    "Laser Test": "",
    "Power (%)": "",
    "Test duration": "",
    "ms": "",
    "Maximum value": "",
    "Determines how fast the machine moves when it’s not engraving.": "",
    "Determines how fast the machine moves when it’s engraving.": "",
    "Dwell Time": "",
    "Determines how long the laser keeps on when it’s engraving a dot.": "",
    "B&W": "",
    "Set the proportion of the black color based on the original color of the image.": "",
    "Line Direction": "",
    "Select the direction of the engraving path.": "",
    "Horizontal": "",
    "Vertical": "",
    "Diagonal": "",
    "Diagonal2": "",
    "Choose an algorithm": "",
    "Density": "",
    "Contrast": "",
    "The difference between the lightest color and the darkest color.": "",
    "Brightness": "",
    "The engraved picture is brighter when this value is bigger.": "",
    "White Clip": "",
    "Set the threshold to turn the color that is not pure white into pure white.": "",
    "Algorithm": "",
    "Choose an algorithm for image processing.": "",
    "Preview Settings": "",
    "(default image)": "",
    "Parse Image Error": "",
    "Failed to parse image file {{}}": "",
    "GREYSCALE": "",
    "VECTOR": "",
    "TEXT": "",
    "Source Type": "",
    "Raster": "",
    "SVG": "",
    "Upload Image": "",
    "Middle": "",
    "Center": "",
    "Bottom Left": "",
    "Bottom Middle": "",
    "Bottom Right": "",
    "Top Left": "",
    "Top Middle": "",
    "Top Right": "",
    "Text": "",
    "Font": "",
    "Select a word font.": "",
    "Choose font": "",
    "Enter the font size in pt (points).": "",
    "Line Height": "",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "",
    "Align the text in different lines to either the left or right or in the center horizontally.": "",
    "Anchor": "",
    "Find the anchor of the text to correspond to the (0, 0) coordinate.": "",
    "Impurity Size": "",
    "Determines the minimum size of impurity which allows to be showed.": "",
    "Invert": "",
    "Inverts black to white and vise versa.": "",
    "Optimize Path": "",
    "Optimizes the path based on the proximity of the lines in the image.": "",
    "Fine Tune Work Origin": "",
    "How Fine Tune Work Origin Works": "",
    "Click": "",
    "Focus": "",
    "and use": "",
    "Jog Pad": "",
    "Generate and Load G-code": "",
    "and the G-code is automatically generated and loaded.": "",
    "to start laser cutting.": "",
    "Determines how fast the machine moves when it’s working.": "",
    "Power": "",
    "Power to use when laser is working.": "",
    "Enable 3D View": "",
    "Disable 3D View": "",
    "Hide Coordinate System": "",
    "Show Coordinate System": "",
    "File folder": "Carpeta de archivos",
    "{{extname}} File": "Archivo {{extname}}",
    "File": "Archivo",
    "3D rendering": "Renderización en 3D",
    "Reset Position": "",
    "Zoom In": "",
    "Zoom Out": "",
    "Controller State": "",
    "Controller Settings": "",
    "3D Printer": "",
    "CNC": "",
    "Set": "",
    "Save": "",
    "F": "",
    "Adjust feedrate percentage, which applies to moves along all axis.": "",
    "Nozzle Temperature": "",
    "Bed Temperature": "",
    "Tool Head Power": "",
    "ON": "",
    "OFF": "",
    "Quality": "Calidad",
    "Shell": "Perímetro",
    "Infill": "Relleno",
    "Speed": "Velocidad",
    "Retract & Z Hop": "",
    "Surface": "Superficie",
    "Recommended": "",
    "Customize": "",
    "Fast Print": "",
    "Normal Quality": "",
    "High Quality": "",
    "Show Details": "",
    "Profile": "",
    "Printing Settings": "",
    "Material & Support": "",
    "Custom Material": "",
    "Adhesion": "Adherencia",
    "Support": "Soporte",
    "Touch Building Plate": "",
    "Everywhere": "",
    "Slicing {{progress}}%": "",
    "Slice error: ": "",
    "Parsing G-code...": "",
    "Loading model...": "",
    "Pre-processing model...": "",
    "Preparing for slicing...": "",
    "Upload File": "",
    "G-code not loaded": "",
    "Projection": "",
    "Perspective Projection": "",
    "Orthographic Projection": "",
    "Scene Objects": "",
    "Display G-code Filename": "",
    "Hide Toolhead": "",
    "Show Toolhead": "",
    "3D rendering...": "",
    "Move the camera": "",
    "Rotate the camera": "",
    "Watch Directory": "",
    "Name": "Nombre",
    "Date modified": "Fecha de modificación",
    "Type": "Tipo",
    "Load G-code": "",
    "Upload G-code": "",
    "Run": "Ejecutar",
    "Pause": "Pausar",
    "Stop": "Parar",
    "Webcam": "",
    "Edit": "Editar",
    "Enable": "Activar",
    "Disable": "Desactivar",
    "Webcam Settings": "",
    "Media Source": "",
    "Use a built-in camera or a connected webcam": "",
    "Use a M-JPEG stream over HTTP": "",
    "Webcam is off": "",
    "Rotate Left": "",
    "Rotate Right": "",
    "Flip Horizontally": "",
    "Flip Vertically": "",
    "Crosshair": "",
    "Note: If you are using the CNC Carving Module, make sure the carving bit will not run into the fixtures before you use this feature.": "",
    "Select the type of the image you want to upload. Raster supports PNG and JPEG images, while SVG only supports SVG images. The Raster images will be transferred into SVG automatically.": "",
    "Enter the text you want to engrave. The maximum length of the text is 125 mm. When the text is too long, it will be shrunk automatically. Start a new line manually according to your needs.": "",
    "Setting work origin is essentially finding the best place for the engraved image in the X and Y directions and determining the distance (Z Offset) between the Engraving & Carving Platform and the Laser Module to acquire the smallest laser dot on the material for the most efficient use of the laser power and the best result. For the 200mW Laser Engraving Module, the Z Offset can be set by judging the size of the laser dot by eyes with low power. However, for the 1600mW Laser Cutting Module, this method is less accurate as the laser dot is too strong and less interpretable. To set the Z Offset more accurately, we can move the module to the position that is close to the optimal Z Offset (Offset A). The software will test the results from a few positions next to Offset A on the same material. The best result determines the best Z Offset.": "",
    "in the Axes section to move the Laser Cutting Module to the position that is close to the optimal Z Offset (just like how you do with the 200mW Laser Engraving Module).": "",
    "Set Work Speed and Power based on the material you are using. If you are using a piece of 1.5 mm wood sheet, it’s recommended to set the Work Speed to a value between 80 mm/s and 120 mm/s and set the Power to 100%.": "",
    "Choose the position that can cut the material the most smoothly or engrave the thinnest line and the software will set it as Z Offset. In this example, -2.0 should be the Z Offset.": "",
    "Parse File Error": "",
    "Failed to parse image file {{filename}}": "",
    "Tool Head Status (M3)": "",
    "Skirt": "",
    "Brim": "",
    "Raft": "",
    "Normal": "",
    "Both": "",
    "Warning": "",
    "Slicing completed.": "",
    "Parsed G-code successfully.": "",
    "Failed to parse G-code: ": "",
    "Loaded model successfully.": "",
    "Failed to load model.": "",
    "Rendered G-code successfully.": "",
    "Tabs": ""
}
