{
    "Diameter": "Діаметр",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "Регулює діаметр використовуваної нитки. Зіставте це значення з діаметром використовуваної нитки.",
    "Has Heated Heated Bed": "Має платформу з підігрівом",
    "Whether the machine has a heated heated bed present.": "Чи є в пристрої платформа з підігрівом.",
    "Layer Height": "Висота шару",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "Висота кожного шару в мм. Вищі значення призводять до  швидшого друку з меншою роздільною здатністю, нижчі значення призводять до повільнішого друку з більшою роздільною здатністю.",
    "Initial Layer Height": "Висота першого шару",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the heated bed easier.": "Висота першого шару. Товстіший перший шар покращує зчеплення з платформою.",
    "Initial Layer Line Width": "Ширина лінії першого шару",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "Множник ширини лінії на першому шарі. Підвищення цього може поліпшити зчеплення з платформою.",
    "Wall Thickness": "Товщина стінки",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "Товщина стінок у горизонтальному напрямку. Це значення, розділене на ширину лінії стінки, визначає кількість стінок.",
    "Top Thickness": "Верхня товщина",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "Товщина верхніх шарів. Це значення, розділене на висоту шару, визначає кількість верхніх шарів.",
    "Bottom Thickness": "Нижня товщина",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "Товщина нижніх шарів. Це значення, розділене на висоту шару, визначає кількість нижніх шарів.",
    "Outer Before Inner Walls": "Зміщення перед внутрішніми стінками",
    "Prints walls in order of outside to inside when enabled. This can help improve dimensional accuracy in X and Y when using a high viscosity plastic like ABS; however it can decrease outer surface print quality, especially on overhangs.": "Якщо включено, друкує стінки в порядку від зовнішніх до внутрішніх. Це може допомогти підвищити точність розмірів у по осях X та Y при використанні пластику з високою в'язкістю, як ABS, однак це може знизити якість друку на зовнішній поверхні, особливо на навісах.",
    "Infill Density": "Щільність заповнення",
    "Adjusts the density of infill of the print.": "Регулює щільність заповнення друку.",
    "Printing Temperature": "Температура друку",
    "The temperature used for printing.": "Температура друку.",
    "Printing Temperature Initial Layer": "Температура друку першого шару",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "Температура друку першого шару. Встановіть 0, щоб відключити спеціальну обробку першого шару.",
    "Final Printing Temperature": "Кінцева температура друку",
    "The temperature to which to already start cooling down just before the end of printing.": "Температура, до якої почати охолоджуватись безпосередньо перед закінченням друку.",
    "Heated Bed Temperature": "Температура платформи",
    "The temperature used for the heated heated bed. If this is 0, the bed temperature will not be adjusted.": "Температура платформи з підігрівом. Якщо значення 0, температура платформ не буде встановлюватись.",
    "Heated Bed Temperature Initial Layer": "Температура платформи для першого шару",
    "The temperature used for the heated heated bed at the first layer.": "Температура платформи з підігрівом на першому шарі.",
    "Flow": "Потік",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "Компенсація потоку: кількість екструдованого матеріалу множиться на це значення.",
    "Enable Retraction": "Увімкнути ретракцію",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "",
    "Retract at Layer Change": "Втягувати при зміні шару",
    "Retract the filament when the nozzle is moving to the next layer.": "Втягувати ектрузію, при русі сопла до наступного шару.",
    "Retraction Distance": "Відстань втягування",
    "The length of material retracted during a retraction move.": "Довжина матеріалу, що втягується під час руху втягування.",
    "Retraction Speed": "Швиткість втягування",
    "The speed at which the filament is retracted and primed during a retraction move.": "Швидкість втягування та виходу нитки під час руху втягування.",
    "Print Speed": "Швидкість друку",
    "The speed at which printing happens.": "Швидкість друку.",
    "Infill Speed": "Швидкість заповнення",
    "The speed at which infill is printed.": "Швидкість друку заповнення.",
    "Outer Wall Speed": "Швидкість для зовнішніх стінок",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "Швидкість друку зовнішніх стінок. Друк зовнішніх стінок з меншою швидкістю покращує кінцеву якість поверхні. Однак велика різниця між швидкостями друку внутрішніх та зовнішніх стінок вплине на якість негативно.",
    "Inner Wall Speed": "Швидкіть на внутрішніх стінках",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "Швидкість, з якою друкуються всі внутрішні стінки. Друк внутрішньої стіни швидше, ніж зовнішня, скоротить час друку. Рекомендовано встановлювати цю швидкість в межах між швидкостями друку зовнішніх стінок та заповнення.",
    "Top/Bottom Speed": "Швидкість зверху/знизу",
    "The speed at which top/bottom layers are printed.": "Швидкість друку верхніх/нижніх шарів.",
    "Travel Speed": "Швидкість проходу",
    "The speed at which travel moves are made.": "Швидкість рухів переміщення.",
    "Initial Layer Print Speed": "Швидкість друку першого шару",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the heated bed.": "Швидкість друку першого шару. Для покращення зчеплення з платформою рекомендується нижчі значення.",
    "Initial Layer Travel Speed": "Швидкість переміщення на першому шарі",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the heated bed. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "Швидкість руху рухається в початковому шарі. Рекомендується нижнє значення, щоб запобігти відставанню раніше надрукованих деталей від платформи. Значення цього параметра можна автоматично обчислити з співвідношення між швидкостями переміщення та друку.",
    "Z Hop When Retracted": "Підняття осі Z при втягувані",
    "Whenever a retraction is done, the heated bed is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the heated bed.": "Кожного разу, при втягуванні, вісь Z підіймається, щоб створити проміжок між соплом і друком. Це запобігає торканням сопла друку при переміщенні, зменшуючи ймовірність вибивання друку з платформи.",
    "Z Hop Height": "Висота підняття осі Z",
    "The height difference when performing a Z Hop.": "Перепад висот при виконанні підняття осі Z.",
    "Generate Support": "Створити опори підтримки",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "Створіть опори для підтримки частин моделі, які мають нависання. Без цих опор такі частини руйнуються під час друку.",
    "Support Placement": "Розміщення підтримки",
    "Adjusts the placement of the support structures. The placement can be set to touching heated bed or everywhere. When set to everywhere the support structures will also be printed on the model.": "Регулює діаметр використовуваної нитки. Зіставте це значення з діаметром використовуваної нитки.",
    "Touching Buildplate": "Торкання платформи",
    "Everywhere": "Скрізь",
    "Support Overhang Angle": "Кут нахилу нависань підтримки",
    "The minimum angle of overhangs for which support is added. At a value of 0° all overhangs are supported, 90° will not provide any support.": "Мінімальний кут нависання, для якого додається підтримка. При значенні 0 ° підтримуються всі нависання, 90 ° не підтримуються жодні.",
    "Support Pattern": "Шаблон підтримки",
    "The pattern of the support structures of the print. The different options available result in sturdy or easy to remove support.": "Шаблон опорних структур підтримки друку. Різні доступні варіанти дають різні результати щодо надійності та простоти видалення підтримки.",
    "Lines": "Лінії",
    "Grid": "Сітка",
    "Triangles": "Трикутники",
    "Concentric": "Концентричний",
    "Zig Zag": "Зіг Заг",
    "Cross": "Хрест",
    "Support Density": "Щільність підтримки",
    "Adjusts the density of the support structure. A higher value results in better overhangs, but the supports are harder to remove.": "Регулює щільність опорної конструкції. Більше значення призводить до кращих нависів, але опори важче зняти.",
    "Heated Bed Adhesion Type": "Тип зчеплення палатформи",
    "Different options that help to improve both priming your extrusion and adhesion to the heated bed. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "Різні варіанти, які допомагають покращити як грунтовку  екструзії, так і зчеплення платформою. Край додає одношарову рівну площу навколо основи вашої моделі, щоб запобігти викривлення. Пліт додає густу сітку з лощиною під моделлю. Спідниця - це лінія, надрукована навколо моделі, але не пов'язана з моделлю.",
    "Skirt": "Спідниця",
    "Brim": "Край",
    "Raft": "Пліт",
    "None": "Жоден",
    "Skirt Line Count": "Кількість ліній спідниці",
    "Multiple skirt lines help to prime your extrusion better for small models. Setting this to 0 will disable the skirt.": "Кілька ліній спідниці допомагають краще підготувати екструзію для маленьких моделей. Якщо встановити це значення 0, спідниця вимкнеться.",
    "Brim Line Count": "Кількість ліній краю",
    "The number of lines used for a brim. More brim lines enhance adhesion to the heated bed, but also reduces the effective print area.": "Кількість ліній, що використовуються для краю. Більше ліній краю посилює зчеплення з платформою, але зменшує ефективну площу друку.",
    "Raft Extra Margin": "Додатковий відступ плоту",
    "If the raft is enabled, this is the extra raft area around the model which is also given a raft. Increasing this margin will create a stronger raft while using more material and leaving less area for your print.": "Додаткова площа плоту навколо моделі. Збільшення цього поля дозволить створити більш міцний пліт та призведе до більшого використання матеріалів  і залишить менше площі для друку.",
    "Surface Mode": "Поверхневий режим",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "Розглядайте модель лише як поверхню, об'єм або об'єм з дірявими поверхнями. У нормальному режимі друку друкуються лише закриті об’єми. \"Поверхня\" друкує єдину стінку, без заповнення та без верхніх/нижніх шарів. \"Обидва\" друкують закриті об’єми , як звичайні, а будь-які інші багатокутники як поверхні.",
    "Normal": "Нормальний",
    "Surface": "Поверхня",
    "Both": "І те й інше",
    "Spiralize Outer Contour": "Спіралізувати зовнішній контур",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "Спіралізація згладжує хід Z зовнішнього краю. Це створить стабільне збільшення Z на весь друк. Ця функція перетворює суцільну модель на одностінний об’єкт з міцним дном. Ця функція повинна бути включена лише тоді, коли кожен шар містить лише одну частину.",
    "Cancel": "Скасувати",
    "Confirm": "Підтвердіть",
    "Records: {{from}} - {{to}} / {{total}}": "Записи: {{from}} - {{to}} / {{total}}",
    "Records: {{total}}": "Записи: {{total}}",
    "{{pageLength}} per page": "{{pageLength}} на сторінку",
    "fullscreen": "повноекранний",
    "Enter Full Screen": "На повний екран",
    "Exit Full Screen": "Вихід із повного екрану",
    "Remove Widget": "Видалити віджет",
    "Expand": "Розгорнути",
    "Collapse": "Згорнути",
    "Fast Print": "Швидкий друк",
    "Warning": "Увага",
    "This is an alpha feature that helps you get started with CNC Carving. Make sure you": "Це альфа-функція, яка дозволяє розпочати роботу з різьбленням з ЧПУ. Переконайтесь, що ви",
    "Read This First - Safety Information": "Прочитайте спочатку це - Інформація про безпеку",
    "before any further instructions.": "до подалших інструкцій.",
    "Don't show again in current session": "Не показувати знову в поточному сесії",
    "Only {{accept}} files are supported.": "Підтримуються лише файли {{accept}}.",
    "Drop an image file here.": "Завантажте сюди файл зображення.",
    "Size": "Розмір",
    "Work Speed": "Робоча швидкість",
    "Plunge Speed": "Швидкість занурення",
    "Jog Speed": "Швидкість бігунка",
    "Grey Level": "Рівень сірого",
    "Target Depth": "Глубина цілі",
    "Cutting Diameter": "Діаметр різання",
    "Stop Height": "Висота зупинки",
    "Auto": "Авто",
    "Manual": "Посібник",
    "Exit": "Вихід",
    "Save": "Зберегти",
    "Margin": "Поле",
    "Set": "Встановити",
    "CNC": "ЧПУ",
    "current RPM": "поточні об/хв",
    "On": "На",
    "Off": "Вимк.",
    "Set Origin": "Встановити область",
    "Protocol Type": "Тип протоколу",
    "Text": "Текст",
    "Screen": "Екран",
    "Switch": "Вимикач",
    "Flush": "Flush",
    "Basic": "Основні",
    "Length": "Довжина",
    "Filter": "Фільтр",
    "Message Filter": "Фільтр повідомлень",
    "Clear": "Очистити",
    "Show Hex": "Показати шестикутник",
    "Calibration": "Калібрування",
    "G-code": "G-код",
    "Update": "Оновлення",
    "Setting": "Налаштування",
    "Laser": "Лазер",
    "Lamp": "Лампа",
    "Failed to upload file": "Не вдалося завантажити файл",
    "Update Finished": "Оновлення завершено",
    "The firmware is updated successfully. The calibration data will be reset. For the module update, it may take about one minute to restart the machine. Please wait until the machine is restarted. ": "",
    "Update Firmware": "Оновіть прошивку",
    "Packet Type for Raw Update": "Тип пакету для оновлення",
    "Main Controller": "Основний контролер",
    "Modules": "Модулі",
    "Upload": "Завантажити",
    "Raw Update": "Сире оновлення",
    "Version": "Версія",
    "Update Filename": "Оновіть ім’я файлу",
    "Firmware Version": "Версія прошивки",
    "G-code File": "Файл G-коду",
    "Export": "Експорт",
    "Extruder": "Екструдер",
    "Set the target temperature of the nozzle in real-time.": "Встановлюйте температуру сопла в режимі реального часу.",
    "Bed": "Платформа",
    "Heated Bed": "Платформа з підігрівом",
    "Set the target temperature of the heated bed in real-time.": "Встановлюйте температуру платформи з підігрівом в режимі реального часу.",
    "Light Bar": "Смужка світла",
    "Get Status": "Отримати статус",
    "Switch Light": "Перемкнути світло",
    "Status": "Статус",
    "Light": "Світло",
    "Current Power": "Поточна потужність",
    "Set Power": "Встановити потужність",
    "Get Z Focus": "Отримати фокус Z",
    "Set Z Focus": "Встановити фокус по осі Z",
    "Draw Bound": "Намалювати межу",
    "Draw Ruler": "Намалювати лінійку",
    "Enter Set Focus": "Встановити фокус",
    "Relative coordinates": "Відносні координати",
    "Absolute coordinates": "Абсолютні координати",
    "Move Require": "Необхідне переміщення",
    "Machine Settings": "Налаштування пристрою",
    "Offset": "Зміщення",
    "Direction": "Напрямок",
    "Home Location": "Початкова позиція",
    "Default": "За замовчуванням",
    "Reverse": "Зворотній",
    "Zero": "Нуль",
    "Max": "Макс",
    "New Update Available": "Доступне нове оновлення",
    "More": "Більше",
    "Store": "Магазин",
    "Downloads": "Завантаження",
    "Process": "",
    "Reload": "Перезавантажити",
    "Reset": "Скинути",
    "User Manual & FAQ": "Посібник користувача та поширені запитання",
    "Forum": "Форум",
    "Failed to open model.": "",
    "Only STL/OBJ files are supported.": "Підтримуються лише файли STL / OBJ.",
    "Drop an STL/OBJ file here.": "Скиньте сюди файл STL / OBJ.",
    "A web-based interface for Snapmaker which is able to do 3D Printing, laser engraving and CNC carving.": "Веб-інтерфейс для Snapmaker, який здатний робити 3D друк, лазерне гравірування та різьблення з ЧПУ.",
    "Learn more": "Дізнатись більше",
    "Language": "Мова",
    "Save Changes": "Зберегти зміни",
    "Machine": "Пристрій",
    "- Please Select -": "- Зробіть вибір -",
    "X (Width)": "X (ширина)",
    "Y (Depth)": "Y (глибина)",
    "Z (Height)": "Z (висота)",
    "Enclosure": "Захисний екран",
    "Door Detection": "",
    "Door detection": "Виявлення дверей",
    "Connection": "З'єднання",
    "Wait Time": "",
    "3s": "",
    "15s": "",
    "30s": "",
    "General": "Загальні",
    "Config": "Налаштування",
    "Restore Defaults": "Відновити значення за замовчуванням",
    "Are you sure you want to restore the default settings?": "Ви впевнені, що хочете відновити налаштування за замовчуванням?",
    "Settings": "Налаштування",
    "Workspace": "Робочий простір",
    "3D Printing G-code Generator": "Генератор G-коду 3D друку",
    "Laser G-code Generator": "Генератор  G-коду лазера",
    "CNC G-code Generator": "Генератор G-коду ЧПУ",
    "DevelopTools": "DevelopTools",
    "Case Library": "Бібліотека справ",
    "Are you sure you want to remove this widget?": "Ви впевнені, що хочете видалити цей віджет?",
    "OK": "Добре",
    "Only G-code files are supported": "Підтримуються лише файли G-коду",
    "Server has stopped working": "Сервер перестав працювати",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "Проблема призвела до того, що сервер перестав працювати належним чином. Перевірте стан сервера і повторіть спробу.",
    "Drop a G-code file here.": "Скиньте сюди файл G-коду.",
    "Failed to rename. Please enter a new name.": "Не вдалося перейменувати. Введіть нову назву.",
    "Failed to rename. \"{{name}}\" already exists.": "Не вдалося перейменувати. \"{{name}}\" вже існує.",
    "Yes": "Так",
    "Close": "Закрити",
    "This field is required.": "Це поле є обов'язковим.",
    "Passwords should be equal.": "Паролі повинні збігатись.",
    "Device Not Recognized": "",
    "Oops, Snapmaker Luban doesn't recognize your connected device.": "",
    "Which model is connected to Snapmaker Luban?": "",
    "Which toolhead is attached to your Snapmaker Luban?": "",
    "Choose": "",
    "Enable 3D View": "Увімкнути 3D-перегляд",
    "Disable 3D View": "Вимкнути 3D-перегляд",
    "Reset Position": "Скинути положення",
    "Zoom In": "Збільшити",
    "Zoom Out": "Зменшити",
    "Featured Projects": "Рекомендовані проекти",
    "by Snapmaker": "від Snapmaker",
    "load": "навантаження",
    "Working Parameters": "Робочі параметри",
    "Print Order": "Черга друку",
    "When engraving multiple images, this parameter determines the print order of the selected image. When the orders are the same, the image uploaded first will be engraved first.": "Під час гравірування декількох зображень цей параметр визначає черговість гравірування обраного зображення. Якщо черговості збігаються, зображення, завантажене першим, буде вигравіровано першим.",
    "Dwell Time": "Час затримки",
    "Multi-pass": "Багатопрохідний",
    "When enabled, the printer will run the G-code multiple times automatically according to the below settings. This feature helps you cut materials that can't be cut with only one pass.": "Якщо ввімкнено, пристрій автоматично запустить G-код кілька разів відповідно до наведених нижче параметрів. Ця функція допомагає прорізати матеріали, які не можна прозрізати лише одним проходом.",
    "Passes": "Проходить",
    "Determines how many times the printer will run the G-code automatically.": "Визначає, скільки разів пристрій автоматично запустить G-код.",
    "Pass Depth": "Глиьина проходу",
    "Determines how much the laser module will be lowered after each pass.": "Визначає, наскільки лазерний модуль буде опущений після кожного проходу.",
    "Fixed Power": "Фіксована потужність",
    "When enabled, the power used to engrave this image will be set in the G-code, so it is not affected by the power you set in Workspace. When engraving multiple images, you can set the power for each image separately.": "Якщо ввімкнено, потужність, яка використовується для гравіювання цього зображення, буде встановлена",
    "Power": "Потужність",
    "Power to use when laser is working.": "Потужність, яка використовується під час роботи лазера.",
    "Power (%)": "Потужність (%)",
    "Image Trace": "Слід зображення",
    "Black": "Чорний",
    "Adjust the black trace.": "Налаштуйте чорний слід.",
    "Foreground": "Передній план",
    "Adjust the foreground.": "Відрегулюйте передній план.",
    "Dilation": "Розширення",
    "Dilate the foreground mask gradually. Bigger values cost more time.": "Розширює маску переднього плану поступово. Більші значення призводять до збільшення часу.",
    "Color Range": "Колірна гамма",
    "Adjust the color range of each trace.": "Відрегулюйте колірну гамму кожного сліду.",
    "Objects": "Об'єкти",
    "The number of the output objects.": "Кількість вихідних об'єктів.",
    "Status: {{status}}": "Статус: {{status}}",
    "Upload As": "Завантажити як",
    "B&W": "Ч/Б",
    "GREYSCALE": "Відтінки сірого",
    "VECTOR": "ВЕКТОР",
    "Upload the selected images.": "Завантажити вибрані зображення.",
    "UPLOAD": "ЗАВАНТАЖИТИ",
    "Enter the text you want to engrave. The maximum length of the text is 125 mm. When the text is too long, it will be shrunk automatically. Start a new line manually according to your needs.": "Введіть текст, який ви хочете вигравірувати. Максимальна довжина тексту - 125 мм. Коли текст буде занадто довгим, він автоматично скорочується. Почніть новий рядок вручну відповідно до ваших потреб.",
    "Font": "Шрифт",
    "Choose font": "Виберіть шрифт",
    "Font Size": "Розмір шрифту",
    "Enter the font size in pt (points).": "Введіть розмір шрифту в pt (пункти).",
    "Line Height": "Висота лінії",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "Встановіть відстань між кожним рядком у тексті. Введене значення - кратне розміру шрифту.",
    "Alignment": "Вирівнювання",
    "Align the text in different lines to either the left or right or in the center horizontally.": "Вирівняйте текст у різних рядках ліворуч, праворуч або по центру по горизонталі.",
    "Left": "Наліво",
    "Right": "Направо",
    "Transformation": "Трансформація",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "Введіть розмір гравірованого зображення. Розмір не може бути більшим за 125 х 125 мм або розмір вашого матеріалу.",
    "Size (mm)": "Розмір (мм)",
    "Rotate": "Обертати",
    "Rotate the image to the angle you need.": "Поверніть зображення на потрібний вам кут.",
    "Vertical": "Вертикальний",
    "Horizontal": "Горизонтальний",
    "Please wait for automatic preview to complete.": "Зачекайте завершення автоматичного попереднього перегляду.",
    "Actions": "",
    "Failed to preview": "Помилка попереднього перегляду",
    "Failed to preview, please modify parameters and try again.": "Помилка попереднього перегляду, змініть параметри та повторіть спробу.",
    "Preview": "Попередній перегляд",
    "Auto Preview": "Автоперегляд",
    "When enabled, the software will show the preview automatically after the settings are changed. You can disable it if Auto Preview takes too much time.": "Якщо ввімкнено, програмне забезпечення автоматично відобразить попередній перегляд після зміни налаштувань. Ви можете відключити його, якщо автоматичний перегляд займає занадто багато часу.",
    "Generate G-code": "Створити G-код",
    "Load G-code to Workspace": "Завантажте G-код у робочий простір",
    "Configurations": "Конфігурації",
    "Determines how fast the tool moves when it’s not carving.": "Визначає, швидкість руху інструменту, під час не різбблення.",
    "Determines how fast the tool feeds into the material.": "Визначає, наскільки швидко інструмент входить в матеріал.",
    "Determines how fast the tool moves on the material.": "Визначає швидкість переміщення інструменту по матеріалу.",
    "Invert": "Перетворити",
    "Relief": "Полегшити",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "Введіть глибину різьбленого зображення. Глибина не може бути глибшою за довжину виїмки.",
    "Step Down": "Крок назад",
    "Enter the depth of each carving step.": "Введіть глибину кожного кроку різьблення.",
    "Jog Height": "Висота бігунка",
    "The distance between the tool and the material when it’s not carving.": "Відстань між модулем і матеріалом, коли він не різьблить.",
    "The distance between the tool and the material when the machine stops.": "Відстань між модулем і матеріалом, коли пристрій зупиняється.",
    "Density": "Щільність",
    "Set the density of the tool head movements. The highest density is 10 dot/mm. When generating G-code, the density will be re-calculated to ensure the process work normally.": "Встановіть щільність рухів модуля. Найвища щільність - 10 точок/мм. При генеруванні G-коду щільність буде перерахована для нормальної роботи процесу.",
    "RELIEF": "Полегшити",
    "Show Original Image": "",
    "Path": "Шлях",
    "Carve Path": "Шлях різьблення",
    "Select a carve path:": "Виберіть шлях різьблення:",
    "On the Path": "По шляху",
    "Carve along the shape of the image.": "Різьбити уздовж форми зображення.",
    "Outline": "Контур",
    "Carve along the contour of the image.": "Різьбити по контуру зображення.",
    "Fill": "Заповнення",
    "Carve away the inner of the image.": "Вирізбити внутрішню частину зображення.",
    "Choose carve path": "Виберіть шлях різьбленя",
    "Fill Density": "Щільність заповнення",
    "Set the precision at which an area is carved. The highest density is 0.05 mm (20 dot/mm). When it is set to 0, the SVG image will be carved without fill.": "Встановіть точність різьблення. Найвища точність - 0,05 мм (20 точок/мм). Якщо вона встановлена",
    "Tabs": "Вкладки",
    "Tab Height": "Висота вкладки",
    "Enter the height of the tabs.": "Введіть висоту вкладок.",
    "Tab Space": "Пробіл вкладки",
    "Enter the space between any two tabs.": "Введіть відстань між будь-якими двома вкладками.",
    "Tab Width": "Ширина вкладки",
    "Enter the width of the tabs.": "Введіть ширину вкладок.",
    "Carving Tool": "Інструмент різьбленя",
    "Flat End Mill": "Бур з плоским кінцем",
    "Ball End Mill": "Кульовий бур",
    "Use Other Bit": "Використовуйте інший бур",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "Введіть діаметр найширшої частини леза. Зверніть увагу, що це не діаметр хвостовика.",
    "For the carving bits that we provide, please enter the following value:": "Для гавірувальних бурів, які ми надаємо, введіть таке значення:",
    "Point Angle": "Точковий кут",
    "Enter the angle of the blade.": "Введіть кут леза.",
    "Generating tool path... {{progress}}%": "Створюється шлях інструменту... {{progress}}%",
    "Generated tool path successfully.": "Шлях інструменту створено успішно.",
    "Failed to generate tool path.": "",
    "Previewing tool path...": "",
    "Previewed tool path successfully": "",
    "Please preview again": "",
    "Failed to preview tool path.": "",
    "Generating G-code... {{progress}}%": "",
    "Generated G-code successfully.": "",
    "Failed to generate G-code.": "",
    "Estimated Time:": "Розрахунковий час:",
    "Duplicate Selected Model": "Дублікувати обрану модель",
    "Bring to Front": "На передній план",
    "Send to Back": "Відправити назад",
    "Reference Position": "Довідкова позиція",
    "Top Left": "Вгорі зліва",
    "Top Middle": "Вгорі посередині",
    "Top Right": "Вгорі справа",
    "Center Left": "Центр зліва",
    "Center": "Центр",
    "Center Right": "Центр зправа",
    "Bottom Left": "Знизу зліва",
    "Bottom Middle": "Знизу посередині",
    "Bottom Right": "Знизу справа",
    "Flip": "Перевернути",
    "Delete Selected Model": "Видалити обрану модель",
    "Arrange All Models": "Впорядкувати всі моделі",
    "Serial Port": "Серійний порт",
    "Wi-Fi": "Wi-Fi",
    "Home Reminder": "Початкове нагадування",
    "To continue, the machine needs to go to its home position. Homing works by moving X, Y, Z axes to the pre-defined positions, which will be used as the reference points.": "Щоб продовжити, пристрою потрібно перейти до свого початкового положення. Початкове положення визначається шляхом переміщення осей X, Y, Z у заздалегідь задані положення, які будуть використовуватися як опорні точки.",
    "Laser Focus": "Фокус лазера",
    "Nozzle Temp": "Температура сопла",
    "Heated Bed Temp": "Температура  платформи з підігрівом",
    "Manufacturer: {{manufacturer}}": "Виробник: {{manufacturer}}",
    "No ports available": "Немає доступних портів",
    "Choose a port": "Виберіть порт",
    "Refresh": "Оновити",
    "Open": "Відкрити",
    "The machine is working, disconnect will stop current print.": "Пристрій працює, відключення зупинить поточний друк.",
    "Disconnection": "Відключення",
    "Please tap Yes on Snapmaker touchscreen to confirm Wi-Fi connection.": "Натисніть Так на сенсорному екрані Snapmaker, щоб підтвердити з'єднання Wi-Fi.",
    "Screen Authorization Needed": "Потрібна авторизація екрана",
    "Connected": "Підключено",
    "Disconnected": "Відключено",
    "Error": "Помилка",
    "No machines detected.": "Не виявлено пристроїв.",
    "Choose a machine": "Виберіть прилад",
    "Connected to {{-port}}": "Підключено до {{-port}}",
    "Connected via Wi-Fi": "Підключено через Wi-Fi",
    "Console": "Консоль",
    "Clear All": "Очистити все",
    "Control": "Контроль",
    "Keyboard Shortcuts": "Гарячі клавіши",
    "Home": "Home",
    "mm": "мм",
    "in": "дюйм",
    "Axis": "Вісь",
    "Machine Coordinates": "Координати пристрою",
    "Work Coordinates": "Координати роботи",
    "Action": "Дія",
    "Go To Work Zero On X Axis (G0 X0)": "Перейти на робочий нуль на осі X (G0 X0)",
    "Zero Out Temporary X Axis (G92 X0)": "Тимчасово обнулити вісь X (G92 X0)",
    "Go To Work Zero On Y Axis (G0 Y0)": "Перейти на робочий нуль на осі Y (G0 Y0)",
    "Zero Out Temporary Y Axis (G92 Y0)": "Тимчасово обнулити вісь Y (G92 Y0)",
    "Go To Work Zero On Z Axis (G0 Z0)": "Перейти на робочий нуль на осі Z (G0 Z0)",
    "Zero Out Temporary Z Axis (G92 Z0)": "Тимчасово обнулити вісь Z (G92 Z0)",
    "User Defined": "Визначений користувачем",
    "Custom distance for every move operation": "Налаштована відстань для кожної операції переміщення",
    "Increase custom distance by one unit": "Збільште власну відстань на одну одиницю",
    "Decrease custom distance by one unit": "Зменшіть власну відстань на одну одиницю",
    "Move X- Y+": "Рух X-Y +",
    "Move Y+": "Рух Y +",
    "Move X+ Y+": "Рух X + Y +",
    "Move Z+": "Рух Z +",
    "Move X-": "Рух X-",
    "Move To XY Zero (G0 X0 Y0)": "Рух до нуля осей XY  (G0 X0 Y0)",
    "Move X+": "Рух X +",
    "Move To Z Zero (G0 Z0)": "Рух до нуля осі Z  (G0 Z0)",
    "Move X- Y-": "Рух X- Y-",
    "Move Y-": "Рух Y-",
    "Move X+ Y-": "Рух X + Y-",
    "Move Z-": "Рух Z-",
    "Up": "Вгору",
    "Down": "Вниз",
    "Page Up": "Сторінка вгору",
    "Page Down": "Сторінка вниз",
    "0.1x Move": "0.1x Рух",
    "Alt": "Alt",
    "10x Move": "10x Рух",
    "⇧ Shift": "⇧ Зсув",
    "Run Boundary": "Запустити межу",
    "Click to check the boundary of the image to be engraved.": "Натисніть, щоб перевірити межі різьбленого зображення.",
    "Note: If you are using the CNC Carving Module, make sure the carving bit will not run into the fixtures before you use this feature.": "Примітка. Якщо ви використовуєте модуль різьблення з ЧПУ, переконайтесь, що бур різьблення не потрабить у кріплення, перш ніж використовувати цю функцію.",
    "Go To Work Origin": "Перейти до області роботи",
    "Move the head to the last saved work origin.": "Перемістіть модуль до останньої збереженої робочої області.",
    "Set Work Origin": "Встановити область роботи",
    "Set the current position of the head as the work origin.": "Встановіть поточне положення модуля як область роботи.",
    "Shuttle Settings": "Налаштування затвору",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "Діапазон швидкості подачі: {{min}} - {{max}} мм / хв",
    "Repeat Rate: {{hertz}}Hz": "Частота повторень: {{hertz}} Гц",
    "60 Times per Second": "60 разів на секунду",
    "45 Times per Second": "45 разів на секунду",
    "30 Times per Second": "30 разів на секунду",
    "15 Times per Second": "15 разів на секунду",
    "10 Times per Second": "10 разів на секунду",
    "5 Times per Second": "5 разів на секунду",
    "2 Times per Second": "2 разів на секунду",
    "Once Every Second": "Раз на секунду",
    "Distance Overshoot: {{overshoot}}x": "Відстань вгору: {{overshoot}} x",
    "Axes": "Вісі",
    "Machine Position": "Положення пристрою",
    "Work Position": "Робоча позиція",
    "Cooling Fan": "",
    "If you disable the Door Detection feature, your job will not pause when one of both of the enclosure panels is/are opened.": "",
    "G-code Inspect": "",
    "Min": "Хв",
    "Dimension": "Вимір",
    "Sent": "Надісланий",
    "Received": "Отримано",
    "Start Time": "Час початку",
    "Elapsed Time": "Витрачений час",
    "Finish Time": "Час закінчення",
    "Remaining Time": "Залишилось часу",
    "Camera Capture": "Захоплення камери",
    "Start": "Старт",
    "Comfirm": "Підтвердьте",
    "How to Configure Camera Aid Background": "Як налаштувати фон допоміжної камери",
    "The Camera Aid Background feature enables you to place the material and the image to be engraved together                         and adjust their position on the software by using a phone with a camera.                         It helps to engrave the image on your material in a much more accurate way.": "Функція Фон допоміжної камери дозволяє розміщувати гравірувані матеріали та зображення разом та коригувати їх положення у програмному забезпеченні за допомогою телефону з камерою. Це допомагає гравірувати зображення на матеріалі набагато точніше.",
    "Place a piece of paper or wood sheet on the Engraving & Carving Platform.": "Помістіть аркуш паперу або дерева на платформу для гравірування та різьблення.",
    "Set the work origin as how you did before.": "Встановіть область роботи так, як ви робили раніше.",
    "Go to": "Йти до",
    "Set Background": "Встановити фон",
    "Click": "Натисніть",
    "Add Background": "Додади фон",
    "Print a square to locate your material.": "Надрукуйте квадрат, щоб визначити положення матеріалу.",
    "Set the": "Встановіть",
    "Side Length": "Бічна довжина",
    "and": "і",
    "of the square.": "площі.",
    "The square should be larger than the material that will be engraved.": "The square should be larger than the material that will be engraved.",
    "Engrave Square": "Гравіруйте квадрат",
    "After the square is engraved, place the material inside the square and take a photo. The four corners of the square must be in the photo. Also, to achieve the best result, try to keep the lens and the heated bed parallel.": "Після того, як квадрат вигравіруваний, розмістіть матеріал всередині квадрата і сфотографуйте. На фотографії повинні бути чотири кути квадрата. Також, щоб досягти найкращого результату, намагайтеся тримати  об'єктив паралельно платформі.",
    "Send the photo to your computer.": "Надішліть фотографію на комп'ютер.",
    "On the software": "На програмному забезпеченні",
    "click": "клацніть",
    "Next": "Далі",
    "to upload the photo. Move the four corners of the dashed box to overlap the four corners of the engraved square.": "щоб завантажити фотографію. Перемістіть чотири кути пунктирної фігури, щоб перекрити чотири кути гравірованої площини.",
    "Extract": "Витягнути",
    "and then": "і потім",
    "Complete": "Завершити",
    "Now the printer knows where your material is on the platform.": "Тепер пристрій знає, де знаходиться ваш матеріал на платформі.",
    "Add the image or text you need to engrave on the background and complete the settings based on your needs.": "Додайте зображення або текст, які потрібно вигравірувати на задньому плані, і завершіть налаштування відповідно до ваших потреб.",
    "Set the work origin only on the Z direction again so that the printer can engrave on the surface of the material.": "Повторно встановіть область роботи лише по осі Z, щоб пристрій міг вигравірувати на поверхні матеріалу.",
    "Z": "Z",
    "Zero Out Temporary Z Axis": "Тимчасово обнулити вісь Z",
    "to save the new origin.": "щоб зберегти нову область.",
    "Note: If you use the USB disk to engrave, please make sure you set the work origin in the software instead of on the touchscreen.": "Примітка. Якщо для гравіювання ви використовуєте USB-диск, переконайтеся, що ви встановили область роботи в програмному забезпеченні замість сенсорного екрану.",
    "Work Power": "Робоча потужність",
    "and start the engraving.": "і почати гравірування.",
    "Previous": "Попередній",
    "Apply": "Застосувати",
    "This action cannot be undone. Are you sure you want to stop the job?": "Цю дію не можна скасувати. Ви впевнені, що хочете припинити роботу?",
    "Information": "Інформація",
    "The camera hasn't calibrated yet. Please go through the Camera Calibration procedures on touchscreen first.": "Камера ще не відкалібрована. Спершу пройдіть процедуру калібрування камери на сенсорному екрані.",
    "Remove Background": "Видалити фон",
    "Contrast": "Контрастність",
    "The difference between the lightest color and the darkest color.": "Різниця між найсвітлішим і найтемнішим кольором.",
    "Brightness": "Яскравість",
    "The engraved picture is brighter when this value is bigger.": "Гравірована картина яскравіша, коли це значення більше.",
    "White Clip": "Білий кліп",
    "Set the threshold to turn the color that is not pure white into pure white.": "Встановіть поріг перетворення не чисто білого кольору на чисто білий.",
    "Algorithm": "Алгоритм",
    "Choose an algorithm for image processing.": "Виберіть алгоритм обробки зображень.",
    "Choose algorithms": "Виберіть алгоритми",
    "Set the proportion of the black color based on the original color of the image.": "Встановіть пропорцію чорного кольору, виходячи з початкового кольору зображення.",
    "Inverts black to white and vise versa.": "Перетворює чорний на білий та навпаки.",
    "Impurity Size": "Розмір домішок",
    "Determines the minimum size of impurity which allows to be showed.": "Визначає мінімальний розмір домішок, дозволених для показу.",
    "Greyscale": "Відтінки сірого",
    "Movement Mode": "Режим руху",
    "Line (Normal Quality)": "Рядок (нормальна якість)",
    "Dot (High Quality)": "Крапка (висока якість)",
    "Choose movement mode": "Виберіть режим руху",
    "Line Direction": "Напрямок лінії",
    "Select the direction of the engraving path.": "Виберіть напрямок шляху гравірування.",
    "Diagonal": "Діагональна",
    "Diagonal2": "Діагональ2",
    "Choose an algorithm": "Виберіть алгоритм",
    "Determines how fine and smooth the engraved picture will be. The bigger this value is, the better quality you will get. The range is 1-10 dot/mm and 10 is recommended.": "Визначає, наскільки витонченою та гладкою буде гравірована картина. Чим більше це значення, тим кращу якість ви отримаєте. Діапазон - 1-10 точок/мм і рекомендується 10.",
    "Vector": "Вектор",
    "Optimize Path": "Оптимізувати шлях",
    "Optimizes the path based on the proximity of the lines in the image.": "Оптимізує шлях на основі близькості ліній на зображенні.",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the SVG image will be engraved without fill.": "Встановіть ступінь, на яку область заповнюється лазерними крапками. Найвища щільність - 20 точок/мм. Якщо вона встановлена",
    "Determines how fast the machine moves when it’s not engraving.": "Визначає швидкість руху пристрою, коли він не гравірує.",
    "Determines how fast the machine moves when it’s engraving.": "Визначає швидкість руху пристрою при гравіруванні.",
    "Determines how long the laser keeps on when it’s engraving a dot.": "Визначає, як довго утримується лазер, коли він гравірує крапку.",
    "Extract Square Trace": "Витягнути слід квадрату",
    "Set Laser Background": "Встановити фон лазера",
    "Print Square Trace": "Друк квадратного сліду",
    "Please extract background image from photo.": "Приьеріть фонове зображення з фотографії.",
    "Laser tool head is not connected. Please make sure the laser tool head is installed properly, and then connect to your Snapmaker via Connection widget.": "Модуль лазера не підключено. Переконайтеся, що модуль лазера встановлено",
    "Fine Tune Work Origin": "Тонке налаштування області роботи",
    "How Fine Tune Work Origin Works": "Як працює тонке налаштування області роботи",
    "Setting work origin is essentially finding the best place for the engraved image in the X and Y directions and determining the distance (Z Offset) between the Engraving & Carving Platform and the Laser Module to acquire the smallest laser dot on the material for the most efficient use of the laser power and the best result. For the 200mW Laser Engraving Module, the Z Offset can be set by judging the size of the laser dot by eyes with low power. However, for the 1600mW Laser Cutting Module, this method is less accurate as the laser dot is too strong and less interpretable. To set the Z Offset more accurately, we can move the module to the position that is close to the optimal Z Offset (Offset A). The software will test the results from a few positions next to Offset A on the same material. The best result determines the best Z Offset.": "Встановлення області роботи - це, по суті, пошук найкращого місця для гравірованого зображення по осях X та Y та визначення відстані (Z зміщення) між платформою гравірування та різьблення та модулем для отримання найменшої лазерної точки на матеріалі для найбільш ефективного використання потужності лазера та найкращого результату. Для лазерного модуля потужністю 200 мВт зміщення по осі Z можна встановити, на око за розміром лазерної крапки з низькою потужністю. Однак для лазерного модуля потужністю 1600 мВт цей метод менш точний, оскільки лазерна крапка занадто сильна і менш інтерпретаційна. Щоб більш точно встановити зміщення по осі Z, потрібно перемістити модуль у положення, близьке до оптимального зміщення по осі Z (зміщення A). Програмне забезпечення перевірить результати з кількох позицій наближених зі зміщенням А на тому ж матеріалі. Найкращий результат визначає найкраще зміщення по осі Z.",
    "Focus": "Фокус",
    "and use": "і використовувати",
    "Jog Pad": "Початок заповнення",
    "in the Axes section to move the Laser Cutting Module to the position that is close to the optimal Z Offset (just like how you do with the 200mW Laser Engraving Module).": "у розділі \"Осі\" перемістити модуль лазерного різання в положення, близьке до оптимального зміщення осі Z (так само, як ви робите з модулем лазерної гравірування потужністю 200 МВт).",
    "Set Work Speed and Power based on the material you are using. If you are using a piece of 1.5 mm wood sheet, it’s recommended to set the Work Speed to a value between 80 mm/s and 120 mm/s and set the Power to 100%.": "Встановіть швидкість роботи та потужність залежно від матеріалу, який ви використовуєте. Якщо ви використовуєте шматок деревини 1,5 мм, рекомендується встановити робочу швидкість на значення між 80 мм/с і 120 мм/с і встановити Потужність на 100%.",
    "Generate and Load G-code": "Створити та завантажити G-код",
    "and the G-code is automatically generated and loaded.": "і G-код автоматично генерується та завантажується.",
    "to start laser cutting.": "щоб почати лазерне різання.",
    "Choose the position that can cut the material the most smoothly or engrave the thinnest line and the software will set it as Z Offset. In this example, -2.0 should be the Z Offset.": "Виберіть позицію, яка зможе вирізати матеріал найбільш гладко або вигравірувати найтоншу лінію, і програма встановить його як зміщення осі Z. У цьому прикладі -2,0 має бути зміщенням по вісі Z.",
    "Determines how fast the machine moves when it’s working.": "Визначає швидкість руху пристрою, коли він працює.",
    "New Macro": "Новий макрос",
    "Macro Name": "Назва макросу",
    "Macro Commands": "Макрокоманди",
    "Repeat": "Повторити",
    "Edit Macro": "Редагувати макрос",
    "Delete Macro": "Видалити макрос",
    "Delete this macro?": "Видалити цей макрос?",
    "No": "Ні",
    "Delete": "Видалити",
    "Macro": "Макрос",
    "No macros": "Без макросів",
    "Run Macro": "Запустити макрос",
    "Tool Head": "Модуль",
    "Printing Auto Mode": "Автоматичний режим друку",
    "Material Thickness": "Товщина матеріалу",
    "Z Offset": "Зміщення осі Z",
    "Laser Power": "Потужність лазера",
    "Machine Modal": "Модель пристрою",
    "Motion": "Рух",
    "Distance": "Відстань",
    "Feed Rate": "Частота подачі",
    "Unit": "Одиниця",
    "Spindle": "Шпиндель",
    "Nozzle Temp.": "Температура сопла.",
    "Heated Bed Temp.": "Температура  платформи з підігрівом",
    "Filament": "Нитка",
    "Unload": "Завантажити",
    "Quality": "Якість",
    "Shell": "Оболонка",
    "Infill": "Заповнення",
    "Speed": "Швидкість",
    "Retract & Z Hop": "Втягування екструзії та підняття осі Z",
    "Support": "Підтримка",
    "Printing Settings": "Налаштування друку",
    "Recommended": "Рекомендовано",
    "Customize": "Налаштувати",
    "Normal Quality": "Нормальна якість",
    "High Quality": "Висока якість",
    "Show Details": "Показати деталі",
    "Profile": "Профіль",
    "Material": "Матеріал",
    "STL File (Binary) (*.stl)": "Файл STL (Binary) (* .stl)",
    "STL File (ASCII) (*.stl)": "Файл STL (ASCII) (* .stl)",
    "OBJ File (*.obj)": "Файл OBJ (* .obj)",
    "Export Models": "Експорт моделей",
    "Loading model...": "Завантаження моделі ...",
    "Loaded model successfully.": "Модель успішно завантажено.",
    "Failed to load model.": "Не вдалося завантажити модель.",
    "Preparing for slicing...": "Підготовка до нарізки ...",
    "Slicing...{{progress}}%": "Нарізка ... {{progress}}%",
    "Sliced model successfully.": "Модель успішно нарізано.",
    "Failed to slice model.": "Не вдалося нарізати модель.",
    "Previewing G-code...{{progress}}%": "",
    "Previewed G-code successfully.": "Попередньо переглянуто G-код.",
    "Failed to load G-code.": "Не вдалося завантажити G-код.",
    "Center Selected Model": "Центрувати обрану модель",
    "Reset Selected Model Transformation": "Скинути обране перетворення моделі",
    "Lay Flat Selected Model": "Покласти на площину обрану модель",
    "Failed to upload model": "Не вдалося завантажити модель",
    "Webcam": "Веб-камера",
    "Enable": "Увімкнути",
    "Disable": "Відключити",
    "Edit": "Редагувати",
    "Automatic detection": "Автоматичне виявлення",
    "Webcam Settings": "Налаштування веб-камери",
    "Media Source": "Джерело медіа",
    "Use a built-in camera or a connected webcam": "Використовувати вбудовану камеру або підключену веб-камеру",
    "No video devices available": "Немає доступних відеопристроїв",
    "Choose a video device": "Виберіть відеопристрій",
    "Use a M-JPEG stream over HTTP": "Використовуйте потік M-JPEG через HTTP",
    "Sending File": "",
    "Please wait for the file transfer.": "",
    "Failed to Send File": "Не вдалося надіслати файл",
    "File Sent Successfully": "",
    "G-code Files": "",
    "Open G-code File": "",
    "Preview in workspace": "",
    "Loading...": "Завантаження ...",
    "Enabled": "Увімкнено",
    "Disabled": "Вимкнуто",
    "Scene Objects": "Об'єкти сцени",
    "Display G-code Filename": "Відобразити ім'я файлу G-код",
    "Hide Coordinate System": "Сховати систему координат",
    "Show Coordinate System": "Показати систему координат",
    "Hide Toolhead": "Сховати інструмент",
    "Show Toolhead": "Показати модуль",
    "3D rendering...": "3D рендериться...",
    "Filament Runout Recovery": "Відновлення  нитки, що закінчилась",
    "Filament has run out. Please load the new filament to continue printing.": "Нитка закінчилася. Завантажте нову нитку, щоб продовжити друк.",
    "Enclosure Door Open": "",
    "One or both of the enclosure panels is/are opened. Please close the panel(s) to continue printing.": "",
    "Please wait one second after you close the door to proceed.": "",
    "Unable to start the job.": "Не вдається розпочати роботу.",
    "Unable to resume the job.": "Не вдається відновити роботу.",
    "Loading Gcode...{{progress}}%": "",
    "Loaded Gcode successfully.": "",
    "Failed to load Gcode.": "",
    "Run": "Запустити",
    "Pause": "Пауза",
    "Stop": "Стоп",
    "Do you want to save the changes in the {{headType}} editor?": "",
    "Don't show again": "",
    "Parse Error": "",
    "Failed to parse image file {{}}.": "",
    "Failed to parse image file {{filename}}.": "",
    "Don't Save": "",
    "Object List": "",
    "Object": "",
    "Select a font": "",
    "1.0": "",
    "1.2": "",
    "1.5": "",
    "2.0": "",
    "Move (mm)": "",
    "Set the coordinate of the selected image or text. You can also drag the image directly.": "",
    "Carving Path": "",
    "Add...": "",
    "Unknown": "",
    "Connect": "",
    "Disconnect": "",
    "Connect Manually": "",
    "IP": "",
    "Add": "",
    "The camera on the laser module captures images of the work area, and stitch them together as the background. The accuracy of Camera Calibration affects how the captured image is mapped with machine coordinates. If you have reinstalled the laser module, please redo Camera Calibration on the touch screen before proceeding.": "",
    "Align the four corners of the quadrilateral with the corners of the printed square. This will affect how the captured image is mapped with machine coordinates.": "",
    "Type": "",
    "Line": "",
    "Round": "",
    "Diamond": "",
    "Newsprint": "",
    "Angle": "",
    "HALFTONE": "",
    "Heated Bed Adhesion Type": "",
    "Uniform Scaling": "",
    "Please confirm whether to start this print job on the touchscreen.": "",
    "Send to Device via Wi-Fi": "",
    "Timeout": "",
    "Processing Order": "",
    "Processing Mode": "",
    "LED Strip": "",
    "Export G-code to File": "",
    "Carving V-bit": "",
    "Clear Heated Bed": "",
    "Laser Height": ""
}
