{
    "id": "snapmaker",
    "version": "4.2.0",
    "name": "Snapmaker Original",
    "inherits": "snapmaker_modify_0",
    "metadata": {
        "visible": true,
        "readonly": true,
        "author": "walker",
        "manufacturer": "Snapmaker",
        "file_formats": "text/x-gcode",
        "machine_extruder_trains": {
            "0": "snapmaker_extruder_0"
        }
    },
    "overrides": {
        "color": {
            "description": "Set Luban render color.",
            "type": "color",
            "default_value": "#464646"
        },
        "adhesion_extruder_nr": {
            "description": "The extruder train to use for printing the skirt/brim/raft. This is used in multi-extrusion."
        },
        "adhesion_type": {
            "description": "Different options that help improve priming your extrusion and adhesion to the build plate. Skirt is a line printed around the model, but not connected to the model. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model."
        },
        "bottom_thickness": {
            "description": "The thickness of the bottom layers of the print. This value divided by the layer height defines the number of bottom layers."
        },
        "brim_line_count": {
            "description": "The number of lines used for a brim. More brim lines enhance adhesion to the heated bed, but also reduces the effective print area."
        },
        "brim_width": {
            "description": "The distance from the model to the outermost brim line. A larger brim enhances adhesion to the heated bed, but also reduces the effective print area."
        },
        "cool_fan_enabled": {
            "description": "Enables the print cooling fans while printing. The fans improve print quality on layers with short layer times and bridging / overhangs."
        },
        "cool_fan_speed": {
            "description": "The speed at which the print cooling fans spin."
        },
        "conical_overhang_angle": {
            "description": "The maximum angle of overhangs after the they have been made printable. At a value of 0째 all overhangs are replaced by a piece of model connected to the heated bed, 90째 will not change the model in any way."
        },
        "default_material_bed_temperature": {
            "description": "The default temperature used for the heated bed. This should be the \"base\" temperature of a heated bed. All other print temperatures should use offsets based on this value"
        },
        "infill_sparse_density": {
            "description": "Adjusts the density of infill of the print."
        },
        "infill_pattern": {
            "description": "The pattern of the infill material of the print. The line and zig zag infill swap direction on alternate layers, reducing material cost. The grid, triangle, tri-hexagon, cubic, octet, quarter cubic, cross and concentric patterns are fully printed every layer. Gyroid, cubic, quarter cubic and octet infill change with every layer to provide a more equal distribution of strength over each direction."
        },
        "initial_layer_line_width_factor": {
            "description": "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion."
        },
        "skirt_line_count": {
            "description": "Multiple skirt lines help to prime your extrusion better for small models. Setting this to 0 will disable the skirt."
        },
        "layer_height": {
            "description": "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution."
        },
        "layer_height_0": {
            "description": "The height of the initial layer in mm. A thicker initial layer makes adhesion to the heated bed easier."
        },
        "machine_name": {
            "default_value": "Snapmaker"
        },
        "machine_buildplate_type": {
            "default_value": "aluminum",
            "description": "The material of the heated bed installed on the printer."
        },
        "machine_width": {
            "default_value": 125
        },
        "machine_depth": {
            "default_value": 125
        },
        "machine_heated_bed": {
            "description": "Whether the machine enables the heated build plate to provide heat to avoid warp.",
            "default_value": true
        },
        "machine_height": {
            "default_value": 125
        },
        "machine_nozzle_size": {
            "default_value": 0.4
        },
        "machine_max_feedrate_x": {
            "default_value": 120
        },
        "machine_max_feedrate_y": {
            "default_value": 120
        },
        "machine_max_feedrate_z": {
            "default_value": 40
        },
        "machine_max_feedrate_e": {
            "default_value": 25
        },
        "machine_max_acceleration_x": {
            "default_value": 3000
        },
        "machine_max_acceleration_y": {
            "default_value": 3000
        },
        "machine_max_acceleration_z": {
            "default_value": 100
        },
        "machine_max_acceleration_e": {
            "default_value": 10000
        },
        "machine_acceleration": {
            "default_value": 1000
        },
        "machine_max_jerk_xy": {
            "default_value": 10
        },
        "machine_max_jerk_z": {
            "default_value": 0.3
        },
        "machine_max_jerk_e": {
            "default_value": 5
        },
        "machine_minimum_feedrate": {
            "default_value": 0.05
        },
        "magic_mesh_surface_mode": {
            "description": "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin."
        },
        "magic_spiralize": {
            "description": "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part."
        },
        "material_bed_temperature": {
            "description": "The temperature used for the build plate. If this is 0, the bed temperature will not be adjusted."
        },
        "material_bed_temperature_layer_0": {
            "description": "The temperature used for the build plate at the first layer."
        },
        "material_flow_layer_0": {
            "description": "Flow compensation for the first layer: the amount of material extruded on the initial layer is multiplied by this value."
        },
        "material_bed_temp_prepend": {
            "description": "Whether to include heated bed temperature commands at the start of the gcode. When the start_gcode already contains heated bed temperature commands Cura frontend will automatically disable this setting.",
            "default_value": false
        },
        "material_diameter": {
            "description": "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.",
            "default_value": 1.75
        },
        "material_final_print_temperature": {
            "description": "The temperature to which to already start cooling down just before the end of printing."
        },
        "material_flow": {
            "description": "Flow compensation: the amount of material extruded is multiplied by this value."
        },
        "material_print_temp_prepend": {
            "default_value": false
        },
        "material_print_temperature": {
            "description": "The temperature used for printing."
        },
        "material_print_temperature_layer_0": {
            "description": "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer."
        },
        "mold_enabled": {
            "description": "Print models as a mold, which can be cast in order to get a model which resembles the models on the heated bed."
        },
        "material_bed_temp_wait": {
            "description": "Whether to insert a command to wait until the heated bed temperature is reached at the start."
        },
        "machine_shape": {
            "description": "The shape of the heated bed without taking unprintable areas into account."
        },
        "optimize_wall_printing_order": {
            "description": "Optimize the order in which walls are printed so as to reduce the number of retractions and the distance travelled. Most parts will benefit from this being enabled but some may actually take longer so please compare the print time estimates with and without optimization. First layer is not optimized when choosing brim as heated bed adhesion type."
        },
        "outer_inset_first": {
            "description": "Prints walls in order of outside to inside when enabled. This can help improve dimensional accuracy in X and Y when using a high viscosity plastic like ABS; however it can decrease outer surface print quality, especially on overhangs."
        },
        "z_seam_relative": {
            "description": "When enabled, the z seam coordinates are relative to each part's centre. When disabled, the coordinates define an absolute position on the heated bed."
        },
        "speed_slowdown_layers": {
            "description": "The first few layers are printed slower than the rest of the model, to get better adhesion to the heated bed and improve the overall success rate of prints. The speed is gradually increased over these layers."
        },
        "retraction_hop_after_extruder_switch": {
            "description": "After the machine switched from one extruder to the other, the heated bed is lowered to create clearance between the nozzle and the print. This prevents the nozzle from leaving oozed material on the outside of a print."
        },
        "platform_adhesion": {},
        "raft_interface_line_width": {
            "description": "Width of the lines in the middle raft layer. Making the second layer extrude more causes the lines to stick to the heated bed."
        },
        "raft_base_thickness": {
            "description": "Layer thickness of the base raft layer. This should be a thick layer which sticks firmly to the printer heated bed."
        },
        "raft_base_line_width": {
            "description": "Width of the lines in the base raft layer. These should be thick lines to assist in heated bed adhesion."
        },
        "raft_base_line_spacing": {
            "description": "The distance between the raft lines for the base raft layer. Wide spacing makes for easy removal of the raft from the heated bed."
        },
        "raft_margin": {
            "description": "If the raft is enabled, this is the extra raft area around the model which is also given a raft. Increasing this margin will create a stronger raft while using more material and leaving less area for your print."
        },
        "retraction_amount": {
            "description": "The length of material retracted during a retraction move."
        },
        "retraction_enable": {
            "description": "Retract the filament when the nozzle is moving over a non-printed area."
        },
        "retraction_hop": {
            "description": "The height difference when performing a Z Hop."
        },
        "retraction_hop_enabled": {
            "description": "Whenever a retraction is done, the nozzle is raised to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate."
        },
        "retraction_speed": {
            "description": "The speed at which the filament is retracted and primed during a retraction move."
        },
        "retract_at_layer_change": {
            "description": "Retract the filament when the nozzle is moving to the next layer."
        },
        "support_brim_line_count": {
            "description": "The number of lines used for the support brim. More brim lines enhance adhesion to the heated bed, at the cost of some extra material."
        },
        "support_brim_width": {
            "description": "The width of the brim to print underneath the support. A larger brim enhances adhesion to the heated bed, at the cost of some extra material."
        },
        "support_wall_count": {
            "default_value": 0
        },
        "speed_infill": {
            "description": "The speed at which infill is printed."
        },
        "speed_layer_0": {
            "description": "The speed for the initial layer. A lower value is advised to improve adhesion to the heated bed."
        },
        "speed_print": {
            "description": "The speed at which printing happens."
        },
        "speed_print_layer_0": {
            "description": "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate."
        },
        "support": {
            "children": {
                "support_enable": {
                    "description": "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing."
                },
                "support_infill_rate": {
                    "description": "Adjusts the density of the support structure. A higher value results in better overhangs, but the supports are harder to remove."
                },
                "support_pattern": {
                    "description": "The pattern of the support structures of the print. The different options available result in sturdy or easy to remove support.",
                    "default_value": "zigzag"
                },
                "support_type": {
                    "description": "Adjusts the placement of the support structures. The placement can be set to Touching Build Plate or Everywhere. When set to Everywhere, the support structures will also be printed on the model."
                },
                "support_z_distance": {
                    "description": "Distance from the top/bottom of the support structure to the print. This gap provides clearance to remove the supports after the model is printed. This value is rounded up to a multiple of the layer height."
                },
                "support_angle": {
                    "description": "The minimum angle of overhangs for which support is added. At a value of 0째 all overhangs are supported, 90째 will not provide any support."
                }
            }
        },
        "speed_topbottom": {
            "description": "The speed at which top/bottom layers are printed."
        },
        "speed_travel": {
            "description": "The speed at which travel moves are made."
        },
        "speed_travel_layer_0": {
            "description": "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the heated bed. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed."
        },
        "speed_wall_0": {
            "description": "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way."
        },
        "speed_wall_x": {
            "description": "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed."
        },
        "top_thickness": {
            "description": "The thickness of the top layers of the print. This value divided by the layer height defines the number of top layers."
        },
        "wall_thickness": {
            "description": "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls."
        },
        "skin_edge_support_layers": {
            "default_value": 0
        }
    }
}