{
    "Generate Support": "Générer les supports",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "Générer des structures pour soutenir les parties du modèle qui possèdent des porte-à-faux. Sans ces structures, ces parties s'effondreront durant l'impression.",
    "Build Plate Adhesion Type": "Type d'adhérence du plateau",
    "Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "Différentes options qui permettent d'améliorer la préparation de votre extrusion et l'adhérence au plateau. La bordure ajoute une zone plate d'une seule couche autour de la base de votre modèle, afin de l'empêcher de se redresser. Le radeau ajoute une grille épaisse avec un toit sous le modèle. La jupe est une ligne imprimée autour du modèle mais qui n'est pas rattachée au modèle.",
    "Initial Layer Line Width": "Largeur de ligne couche initiale",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "Multiplicateur de la largeur de la ligne sur la première couche. Augmenter le multiplicateur peut améliorer l'adhésion au plateau.",
    "Spiralize Outer Contour": "Spiraliser le contour extérieur",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "Cette fonction ajuste le déplacement en Z sur le bord extérieur. Cela va créer une augmentation stable de Z sur toute l’impression. Cette fonction transforme un modèle solide en une impression à paroi unique avec une base solide. Cette fonctionnalité doit être activée seulement lorsque chaque couche contient uniquement une seule partie.",
    "Surface Mode": "Mode de surface",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "Traite le modèle comme surface seule, un volume ou des volumes avec des surfaces seules. Le mode d'impression normal imprime uniquement des volumes fermés. « Surface » imprime une paroi seule autour de la surface de la maille, sans remplissage ni couche du dessus/dessous. « Les deux » imprime des volumes fermés comme en mode normal et les polygones restants comme surfaces.",
    "Travel Speed": "Vitesse de déplacement",
    "The speed at which travel moves are made.": "La vitesse à laquelle les déplacements s'effectuent.",
    "Top/Bottom Speed": "Vitesse d'impression du dessus/dessous",
    "The speed at which top/bottom layers are printed.": "La vitesse à laquelle les couches du dessus/dessous sont imprimées.",
    "Inner Wall Speed": "Vitesse d'impression de la paroi interne",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "La vitesse à laquelle toutes les parois internes seront imprimées. L’impression de la paroi interne à une vitesse supérieure réduira le temps d'impression global. Il est bon de définir cette vitesse entre celle de l'impression de la paroi externe et du remplissage.",
    "Outer Wall Speed": "Vitesse d'impression de la paroi externe",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "La vitesse à laquelle les parois externes sont imprimées. L’impression de la paroi externe à une vitesse inférieure améliore la qualité finale de la coque. Néanmoins, si la différence entre la vitesse de la paroi interne et la vitesse de la paroi externe est importante, la qualité finale sera réduite.",
    "Infill Speed": "Vitesse de remplissage",
    "The speed at which infill is printed.": "La vitesse à laquelle le remplissage est imprimé.",
    "Print Speed": "Vitesse d’impression",
    "The speed at which printing happens.": "La vitesse à laquelle l'impression s'effectue.",
    "Retraction Speed": "Vitesse de rétraction",
    "The speed at which the filament is retracted and primed during a retraction move.": "La vitesse à laquelle le filament est rétracté et préparé pendant une rétraction.",
    "Retraction Distance": "Distance de rétraction",
    "The length of material retracted during a retraction move.": "La longueur de matériau rétracté pendant une rétraction.",
    "Retract at Layer Change": "Rétracter au changement de couche",
    "Retract the filament when the nozzle is moving to the next layer.": "Rétracter le filament quand le bec se déplace vers la prochaine couche.",
    "Enable Retraction": "Activer la rétraction",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "Rétracte le filament quand la buse se déplace vers une zone non imprimée. ",
    "Infill Density": "Densité du remplissage",
    "Adjusts the density of infill of the print.": "Adapte la densité de remplissage de l'impression",
    "Bottom Thickness": "Épaisseur du dessous",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "L’épaisseur des couches du dessous dans l'impression. Cette valeur divisée par la hauteur de la couche définit le nombre de couches du dessous.",
    "Top Thickness": "Épaisseur du dessus",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "L’épaisseur des couches du dessus dans l'impression. Cette valeur divisée par la hauteur de la couche définit le nombre de couches du dessus.",
    "Wall Thickness": "Épaisseur de la paroi",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "Épaisseur des parois en sens horizontal. Cette valeur divisée par la largeur de la ligne de la paroi définit le nombre de parois.",
    "Initial Layer Height": "Hauteur de la couche initiale",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.": "La hauteur de la couche initiale en mm. Une couche initiale plus épaisse adhère plus facilement au plateau.",
    "Layer Height": "Hauteur de la couche",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "La hauteur de chaque couche en mm. Des valeurs plus élevées créent des impressions plus rapides dans une résolution moindre, tandis que des valeurs plus basses entraînent des impressions plus lentes dans une résolution plus élevée.",
    "Z Hop Height": "Hauteur du décalage en Z",
    "The height difference when performing a Z Hop.": "La différence de hauteur lors de la réalisation d'un décalage en Z.",
    "Z Hop When Retracted": "Décalage en Z lors d’une rétraction",
    "Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.": "À chaque rétraction, le plateau est abaissé pour créer un espace entre la buse et l'impression. Cela évite que la buse ne touche l'impression pendant les déplacements, réduisant ainsi le risque de heurter l'impression à partir du plateau.",
    "Initial Layer Travel Speed": "Vitesse de déplacement de la couche initiale",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "Vitesse des mouvements de déplacement dans la couche initiale. Une valeur plus faible est recommandée pour éviter que les pièces déjà imprimées ne s'écartent du plateau. La valeur de ce paramètre peut être calculée automatiquement à partir du ratio entre la vitesse des mouvements et la vitesse d'impression.",
    "Initial Layer Print Speed": "Vitesse d’impression de la couche initiale",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.": "La vitesse d'impression de la couche initiale. Une valeur plus faible est recommandée pour améliorer l'adhérence au plateau.",
    "Has Heated Build Plate": "A un plateau chauffé",
    "Whether the machine has a heated build plate present.": "Si la machine a un plateau chauffé présent.",
    "Printing Temperature": "Température d’impression",
    "The temperature used for printing.": "Température utilisée pour l'impression.",
    "Printing Temperature Initial Layer": "Température d’impression couche initiale",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "Température utilisée pour l'impression de la première couche. Définissez-la sur 0 pour désactiver le traitement spécial de la couche initiale.",
    "Final Printing Temperature": "Température d’impression finale",
    "The temperature to which to already start cooling down just before the end of printing.": "La température à laquelle le refroidissement commence juste avant la fin de l'impression.",
    "Build Plate Temperature": "Température du plateau",
    "The temperature used for the heated build plate. If this is 0, the bed will not heat up for this print.": "Température utilisée pour le plateau chauffant. Si elle est définie sur 0, le plateau ne sera pas chauffé pour cette impression.",
    "Build Plate Temperature Initial Layer": "Température du plateau couche initiale",
    "The temperature used for the heated build plate at the first layer.": "Température utilisée pour le plateau chauffant à la première couche.",
    "Diameter": "Diamètre",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "Ajuste le diamètre du filament utilisé. Faites correspondre cette valeur au diamètre du filament utilisé.",
    "Flow": "Débit",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "Compensation du débit : la quantité de matériau extrudée est multipliée par cette valeur.",
    "Records: {{from}} - {{to}} / {{total}}": "Enregistrements: {{from}} - {{to}} / {{total}}",
    "Records: {{total}}": "Enregistrements: {{total}}",
    "{{pageLength}} per page": "{{Longueurpage}} par page",
    "This is an alpha feature that helps you get started with CNC Carving. Make sure you": "C'est un élément alpha qui vous aide à commencer avec la gravure CNC Carving. Assurez-vous",
    "Read This First - Safety Information": "À lire d'abord - Information de sécurité",
    "before any further instructions.": "Avant toute instructions supplémentaires",
    "Don't show again in current session": "Ne pas réafficher dans la session actuelle",
    "Upload SVG File": "Charger un fichier SVG",
    "Size": "Taille",
    "Work Speed": "Vitesse de Travail",
    "Plunge Speed": "Vitesse de Chute",
    "Jog Speed": "Vitesse de Rafraîchissement",
    "Grey Level": "Niveau de gris",
    "Target Depth": "Profondeur Cible",
    "Cutting Diameter": "Diamètre de Coupe",
    "Stop Height": "Hauteur Maximale",
    "Command succeeded": "Commande effectuée avec succès",
    "Command failed ({{err}})": "Commande échouée ({{err}})",
    "Options": "Options",
    "Command": "Commande",
    "Show notifications": "Afficher les notifications",
    "Store": "Stocker",
    "Server has halted intentionally by you": "Le serveur s'est arrété selon vos intentions",
    "Emergency stop triggered, Please restart the Snapmaker then reconnect.": "L'arrêt d'urgence s'est déclenché, Veuillez redémarrer le Snapmaker",
    "Reload": "Recharger",
    "Reset": "Redémarrer",
    "STOP": "STOP",
    "User Manual & FAQ": "Manuel Utilisateur & FAQ",
    "Forum": "Forum",
    "Authentication failed.": "L'authentification a échoué.",
    "Sign in to {{name}}": "Connectez vous à {{nom}}",
    "Username": "Nom d'utilisateur",
    "Password": "Mot de passe",
    "Sign In": "Connexion",
    "Forgot your password?": "Vous avez oublié votre mot de passe ?",
    "Learn more": "Plus d'infos",
    "Downloads": "Téléchargements",
    "Report an issue": "Signaler un problème",
    "Checking for updates...": "Vérification des mises à jour",
    "A new version of {{name}} is available": "Une nouvelle version de {{nom}} est disponible",
    "Version {{version}}": "Version {{version}}",
    "Latest version": "Dernière version",
    "You already have the newest version of {{name}}": "Vous avez déjà la dernière version de {{nom}}",
    "Account": "Compte",
    "New": "Nouveau",
    "Account status": "Status du compte",
    "Confirm Password": "Confirmer le Mot de Passe",
    "Cancel": "Annuler",
    "OK": "OK",
    "An unexpected error has occurred.": "Une erreur inconnue s'est produite",
    "Loading...": "Chargement…",
    "No data to display": "Pas de données à afficher",
    "Enabled": "Activé",
    "Disabled": "Désactivé",
    "Date Modified": "Date modifiée",
    "Action": "Action",
    "Edit Account": "Modifier le Compte",
    "Delete Account": "Supprimer le Compte",
    "Settings": "Paramètres",
    "My Account": "Mon Compte",
    "Are you sure you want to delete the account?": "Etes-vous sûr de vouloir supprimer le compte ?",
    "Update": "Mise à jour",
    "Old Password": "Ancien mot de passe",
    "Change Password": "Changer le mot de passe",
    "New Password": "Nouveau mot de passe",
    "Commands": "Commandes",
    "Title": "Titre",
    "and more...": "et plus…",
    "Delete": "Supprimer",
    "Are you sure you want to delete this item?": "Etes-vous sûr de vouloir supprimer cet élément ?",
    "Events": "Evenements",
    "Event": "Evenements",
    "Choose an event": "Choisir un evenement",
    "Startup (System only)": "Démarrer (Système seulement)",
    "Open a serial port (System only)": "Ouvrir un port série (Système seulement)",
    "Close a serial port (System only)": "Fermer un port série (Système seulement)",
    "G-code: Load": "G-Code: Charger",
    "G-code: Unload": "G-Code: Décharger",
    "G-code: Start": "G-Code: Démarrer",
    "G-code: Stop": "G-Code: Stop",
    "G-code: Pause": "G-Code: Pause",
    "G-code: Resume": "G-Code: Reprendre",
    "Feed Hold": "Feed Hold",
    "Cycle Start": "Démarrage du Cycle",
    "Homing": "Accueil",
    "Sleep": "Veille",
    "Trigger": "Déclencheur",
    "Choose an trigger": "Choisir un déclencheur",
    "System": "Système",
    "G-code": "G-Code",
    "Startup": "Démarrage",
    "Open a serial port": "Ouvrir un port série",
    "Close a serial port": "Fermer un port série",
    "Automatically check for updates": "Vérification automatique des mises à jour",
    "Language": "Langage",
    "Save Changes": "Sauver les changements",
    "General": "Général",
    "Workspace": "Espace de travail",
    "About": "A propos",
    "Restore Defaults": "Restaurer les paramètres par défaut",
    "Are you sure you want to restore the default settings?": "Etes-vous sûr de vouloir restaurer les paramètres par défaut ?",
    "The account name is already being used. Choose another name.": "Ce nom de compte est déjà utilisé. Choisissez un autre nom.",
    "Passwords do not match.": "Les mots de passe ne correspondent pas.",
    "3D Printing G-code Generator": "Générateur d'impression 3D de G-Code",
    "Laser G-code Generator": "Générateur Laser de G-Code",
    "CNC G-code Generator": "Générateur CNC de G-Code",
    "Fork Widget": "Changer le Widget",
    "Are you sure you want to fork this widget?": "Etes-vous sûr de vouloir changer ce widget ?",
    "Remove Widget": "Retirer le Widget",
    "Are you sure you want to remove this widget?": "Etes-vous sûr de vouloir retirer ce widget ?",
    "On": "Allumé",
    "Off": "Eteint",
    "Visualizer Widget": "Visualisateur Widget",
    "This widget visualizes a G-code file and simulates the tool path.": "Ce widget visualise un fichier G-Code et simule la trajectoire outils",
    "Connection Widget": "Connexion Widget",
    "This widget lets you establish a connection to a serial port.": "Ce widget vous permet d'établir une connexion vers un port série.",
    "Console Widget": "Wonsole Widget",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "Ce widget vous permet de lire et d'écrire des données sur le controlleur CNC connecté à un port série.",
    "Grbl Widget": "Widget Grbl",
    "This widget can view Grbl state and settings.": "Ce widget peut voir l'état du Grbl et les paramètres.",
    "Marlin Widget": "Widget Marlin",
    "This widget can view Marlin state and settings.": "Ce widget peut voir l'état du Marlin et les paramètres.",
    "Smoothie Widget": "Widget Smoothie",
    "This widget can view Smoothie state and settings.": "Ce widget peut voir l'état du Smoothie et les paramètres.",
    "TinyG Widget": "Widget TinyG",
    "This widget can view TinyG state and settings.": "Ce widget peut voir l'état du TinyG et les paramètres.",
    "Axes Widget": "Widget Axes",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Ce widget montre les positions XYZ. Il inclut les contrôles jog, hominh et l'axe zeroing.",
    "G-code Widget": "Widget G-Code",
    "This widget shows the current status of G-code commands.": "Ce widget montre l'état actuel des commandes G-Code.",
    "Laser Widget": "Widget Laser",
    "This widget allows you control laser intensity and turn the laser on/off.": "Ce widget vous permet de controler l'intensité du laser et d'allumer-éteindre le laser.",
    "Webcam Widget": "Widget Webcam",
    "This widget lets you monitor a webcam.": "We widget vous permet de gérer une webcam.",
    "Widgets": "Widgets",
    "Server has stopped working": "Le serveur a cessé de fonctionner.",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "Un problème a provoquer un disfonctionnement du serveur. Vérifiez l'état du serveur et reessayez.",
    "Close": "Fermer",
    "This field is required.": "Ce champs est requis",
    "Passwords should be equal.": "Les mots de passe doivent correspondre",
    "mm": "mm",
    "in": "in",
    "Axis": "Axe",
    "Work Position": "Position de Travail",
    "Go To Work Zero On X Axis (G0 X0)": "Mise à zéro sur Axe X (G0 X0)",
    "Zero Out Temporary X Axis (G92 X0)": "Mise à Zéro Temporaire Axe X (G92 X0)",
    "Go To Work Zero On Y Axis (G0 Y0)": "Mise à zéro sur Axe Y (G0 Y0)",
    "Zero Out Temporary Y Axis (G92 Y0)": "Mise à Zéro Temporaire Axe Y(G92 Y0)",
    "Go To Work Zero On Z Axis (G0 Z0)": "Mise à zéro sur Axe Z (G0 Z0)",
    "Zero Out Temporary Z Axis (G92 Z0)": "Mise à Zéro Temporaire Axe Z (G92 Z0)",
    "Axes": "Axes",
    "Keypad jogging": "Clavier de jogging",
    "Expand": "Elargir",
    "Collapse": "Effondrement",
    "More": "Plus d'infos",
    "Enter Full Screen": "Passer en Plein Ecran",
    "Exit Full Screen": "Sortir du Plein Ecran",
    "User Defined": "Utilisateur défini",
    "Custom distance for every move operation": "Personaliser la distance pour chaque opération de déplacement",
    "Increase custom distance by one unit": "Augmenter la distance personnalisée d'une unité",
    "Decrease custom distance by one unit": "Réduire la distance personnalisée d'une unité",
    "Move X- Y+": "Déplacer X- Y+",
    "Move Y+": "Déplacer Y+",
    "Move X+ Y+": "Déplacer X+ Y+",
    "Move Z+": "Déplacer Z+",
    "Move X-": "Déplacer X-",
    "Move To XY Zero (G0 X0 Y0)": "Déplacer à XY Zero (G0 X0 Y0)",
    "Move X+": "Déplacer X+",
    "Move To Z Zero (G0 Z0)": "Déplacer à Z Zero (G0 Z0)",
    "Move X- Y-": "Déplacer X- Y-",
    "Move Y-": "Déplacer Y-",
    "Move X+ Y-": "Déplacer X+ Y-",
    "Move Z-": "Déplacer Z-",
    "Right": "Droite",
    "Left": "Gauche",
    "Up": "Haut",
    "Down": "Bas",
    "Page Up": "Page Haut",
    "Page Down": "Page Bas",
    "0.1x Move": "Déplacer 0.1x",
    "Alt": "Alt",
    "10x Move": "Déplacer 10x",
    "⇧ Shift": "⇧ Shift",
    "Run Boundary": "Afficher la limite",
    "Click to check the boundary of the image to be engraved.": "Cliquer pour vérifier la limite de l'image à graver.",
    "Go To Work Origin": "Aller à Work Origin",
    "Move the head to the last saved work origin.": "Déplacer la tête vers la dernière origine de travail.",
    "Set Work Origin": "régler l'origine du travail",
    "Set the current position of the head as the work origin.": "Régler la position actuelle de la tête pour l'origine de travail.",
    "Shuttle Settings": "Paramètres du Shuttle",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "Feed Rate Range: {{min}} - {{max}} mm/min",
    "Repeat Rate: {{hertz}}Hz": "Repeat Rate: {{hertz}}Hz",
    "60 Times per Second": "60 Fois par Seconde",
    "45 Times per Second": "45 Fois par Seconde",
    "30 Times per Second": "30 Fois par Seconde",
    "15 Times per Second": "15 Fois par Seconde",
    "10 Times per Second": "10 Fois par Seconde",
    "5 Times per Second": "5 Fois par Seconde",
    "2 Times per Second": "2 Fois par Seconde",
    "Once Every Second": "Une fois par Seconde",
    "Distance Overshoot: {{overshoot}}x": "Distance Overshoot: {{overshoot}}x",
    "Determines how fast the tool moves when it’s not carving.": "Détermine la vitesse de mouvement de l'outil quand il ne grave pas.",
    "Determines how fast the tool feeds into the material.": "Détermine la vitesse d'alimentation de l'outil sur le matériel.",
    "Generate G-code": "Générer un G-code",
    "Output": "Rendement",
    "Load G-code to Workspace": "Charger un G-code sur l'espace de travail",
    "Export G-code to file": "Exporter un G-code au fichier",
    "Carving Path": "Chemin sculpture",
    "Carve Path": "Graver le chemin",
    "Select a carve path:": "Selectionner le Chemin de gravure",
    "Carve along the contour of the image.": "Graver selon le contour de l'image.",
    "Carve along the shape of the image.": "Graver selon la forme de l'image.",
    "Outline": "Aperçu",
    "On the Path": "Sur le chemin",
    "Choose carve path": "Choisir un chemin de gravure",
    "Resolution": "Résolution",
    "The detected resolution of the loaded image.": "La résolution détectée de l'image chargée.",
    "Size (mm)": "Taille (mm)",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "Entrer la taille de l'image gravée. La taille ne peut pas être supérieure à 125 x 125mm ou la taille de votre matériel.",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "Entrer la profondeur de l'image gravée. La profondeur ne peut pas être plus profonde que la longueur.",
    "Step Down": "Descendre",
    "Enter the depth of each carving step.": "Entrer la profondeur de chaque étape de gravure.",
    "Jog Height": "Taille de rafraichissement.",
    "The distance between the tool and the material when it’s not carving.": "La distance entre l'outil et le matériel hors gravure.",
    "The distance between the tool and the material when the machine stops.": "La distance entre l'outil et le matériel quand la machine s'arrête.",
    "Alignment": "Alignement",
    "None": "Rien",
    "Tab Height": "Hauteur de l'onglet",
    "Enter the height of the tabs.": "Entrer la hauteur des onglets.",
    "Tab Space": "Espace des onglets",
    "Enter the space between any two tabs.": "Entrer l'espace entre deux onglets.",
    "Tab Width": "Largeur des onglets",
    "Enter the width of the tabs.": "Entrer la largeur des onglets",
    "Preview": "Aperçu",
    "Carving Tool": "Outil de gravure",
    "Carving V-Bit": "Gravure V-Bit",
    "Flat End Mill": "Broyeur à bout plat",
    "Ball End Mill": "Broyeur à bout rond",
    "Use Other Bit": "Utiliser un autre bout",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "Entrer le diamètre de la partie la plus large de la lame. Veuillez noter que ce n'est pas le diamètre de la tige.",
    "For the carving bits that we provide, please enter the following value:": "Pour les morceaux de gravure que nous fournissons, veuillez entrer les valeurs suivantes:",
    "Point Angle": "Angle de Point",
    "Enter the angle of the blade.": "Entrer l'angle de la lame.",
    "fullscreen": "plein-écran",
    "Manufacturer: {{manufacturer}}": "Fabricant: {{fabricant}}",
    "Port": "Port",
    "No ports available": "Pas de ports disponibles",
    "Choose a port": "Choisissez un port",
    "Refresh": "Rafraichir",
    "Open": "Ouvrir",
    "Error opening serial port '{{- port}}'": "Erreur d'ouverture de port de série '{{- port}}'",
    "Connection": "Connexion",
    "No serial connection": "Pas de connexion de série",
    "Connected to {{-port}}": "Connecté à {{-port}}",
    "Console": "Console",
    "Clear all": "Tout effacer",
    "Min": "Min",
    "Max": "Max",
    "Dimension": "Dimension",
    "Sent": "Envoyé",
    "Received": "Reçu",
    "Start Time": "Temps au démarrage",
    "Elapsed Time": "Temps écoulé",
    "Finish Time": "Temps final",
    "Remaining Time": "Temps restant",
    "Laser": "Laser",
    "Laser On": "Laser Actif",
    "Laser Off": "Laser eteint",
    "Save (SD Card)": "sauver (carte SD)",
    "Hide": "Cacher",
    "Show": "Montrer",
    "Laser Test": "Test Laser",
    "Power (%)": "Batterie (%)",
    "Test duration": "Test de duration",
    "ms": "ms",
    "Maximum value": "Valeur maximale",
    "Determines how fast the machine moves when it’s not engraving.": "Détermine la vitesse à laquelle la machine bouge hors gravure.",
    "Determines how fast the machine moves when it’s engraving.": "Détermine la vitesse à laquelle la machine bouge pendant gravure.",
    "Dwell Time": "Temps Dwell",
    "Determines how long the laser keeps on when it’s engraving a dot.": "Détermine le temps que le laser met pour graver un point.",
    "B&W": "B&W",
    "Set the proportion of the black color based on the original color of the image.": "Fixer la proportion de la couleur noire basé sur la couleur originale de l'image.",
    "Line Direction": "Line Direction",
    "Select the direction of the engraving path.": "Selectionner la direction du chemin de découpage.",
    "Horizontal": "Horizontal",
    "Vertical": "Vertical",
    "Diagonal": "Diagonale",
    "Diagonal2": "Diagonale2",
    "Choose an algorithm": "Choisir un algorithme",
    "Density": "Densité",
    "Contrast": "Contraste",
    "The difference between the lightest color and the darkest color.": "La différentre entre la couleur la plus claire et la plus sombre.",
    "Brightness": "Luminosité",
    "The engraved picture is brighter when this value is bigger.": "L'image gravée est plus claire quand sa valeur est plus grande.",
    "White Clip": "Clip Blanc",
    "Set the threshold to turn the color that is not pure white into pure white.": "Fixer le seuil pour faire passer de la couleur blanche à la couleur blanche pure.",
    "Algorithm": "Algorithme",
    "Choose an algorithm for image processing.": "Choisir un  algorithm pour le traitement d'image.",
    "Preview Settings": "Paramètres d'aperçu",
    "(default image)": "(image par défaut)",
    "Parse Image Error": "Erreur d'analyse d'image",
    "Failed to parse image file {{}}": "échec d'analyse du fichier image {{}}",
    "GREYSCALE": "échelle des gris",
    "VECTOR": "VECTEUR",
    "TEXT": "TEXTE",
    "Source Type": "Type de source",
    "Raster": "Balayage",
    "SVG": "SVG",
    "Upload Image": "Charger une Image",
    "Middle": "Milieu",
    "Center": "Centre",
    "Bottom Left": "En bas à gauche",
    "Bottom Middle": "En bas au milieu",
    "Bottom Right": "En bas à droite",
    "Top Left": "Haut à gauche",
    "Top Middle": "Haut au milieu",
    "Top Right": "Hautà droite",
    "Text": "Texte",
    "Font": "Police",
    "Choose font": "Choisir une police",
    "Enter the font size in pt (points).": "Entrer la taille de police en pt (points).",
    "Line Height": "Hauteur de ligne",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "Régler la distance entre chaque ligne du texte. La valeur que vous entrz est le multiple de la taille de police.",
    "Align the text in different lines to either the left or right or in the center horizontally.": "Aligner le text de ligne différentes soit à gauche ou à droite au au centre horizonallement.",
    "Anchor": "Ancre",
    "Find the anchor of the text to correspond to the (0, 0) coordinate.": "Trouver l'ancre du texte pour coorespondre aux coordonnées (0, 0)",
    "Impurity Size": "Taille de l'impureté",
    "Determines the minimum size of impurity which allows to be showed.": "Determine la taille minimale de l'impureté qui permet d'être affiché.",
    "Invert": "Inverser",
    "Inverts black to white and vise versa.": "Inverser le noir par le blanc et vice versa.",
    "Optimize Path": "Optimise le Chemin",
    "Optimizes the path based on the proximity of the lines in the image.": "Optimise le chemin basé sur la proximité des lines dans une image.",
    "Fine Tune Work Origin": "Accordeur précis d'Origine du travail",
    "How Fine Tune Work Origin Works": "Comment l'accordeur précis de l'origine du travail fonctionne",
    "Click": "Cliquer",
    "Focus": "focus",
    "and use": "et utilisez",
    "Jog Pad": "Début du remplissage",
    "Generate and Load G-code": "générer et charger un G-code",
    "and the G-code is automatically generated and loaded.": "et le G-code est automatiquement généré et chargé.",
    "to start laser cutting.": "pour commencer à couper",
    "Determines how fast the machine moves when it’s working.": "Determiner à quelle vitesse la machine bouge lorsqu'elle fonctionne.",
    "Power": "Alimentation",
    "Power to use when laser is working.": "Alimentation à utiliser lorsque le laser fonctionne",
    "Enable 3D View": "Activer 3D View.",
    "Disable 3D View": "Désactiver 3D View.",
    "Hide Coordinate System": "Cacher le Système de Coordonnées.",
    "Show Coordinate System": "Afficher le Système de Coordonnées.",
    "File folder": "Dossier du Fichier",
    "{{extname}} File": "Fichier {{extname}}",
    "File": "Fichier",
    "Reset Position": "Position Initiale",
    "Zoom In": "Zoom +",
    "Zoom Out": "Zoom -",
    "Controller State": "Etat du Controleur",
    "Controller Settings": "Paramètres du Controleur",
    "3D Printer": "Imprimante 3D",
    "CNC": "CNC",
    "Set": "Ensemble",
    "Save": "Sauver",
    "F": "F",
    "Adjust feedrate percentage, which applies to moves along all axis.": "Adjuster le pourcentage de vitesse de travail, qui s'applique aux mouvements le long de tous les axes.",
    "Nozzle Temperature": "Température de l'embout",
    "Bed Temperature": "Température de lit",
    "Tool Head Power": "Puissance de l'outi de tête",
    "ON": "ACTIF",
    "OFF": "Eteint",
    "Quality": "Qualité",
    "Shell": "Coquille",
    "Infill": "Remplissage",
    "Speed": "Vitesse",
    "Retract & Z Hop": "Retracter & saut Z",
    "Surface": "Surface",
    "Recommended": "Recommendé",
    "Customize": "Personaliser",
    "Fast Print": "impression rapide",
    "Normal Quality": "Qualité normale",
    "High Quality": "Haute qualité",
    "Show Details": "Montrer les détails",
    "Profile": "Profile",
    "Printing Settings": "Paramètres d'impression",
    "Material & Support": "Matériel & Support",
    "Custom Material": "Matériel personnalisé",
    "Adhesion": "Adhésion",
    "Support": "Support",
    "Touch Building Plate": "Plaques de construction tactiles",
    "Everywhere": "Partout",
    "Slicing {{progress}}%": "Découpage {{progrès}}%",
    "Slice error: ": "",
    "Parsing G-code...": "Analyse du G-code...",
    "Loading model...": "Chargement du modèle...",
    "Pre-processing model...": "Pré-traitement du modèle...",
    "Preparing for slicing...": "Preparation du découpage...",
    "Upload File": "Upload Fichier",
    "G-code not loaded": "G-code non chargé",
    "Projection": "Projection",
    "Perspective Projection": "Projection Perspective",
    "Orthographic Projection": "Projection Orthographique",
    "Scene Objects": "Objets Scene",
    "Display G-code Filename": "Afficher le nom de fichier G-code",
    "Hide Toolhead": "Cacher Tooldhead",
    "Show Toolhead": "Afficher Toolhead",
    "3D rendering...": "Rendu 3D…",
    "Move the camera": "Bouger la caméra",
    "Rotate the camera": "Tourner la caméra",
    "Watch Directory": "Voir le Repertoire",
    "Name": "Nom",
    "Type": "Type",
    "Load G-code": "Charger G-code",
    "Upload G-code": "Upload G-code",
    "Run": "Exécuter",
    "Pause": "Pause",
    "Stop": "STOP",
    "Webcam": "Webcam",
    "Edit": "Modifier",
    "Enable": "Activer",
    "Disable": "Désactiver",
    "Webcam Settings": "Paramètres Webcam",
    "Media Source": "Source Média",
    "Use a built-in camera or a connected webcam": "Utiliser une caméra interne ou une webcam connectée",
    "Use a M-JPEG stream over HTTP": "Utiliser un stream M-JPEG plutôt que HTTP",
    "Webcam is off": "Webcam éteinte",
    "Rotate Left": "Rotation Gauche",
    "Rotate Right": "Rotation Droite",
    "Flip Horizontally": "Rotation Horizontale",
    "Flip Vertically": "Rotation Verticale",
    "Crosshair": "Viseur",
    "Note: If you are using the CNC Carving Module, make sure the carving bit will not run into the fixtures before you use this feature.": "remarque: si vous utilisez le module de découpage CNC, assurez vous que le bout de gravure ne va pas percuter les appareil avant d'utiliser cette fonction",
    "Enter the text you want to engrave. The maximum length of the text is 125 mm. When the text is too long, it will be shrunk automatically. Start a new line manually according to your needs.": "Entrer le texte que vous voulez graver. La longueur maximum du texte est de  125 mm. Lorsque le texte est trop long, il sera automatiquement rétréci. Commencez une nouvelle ligne manuellement selon vos besoins.",
    "Setting work origin is essentially finding the best place for the engraved image in the X and Y directions and determining the distance (Z Offset) between the Engraving & Carving Platform and the Laser Module to acquire the smallest laser dot on the material for the most efficient use of the laser power and the best result. For the 200mW Laser Engraving Module, the Z Offset can be set by judging the size of the laser dot by eyes with low power. However, for the 1600mW Laser Cutting Module, this method is less accurate as the laser dot is too strong and less interpretable. To set the Z Offset more accurately, we can move the module to the position that is close to the optimal Z Offset (Offset A). The software will test the results from a few positions next to Offset A on the same material. The best result determines the best Z Offset.": "Le réglage de l'origine de travail est essentiellement de trouver le meilleur emplacement pour graver une image dans les direction X et Y et de déterminer la distance (Z Offset) entre les plateformes de gravure & de découpage et de permettre au module Laser d'effectuer le point laser le plus petit sur le matériel pour une utilisation plus efficace de la puissance du  laser et pour de meilleurs résultats. Pour le module de gravure laser 200mW, le Z Offset peut être régler en jugeant la taille du point laser à l'oeil nu avec une faible puissance. Cependant, pour le module de découpage laser 1600mW, cette méthode est moins précise puisque le point laser est trop fort et moins interprétable. Pour régler plus précisément le Z Offset, on peut déplacer le  module vers la position proche du Z Offset optimal (Offset A). Le logiciel  testera les résultats à partir de quelques positions proche du Offset A sur le même matériau. Le meilleur résultat détemrine le meilleur Z Offset.",
    "in the Axes section to move the Laser Cutting Module to the position that is close to the optimal Z Offset (just like how you do with the 200mW Laser Engraving Module).": "dans la section Axes pour déplacer le module de découpage Laser vers la position qui est proche du Z Offset optimal (tout comme vous le feriez avec le module de gravure laser 200mW ).",
    "Set Work Speed and Power based on the material you are using. If you are using a piece of 1.5 mm wood sheet, it’s recommended to set the Work Speed to a value between 80 mm/s and 120 mm/s and set the Power to 100%.": "Régler la vitesse et puissance du travail basé sur le matériel que vous utilisez. Si vous utilisez une pièce de feuille en bois de 1.5 mm , il est recommandé de régler la vitesse  de tavail dans une valeur comprise entre 80 mm/s et 120 mm/s et de régler la puissance à 100%.",
    "Choose the position that can cut the material the most smoothly or engrave the thinnest line and the software will set it as Z Offset. In this example, -2.0 should be the Z Offset.": "Choisir la  position qui peut couper le materiel le plus souplement ou graver la ligne la plus fine et le logiciel se réglera comme Z Offset. Dans cet exemple, -2.0 devrait être le Z Offset.",
    "Parse File Error": "erreur d'analyse de fichier",
    "Failed to parse image file {{filename}}": "échec d'analyse du fichier image  {{nomdefichier}}",
    "Tool Head Status (M3)": "Status de l'outil de tête (M3)",
    "Skirt": "Bordure",
    "Brim": "Bord",
    "Raft": "Raft",
    "Normal": "Normal",
    "Both": "Les deux",
    "Warning": "avertissement",
    "Slicing completed.": "découpage effectué",
    "Parsed G-code successfully.": "Analyse G-code réussie",
    "Failed to parse G-code: ": "",
    "Loaded model successfully.": "Chargement du modèle réussi",
    "Failed to load model.": "échec de chargement du modèle.",
    "Rendered G-code successfully.": "Rendu G-code réussi",
    "Tabs": "Tablatures",
    "Upload": "",
    "Find the anchor of the image to correspond to the (0, 0) coordinate.": "",
    "Choose algorithms": "",
    "New Update Available": "Nouvelles mises à jour disponibles",
    "A web-based interface for Snapmaker which is able to do 3D Printing, laser engraving and CNC carving.": "",
    "Determines how fast the tool moves on the material.": "Détermine la vitesse de déplacement de l'outil sur le matériel.",
    "Select the type of the image you want to upload. Raster supports PNG and JPEG images, while SVG only supports SVG images. The Raster images will be transferred into SVG automatically.": "Selectionner le thpe d'image que vous voulez charger. La trame accepte les images PNG and JPEG, alors que SVG n'accepte que les images SVG. Les images de la trame seront automatiquement transféré vers SVG",
    "Select a word font or upload a font from your computer. WOFF, TTF, OTF fonts are supported.": "",
    "Fill Density": "",
    "Determines how fine and smooth the engraved picture will be. The bigger this value is, the better quality you will get. The range is 1-10 dot/mm and 10 is recommended.": "",
    "Center Left": "",
    "Center Right": "",
    "Center Selected Model": "",
    "Delete Selected Model": "",
    "Duplicate Selected Model": "",
    "Reset Selected Model Transformation": "",
    "Clear Build Plate": "",
    "Arrange All Models": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the text will be engraved without fill.": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the SVG image will be engraved without fill.": "",
    "Next": "",
    "Clip": "",
    "Passes": "",
    "Pass Depth": "",
    "STL File (Binary) (*.stl)": "",
    "STL File (ASCII) (*.stl)": "",
    "OBJ File (*.obj)": "",
    "Export Models": "",
    "Only SVG files are supported.": "",
    "Drop an SVG file here.": "",
    "Only STL/OBJ files are supported.": "",
    "Drop an STL/OBJ file here.": "",
    "Only G-code files are supported": "",
    "Drop a G-code file here.": "",
    "When enabled, the printer will run the G-code multiple times automatically according to the below settings. This feature helps you cut materials that can't be cut with only one pass.": "",
    "Determines how many times the printer will run the G-code automatically.": "",
    "Determines how much the laser module will be lowered after each pass.": "",
    "Fixed Power": "",
    "Multi-pass": "",
    "When enabled, the power used to engrave this image will be set in the G-code, so it is not affected by the power you set in Workspace.": "",
    "Fill": "",
    "Only {{accept}} files are supported.": "",
    "Drop an image file here.": "",
    "Lay Flat Selected Model": ""
}
