{
    "Generate Support": "Генерация поддержек",
    "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "Генерация структур для поддержки нависающих частей модели. Без этих структур такие части будут складываться во время печати.",
    "Build Plate Adhesion Type": "Тип прилипания к столу",
    "Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.": "Различные варианты, которые помогают улучшить прилипание пластика к столу. Кайма добавляет однослойную плоскую область вокруг основания печатаемой модели, предотвращая её деформацию. Подложка добавляет толстую сетку с крышей под модель. Юбка - это линия, печатаемая вокруг модели, но не соединённая с ней.",
    "Initial Layer Line Width": "Ширина линии первого слоя",
    "Multiplier of the line width on the first layer. Increasing this could improve bed adhesion.": "Множитель для ширины линии первого слоя. Увеличение значения улучшает прилипание к столу.",
    "Spiralize Outer Contour": "Спирально печатать внешний контур",
    "Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.": "Спирально сглаживает движение по оси Z. Во время печати происходит постоянное увеличение по оси Z. Этот параметр превращает модель в одностенный объект с крепким дном. Параметр можно использовать только когда каждый слой состоит из одной части модели.",
    "Surface Mode": "Поверхностный режим",
    "Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. \"Surface\" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. \"Both\" prints enclosed volumes like normal and any remaining polygons as surfaces.": "Рассматривать модель только в виде поверхности или как объёмы со свободными поверхностями. При нормальном режиме печатаются только закрытые объёмы. В режиме \"Поверхность\" печатается одиночная стенка по границе объекта, без заполнения, без верхних и нижних оболочек. В режиме \"Оба варианта\" печатаются закрытые объёмы как нормальные, а любые оставшиеся полигоны как поверхности.",
    "Travel Speed": "Скорость перемещения",
    "The speed at which travel moves are made.": "Скорость, с которой выполняется перемещение.",
    "Top/Bottom Speed": "Скорость крышки/дна",
    "The speed at which top/bottom layers are printed.": "Скорость, на которой печатаются слои крышки/дна.",
    "Inner Wall Speed": "Скорость печати внутренних стенок",
    "The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.": "Скорость, на которой происходит печать внутренних стенок. Печать внутренних стенок на скорости, большей скорости печати внешней стенки, ускоряет печать. Отлично работает, если значение скорости находится между скоростями печати внешней стенки и скорости заполнения.",
    "Outer Wall Speed": "Скорость печати внешней стенки",
    "The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.": "Скорость, на которой происходит печать внешних стенок. Печать внешней стенки на пониженной скорости улучшает качество поверхности модели. Однако, при большой разнице между скоростями печати внутренних и внешних стенок возникает эффект, негативно влияющий на качество.",
    "Infill Speed": "Скорость заполнения",
    "The speed at which infill is printed.": "Скорость, на которой печатается заполнение.",
    "Print Speed": "Скорость печати",
    "The speed at which printing happens.": "Скорость, на которой происходит печать.",
    "Retraction Speed": "Скорость отката",
    "The speed at which the filament is retracted and primed during a retraction move.": "Скорость, с которой материал будет извлечён и возвращён обратно при откате.",
    "Retraction Distance": "Величина отката",
    "The length of material retracted during a retraction move.": "Длина нити материала, которая будет извлечена по время отката.",
    "Retract at Layer Change": "Откат при смене слоя",
    "Retract the filament when the nozzle is moving to the next layer.": "Откат нити при перемещении сопла на следующий слой.",
    "Enable Retraction": "Разрешить откат",
    "Retract the filament when the nozzle is moving over a non-printed area. ": "Откат нити при движении сопла вне зоны печати. ",
    "Infill Density": "Плотность заполнения",
    "Adjusts the density of infill of the print.": "Отрегулируйте плотность заполнения при печати.",
    "Bottom Thickness": "Толщина дна",
    "The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.": "Толщина дна при печати. Это значение, разделённое на высоту слоя, определяет количество слоёв в дне.",
    "Top Thickness": "Толщина крышки",
    "The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.": "Толщина крышки при печати. Это значение, разделённое на высоту слоя, определяет количество слоёв в крышке.",
    "Wall Thickness": "Толщина стенки",
    "The thickness of the walls in the horizontal direction. This value divided by the wall line width defines the number of walls.": "Толщина внешних стенок в горизонтальном направлении. Это значение, разделённое на ширину линии стенки, определяет количество стенок.",
    "Initial Layer Height": "Высота первого слоя",
    "The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.": "Высота первого слоя в миллиметрах. Более толстый слой упрощает прилипание пластика к столу.",
    "Layer Height": "Высота слоя",
    "The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.": "Высота каждого слоя в миллиметрах. Большие значения приводят к быстрой печати при низком разрешении, малые значения приводят к замедлению печати с высоким разрешением.",
    "Z Hop Height": "Высота поднятия оси Z",
    "The height difference when performing a Z Hop.": "Расстояние, на которое приподнимается ось Z.",
    "Z Hop When Retracted": "Поднятие оси Z при откате",
    "Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.": "При выполнении отката между соплом и печатаемой деталью создаётся зазор. Это предотвращает возможность касания сопла частей детали при его перемещении, снижая вероятность смещения детали на столе.",
    "Initial Layer Travel Speed": "Скорость перемещений на первом слое",
    "The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.": "Скорость перемещений на первом слое. Малые значения помогают предотвращать отлипание напечатанных частей от стола. Значение этого параметра может быть вычислено автоматически из отношения между скоростями перемещения и печати.",
    "Initial Layer Print Speed": "Скорость первого слоя",
    "The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.": "Скорость печати первого слоя. Пониженное значение помогает улучшить прилипание материала к столу.",
    "Has Heated Build Plate": "Имеет подогреваемый стол",
    "Whether the machine has a heated build plate present.": "Имеет ли принтер подогреваемый стол.",
    "Printing Temperature": "Температура сопла",
    "The temperature used for printing.": "Температура, используемая при печати.",
    "Printing Temperature Initial Layer": "Температура печати первого слоя",
    "The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.": "Температура при печати первого слоя. Установите в 0 для отключения специального поведения на первом слое.",
    "Final Printing Temperature": "Конечная температура печати",
    "The temperature to which to already start cooling down just before the end of printing.": "Температура, до которой можно начать охлаждать сопло, перед окончанием печати.",
    "Build Plate Temperature": "Температура стола",
    "The temperature used for the heated build plate. If this is 0, the bed will not heat up for this print.": "Температура, используемая для горячего стола. Если указан 0, то горячий стол не нагревается при печати.",
    "Build Plate Temperature Initial Layer": "Температура стола для первого слоя",
    "The temperature used for the heated build plate at the first layer.": "Температура стола, используемая при печати первого слоя.",
    "Diameter": "Диаметр",
    "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "Укажите диаметр используемой нити.",
    "Flow": "Поток",
    "Flow compensation: the amount of material extruded is multiplied by this value.": "Компенсация потока: объём выдавленного материала умножается на этот коэффициент.",
    "Records: {{from}} - {{to}} / {{total}}": "Запись: {{from}} - {{to}} / {{total}}",
    "Records: {{total}}": "Запись: {{total}}",
    "{{pageLength}} per page": "{{pageLength}} на страницу",
    "This is an alpha feature that helps you get started with CNC Carving. Make sure you": "Это альфа-функция, которая помогает вам начать работу Резкой с ЧПУ. Убедись, что вы",
    "Read This First - Safety Information": "Сперва прочтите это - информация о безопасности",
    "before any further instructions.": "перед любыми дальнейшими инструкциями.",
    "Don't show again in current session": "Больше не показывать на текущей сессии",
    "Upload SVG File": "Загрузить файл SVG",
    "Size": "Размер",
    "Work Speed": "Скорость работы",
    "Plunge Speed": "Скорость погружения",
    "Jog Speed": "Толчковая скорость",
    "Grey Level": "Уровень серого",
    "Target Depth": "Глубина цели",
    "Cutting Diameter": "Диаметр резки",
    "Stop Height": "Стоп-высота",
    "Command succeeded": "Команда выполнена успешно",
    "Command failed ({{err}})": "Не удалось выполнить команду ({{err}})",
    "Options": "Опции",
    "Command": "Команда",
    "Show notifications": "Показать уведомления",
    "Store": "Хранить",
    "Server has halted intentionally by you": "Сервер был заблокирован лично вами",
    "Emergency stop triggered, Please restart the Snapmaker then reconnect.": "Сработала аварийная остановка, перезапустите Snapmaker, затем снова подключитесь.",
    "Reload": "Перезагрузить",
    "Reset": "Сбросить",
    "STOP": "СТОП",
    "User Manual & FAQ": "Руководство пользователя и часто задаваемые вопросы",
    "Forum": "Форум",
    "Authentication failed.": "Ошибка аутентификации.",
    "Sign in to {{name}}": "Войдите в {{name}}",
    "Username": "Имя пользователя",
    "Password": "Пароль",
    "Sign In": "Войти в систему",
    "Forgot your password?": "Забыли пароль?",
    "Learn more": "Узнать больше",
    "Downloads": "Загрузки",
    "Report an issue": "Сообщить о проблеме",
    "Checking for updates...": "Проверка обновлений...",
    "A new version of {{name}} is available": "Доступна новая версия {{name}}",
    "Version {{version}}": "Версия {{version}}",
    "Latest version": "Последняя версия",
    "You already have the newest version of {{name}}": "У вас уже есть новая версия {{name}}",
    "Account": "Аккаунт",
    "New": "Новый",
    "Account status": "Статус аккаунта",
    "Confirm Password": "Подтвердите Пароль",
    "Cancel": "Отмена",
    "OK": "ОК",
    "An unexpected error has occurred.": "Произошла непредвиденная ошибка.",
    "Loading...": "Загрузка…",
    "No data to display": "Нет данных для отображения",
    "Enabled": "Включено",
    "Disabled": "Отключено",
    "Date Modified": "Дата изменена",
    "Action": "Действие",
    "Edit Account": "Редактировать аккаунт",
    "Delete Account": "Удалить аккаунт",
    "Settings": "Настройки",
    "My Account": "Мой аккаунт",
    "Are you sure you want to delete the account?": "Вы действительно хотите удалить аккаунт?",
    "Update": "Обновить",
    "Old Password": "Старый пароль",
    "Change Password": "Изменить пароль",
    "New Password": "Новый пароль",
    "Commands": "Команды",
    "Title": "Название",
    "and more...": "и более...",
    "Delete": "Удалить",
    "Are you sure you want to delete this item?": "Вы уверены, что хотите удалить этот элемент?",
    "Events": "События",
    "Event": "Событие",
    "Choose an event": "Выбрать событие",
    "Startup (System only)": "Запуск (только система)",
    "Open a serial port (System only)": "Откройте последовательный порт (только система)",
    "Close a serial port (System only)": "Закройте последовательный порт (только система)",
    "G-code: Load": "G-код: загрузка",
    "G-code: Unload": "G-код: разгрузка",
    "G-code: Start": "G-код: старт",
    "G-code: Stop": "G-код: Стоп",
    "G-code: Pause": "G-код: Пауза",
    "G-code: Resume": "G-код: Возобновить",
    "Feed Hold": "Удержание подачи",
    "Cycle Start": "Начало цикла",
    "Homing": "Возвращение домой",
    "Sleep": "Спящий режим",
    "Trigger": "Запуск",
    "Choose an trigger": "Выбрать и запустить",
    "System": "Система",
    "G-code": "G-код",
    "Startup": "Запуск",
    "Open a serial port": "Открыть последовательный порт",
    "Close a serial port": "Закрыть последовательный порт",
    "Automatically check for updates": "Автоматическая проверка обновлений",
    "Language": "Язык",
    "Save Changes": "Сохранить изменения",
    "General": "Общее",
    "Workspace": "Рабочее пространство",
    "About": "Информация о",
    "Restore Defaults": "Восстановить настройки по умолчанию",
    "Are you sure you want to restore the default settings?": "Вы действительно хотите восстановить настройки по умолчанию?",
    "The account name is already being used. Choose another name.": "Имя аккаунта уже используется. Выберите другое имя.",
    "Passwords do not match.": "Пароли не совпадают.",
    "3D Printing G-code Generator": "3D-печать Генератор G-кода",
    "Laser G-code Generator": "Генератор лазерного G-кода",
    "CNC G-code Generator": "Генератор G-кода с ЧПУ",
    "Fork Widget": "Разблокировать Виджет",
    "Are you sure you want to fork this widget?": "Вы действительно хотите разблокировать этот виджет?",
    "Remove Widget": "Удалить виджет",
    "Are you sure you want to remove this widget?": "Вы действительно хотите удалить этот виджет?",
    "On": "Вкл.",
    "Off": "Откл.",
    "Visualizer Widget": "Визуальный виджет",
    "This widget visualizes a G-code file and simulates the tool path.": "Этот виджет визуализирует файл G-кода и имитирует шаги инструмента.",
    "Connection Widget": "Виджет подключения",
    "This widget lets you establish a connection to a serial port.": "Этот виджет позволяет установить соединение с последовательным портом.",
    "Console Widget": "Консольный виджет",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "Этот виджет позволяет читать и записывать данные на контроллер ЧПУ, подключенный к последовательному порту.",
    "Grbl Widget": "Виджет Grbl",
    "This widget can view Grbl state and settings.": "Этот виджет может просматривать состояние и настройки Grbl.",
    "Marlin Widget": "Виджет Marlin",
    "This widget can view Marlin state and settings.": "Этот виджет может просматривать состояние и настройки Marlin.",
    "Smoothie Widget": "Виджет Smoothie",
    "This widget can view Smoothie state and settings.": "Этот виджет может просматривать состояние и настройки Smoothie.",
    "TinyG Widget": "Виджет TinyG",
    "This widget can view TinyG state and settings.": "Этот виджет может просматривать состояние и настройки TinyG.",
    "Axes Widget": "Виджет Axes",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Этот виджет показывает позицию XYZ. Он включает в себя управление толчковым движением, возвращением домой и обнуление осей.",
    "G-code Widget": "Виджет G-кода",
    "This widget shows the current status of G-code commands.": "Этот виджет показывает текущее состояние команд G-кода.",
    "Laser Widget": "Лазерный виджет",
    "This widget allows you control laser intensity and turn the laser on/off.": "Этот виджет позволяет контролировать интенсивность лазера и включать / выключать лазер.",
    "Webcam Widget": "Виджет веб-камеры",
    "This widget lets you monitor a webcam.": "Этот виджет позволяет вам контролировать веб-камеру.",
    "Widgets": "Виджеты",
    "Server has stopped working": "Сервер перестал работать",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "Проблема привела к тому, что сервер перестал работать правильно. Проверьте статус сервера и повторите попытку.",
    "Close": "Закрыть",
    "This field is required.": "Это поле обязательно к заполнению.",
    "Passwords should be equal.": "Пароли должны быть совпадать.",
    "mm": "мм",
    "in": "дюйм",
    "Axis": "Ось",
    "Work Position": "Рабочая позиция",
    "Go To Work Zero On X Axis (G0 X0)": "Перейдите в «Рабочий нуль» на оси X (G0 X0)",
    "Zero Out Temporary X Axis (G92 X0)": "Нулевая временная ось X (G92 X0)",
    "Go To Work Zero On Y Axis (G0 Y0)": "Перейдите в «Рабочий нуль» на оси Y (G0 X0)",
    "Zero Out Temporary Y Axis (G92 Y0)": "Нулевая временная ось Y (G92 X0)",
    "Go To Work Zero On Z Axis (G0 Z0)": "Перейдите в «Рабочий нуль» на оси Z (G0 X0)",
    "Zero Out Temporary Z Axis (G92 Z0)": "Нулевая временная ось Z (G92 X0)",
    "Axes": "Сокращения",
    "Keypad jogging": "Бег по клавиатуре",
    "Expand": "Расширить",
    "Collapse": "Коллапс",
    "More": "Больше",
    "Enter Full Screen": "Войти в полноэкранный режим",
    "Exit Full Screen": "Выйти из полноэкранного режима",
    "User Defined": "Пользователь Определен",
    "Custom distance for every move operation": "Настроенное расстояние для каждой операции перемещения",
    "Increase custom distance by one unit": "Увеличить пользовательское расстояние на единицу",
    "Decrease custom distance by one unit": "Уменьшить пользовательское расстояние на единицу",
    "Move X- Y+": "Переместить X- Y+",
    "Move Y+": "Переместить Y+",
    "Move X+ Y+": "Переместить X+ Y+",
    "Move Z+": "Переместить Z+",
    "Move X-": "Переместить X-",
    "Move To XY Zero (G0 X0 Y0)": "Переместить к XY 0 (G0 X0 Y0)",
    "Move X+": "Переместить X+",
    "Move To Z Zero (G0 Z0)": "Переместить к Z 0 (G0 Z0)",
    "Move X- Y-": "Переместить X- Y-",
    "Move Y-": "Переместить Y-",
    "Move X+ Y-": "Переместить X+ Y-",
    "Move Z-": "Переместить Z-",
    "Right": "Право",
    "Left": "Лево",
    "Up": "Верх",
    "Down": "Низ",
    "Page Up": "Листать вверх",
    "Page Down": "Листать вниз",
    "0.1x Move": "0.1x Переместить",
    "Alt": "Alt",
    "10x Move": "10x Переместить",
    "⇧ Shift": "⇧ Shift",
    "Run Boundary": "Граница выполнения",
    "Click to check the boundary of the image to be engraved.": "Нажмите, чтобы проверить границу изображения, которое будет обрезано.",
    "Go To Work Origin": "Перейти к началу работы",
    "Move the head to the last saved work origin.": "Перейти в последнюю сохраненную исходную позицию.",
    "Set Work Origin": "Задать оригинал работы",
    "Set the current position of the head as the work origin.": "Установить текущее положение головки на оригинал работы.",
    "Shuttle Settings": "Настройки Shuttle",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "Диапазон скорости подачи: {{min}} - {{max}} мм / мин",
    "Repeat Rate: {{hertz}}Hz": "Частота повторения: {{hertz}} Гц",
    "60 Times per Second": "60 раз в секунду",
    "45 Times per Second": "45 раз в секунду",
    "30 Times per Second": "30 раз в секунду",
    "15 Times per Second": "15 раз в секунду",
    "10 Times per Second": "10 раз в секунду",
    "5 Times per Second": "5 раз в секунду",
    "2 Times per Second": "2 раз в секунду",
    "Once Every Second": "Один раз в секунду",
    "Distance Overshoot: {{overshoot}}x": "Удаленная перегрузка: {{overshoot}} x",
    "Determines how fast the tool moves when it’s not carving.": "Определяет, насколько быстро инструмент перемещается, когда он не режет.",
    "Determines how fast the tool feeds into the material.": "Определяет, как быстро инструмент погружается в материал.",
    "Generate G-code": "Сгенерировать G-код",
    "Output": "Вывод",
    "Load G-code to Workspace": "Загрузить G-код в рабочую область",
    "Export G-code to file": "Экспорт G-кода в файл",
    "Carving Path": "Резьба Путь",
    "Carve Path": "Проложить путь",
    "Select a carve path:": "Выберите путь вырезания:",
    "Carve along the contour of the image.": "Вырезайте по контуру изображения.",
    "Carve along the shape of the image.": "Вырезайте по форме изображение.",
    "Outline": "Контур",
    "On the Path": "На дорожке",
    "Choose carve path": "Выбрать путь вырезания",
    "Resolution": "Разрешение",
    "The detected resolution of the loaded image.": "Обнаруженное разрешение загруженного изображения.",
    "Size (mm)": "Размер (мм)",
    "Enter the size of the engraved picture. The size cannot be larger than 125 x 125 mm or the size of your material.": "Введите размер вырезанного изображения. Размер не может быть больше 125 х 125 мм или размера вашего материала.",
    "Enter the depth of the carved image. The depth cannot be deeper than the flute length.": "Введите глубину вырезанного изображения. Глубина не может быть глубже, чем длина выемки.",
    "Step Down": "Шаг вниз",
    "Enter the depth of each carving step.": "Введите глубину каждого этапа резки.",
    "Jog Height": "Высота подъема",
    "The distance between the tool and the material when it’s not carving.": "Расстояние между инструментом и материалом, если он не вырезан.",
    "The distance between the tool and the material when the machine stops.": "Расстояние между инструментом и материалом при остановке машины.",
    "Alignment": "Выравнивание",
    "None": "Ни один",
    "Tab Height": "Высота вкладок",
    "Enter the height of the tabs.": "Введите высоту вкладок.",
    "Tab Space": "Пробел",
    "Enter the space between any two tabs.": "Введите пробел между двумя вкладками.",
    "Tab Width": "Ширина вкладок",
    "Enter the width of the tabs.": "Введите ширину вкладок.",
    "Preview": "Предварительный просмотр",
    "Carving Tool": "Резьбовой инструмент",
    "Carving V-Bit": "Режущий V-бит",
    "Flat End Mill": "Фрезерный станок",
    "Ball End Mill": "Шаровая мельница",
    "Use Other Bit": "Использовать другой кусок",
    "Enter the diameter of the widest part of the blade. Please note that it is not the shank diameter.": "Введите диаметр самой широкой части лезвия. Обратите внимание, что это не диаметр стержня.",
    "For the carving bits that we provide, please enter the following value:": "Для резьбовых битов, которые мы предоставляем, введите следующее значение:",
    "Point Angle": "Точечный угол",
    "Enter the angle of the blade.": "Введите угол лезвия.",
    "fullscreen": "полноэкранный",
    "Manufacturer: {{manufacturer}}": "Производитель: {{manufacturer}}",
    "Port": "Порт",
    "No ports available": "Нет доступных портов",
    "Choose a port": "Выбрать порт",
    "Refresh": "Обновить",
    "Open": "Открыть",
    "Error opening serial port '{{- port}}'": "Ошибка открытия последовательного порта '{{- port}}'",
    "Connection": "Соединение",
    "No serial connection": "Нет последовательного подключения",
    "Connected to {{-port}}": "Подключено к {{-port}}",
    "Console": "Консоль",
    "Clear all": "Очистить все",
    "Min": "Мин",
    "Max": "Макс",
    "Dimension": "Измерение",
    "Sent": "Отправлено",
    "Received": "Получено",
    "Start Time": "Время начала",
    "Elapsed Time": "Пройденное время",
    "Finish Time": "Время окончания",
    "Remaining Time": "Оставшееся время",
    "Laser": "Лазер",
    "Laser On": "Лазер Вкл.",
    "Laser Off": "Лазер Выкл.",
    "Save (SD Card)": "Сохранить (карта SD)",
    "Hide": "Скрыть",
    "Show": "Показать",
    "Laser Test": "Тест Лазера",
    "Power (%)": "Мощность (%)",
    "Test duration": "Продолжительность теста",
    "ms": "мс",
    "Maximum value": "Максимальное значение",
    "Determines how fast the machine moves when it’s not engraving.": "Определяет, насколько быстро движется машина, когда она не режет.",
    "Determines how fast the machine moves when it’s engraving.": "Определяет, насколько быстро движется машина, когда она режет.",
    "Dwell Time": "Время ожидания",
    "Determines how long the laser keeps on when it’s engraving a dot.": "Определяет длительность работы лазера, когда он гравирует точку.",
    "B&W": "Черно-белый",
    "Set the proportion of the black color based on the original color of the image.": "Установите пропорцию черного цвета в зависимости от исходного цвета изображения.",
    "Line Direction": "Направление линии",
    "Select the direction of the engraving path.": "Выбрать направление пути гравюры.",
    "Horizontal": "Горизонтальный",
    "Vertical": "Вертикальный",
    "Diagonal": "Диагональ",
    "Diagonal2": "Диагональ2",
    "Choose an algorithm": "Выбрать алгоритм",
    "Density": "Плотность",
    "Contrast": "Контраст",
    "The difference between the lightest color and the darkest color.": "Разница между самым светлым цветом и самым темным цветом.",
    "Brightness": "Яркость",
    "The engraved picture is brighter when this value is bigger.": "Вырезанное изображение ярче, когда это значение больше.",
    "White Clip": "Белый клип",
    "Set the threshold to turn the color that is not pure white into pure white.": "Установите пороговое значение, чтобы не сильно белого цвет стал белым.",
    "Algorithm": "Алгоритм",
    "Choose an algorithm for image processing.": "Выбрать алгоритм обработки изображений.",
    "Preview Settings": "Настройка предварительного просмотра",
    "(default image)": "(изображение по умолчанию)",
    "Parse Image Error": "Ошибка изображения анализа",
    "Failed to parse image file {{}}": "Не удалось проанализировать файл изображения {{}}",
    "GREYSCALE": "Оттенки серого",
    "VECTOR": "ВЕКТОР",
    "TEXT": "ТЕКСТ",
    "Source Type": "Тип источника",
    "Raster": "Растр",
    "SVG": "SVG (масштабируемая векторная графика)",
    "Upload Image": "Загрузить изображение",
    "Middle": "Середина",
    "Center": "Центр",
    "Bottom Left": "Снизу слева",
    "Bottom Middle": "Снизу посередине",
    "Bottom Right": "Снизу справа",
    "Top Left": "Сверху слева",
    "Top Middle": "Сверху посередине",
    "Top Right": "Сверху справа",
    "Text": "Текст",
    "Font": "Шрифт",
    "Choose font": "Выбрать шрифт",
    "Enter the font size in pt (points).": "Введите размер шрифта в pt (точки).",
    "Line Height": "Высота линии",
    "Set the distance between each line in the text. The value you enter is the multiple of the font size.": "Задать расстояние между каждой строкой в",
    "Align the text in different lines to either the left or right or in the center horizontally.": "Выровнять текст в разных строках влево или вправо или в центр по горизонтали.",
    "Anchor": "Закрепить",
    "Find the anchor of the text to correspond to the (0, 0) coordinate.": "Найдите место закрепления текста в соответствии с координатой (0, 0).",
    "Impurity Size": "Размер примесей",
    "Determines the minimum size of impurity which allows to be showed.": "Определяет минимальный размер примеси, который возжможно показать.",
    "Invert": "Переставить",
    "Inverts black to white and vise versa.": "Переставляет от черного до белого и наоборот.",
    "Optimize Path": "Оптимизировать путь",
    "Optimizes the path based on the proximity of the lines in the image.": "Оптимизирует путь, основанный на близости линий на изображении.",
    "Fine Tune Work Origin": "Точная настройка оригинала работы",
    "How Fine Tune Work Origin Works": "Как работает Точная настройка оригинала работы",
    "Click": "Нажать",
    "Focus": "Фокус",
    "and use": "и использовать",
    "Jog Pad": "Начало заполнения",
    "Generate and Load G-code": "Сгенерировать и загрузить G-код",
    "and the G-code is automatically generated and loaded.": "и G-код автоматически генерируется и загружается.",
    "to start laser cutting.": "чтобы начать лазерную резку.",
    "Determines how fast the machine moves when it’s working.": "Определяет, насколько быстро движется машина, когда она работает.",
    "Power": "Мощность",
    "Power to use when laser is working.": "Мощность, которую следует использовать при работе лазера.",
    "Enable 3D View": "Включить 3D-просмотр",
    "Disable 3D View": "Отключить 3D-просмотр",
    "Hide Coordinate System": "Скрыть систему координат",
    "Show Coordinate System": "Показать систему координат",
    "File folder": "Папка",
    "{{extname}} File": "{{extname}} файл",
    "File": "Файл",
    "Reset Position": "Сбросить позицию",
    "Zoom In": "Приблизить",
    "Zoom Out": "Отдалить",
    "Controller State": "Состояние контроллера",
    "Controller Settings": "Настройки контроллера",
    "3D Printer": "3д принтер",
    "CNC": "ЧПУ",
    "Set": "Задавать",
    "Save": "Сохранить",
    "F": "Ф",
    "Adjust feedrate percentage, which applies to moves along all axis.": "Отрегулируйте процент подачи, который применяется к перемещениям по всей оси.",
    "Nozzle Temperature": "Температура форсунки",
    "Bed Temperature": "Температура кровати",
    "Tool Head Power": "Мощность инструмента",
    "ON": "Вкл.",
    "OFF": "Откл.",
    "Quality": "Качество",
    "Shell": "Оболочка",
    "Infill": "Заливка",
    "Speed": "Скорость",
    "Retract & Z Hop": "Опускание модели и ретракция (втягивание)",
    "Surface": "Поверхность",
    "Recommended": "Рекомендовано",
    "Customize": "Настроить",
    "Fast Print": "Быстрая печать",
    "Normal Quality": "Нормальное качество",
    "High Quality": "Высокое качество",
    "Show Details": "Показать детали",
    "Profile": "Профиль",
    "Printing Settings": "Настройка печати",
    "Material & Support": "Материал и поддержка",
    "Custom Material": "Настроенный материал",
    "Adhesion": "Сцепление",
    "Support": "Поддержка",
    "Touch Building Plate": "Сенсорная рабочая плита",
    "Everywhere": "Везде",
    "Slicing {{progress}}%": "Резка {{progress}}%",
    "Slice error: ": "",
    "Parsing G-code...": "Анализ G-кода ...",
    "Loading model...": "Загрузка модели ...",
    "Pre-processing model...": "Модель предварительной обработки ...",
    "Preparing for slicing...": "Подготовка к нарезке ...",
    "Upload File": "Загрузить файл",
    "G-code not loaded": "G-код не загружен",
    "Projection": "Проекция",
    "Perspective Projection": "Перспективная проекция",
    "Orthographic Projection": "Ортографическая проекция",
    "Scene Objects": "Объекты изображения",
    "Display G-code Filename": "Показать имя файла G-кода",
    "Hide Toolhead": "Скрыть инструмент",
    "Show Toolhead": "Показать инструмент",
    "3D rendering...": "3D-рендеринг ...",
    "Move the camera": "Переместить камеру",
    "Rotate the camera": "Повернуть камеру",
    "Watch Directory": "Посмотреть каталог",
    "Name": "Имя",
    "Type": "Тип",
    "Load G-code": "Загрузить G-код",
    "Upload G-code": "Загрузить G-код",
    "Run": "Запустить",
    "Pause": "Пауза",
    "Stop": "СТОП",
    "Webcam": "Веб-камера",
    "Edit": "Редактировать",
    "Enable": "Включить",
    "Disable": "Выключить",
    "Webcam Settings": "Настройки веб-камеры",
    "Media Source": "Медиа-источник",
    "Use a built-in camera or a connected webcam": "Используйте встроенную камеру или подключенную веб-камеру",
    "Use a M-JPEG stream over HTTP": "Используйте M-JPEG через HTTP",
    "Webcam is off": "Веб-камера отключена",
    "Rotate Left": "Повернуть влево",
    "Rotate Right": "Повернуть вправо",
    "Flip Horizontally": "Повернуть по горизонтали",
    "Flip Vertically": "Повернуть по горизонтали",
    "Crosshair": "Линии сетки",
    "Note: If you are using the CNC Carving Module, make sure the carving bit will not run into the fixtures before you use this feature.": "Примечание. Если вы используете режущий модуль с ЧПУ, убедитесь, что режущая частица не попадет в прибор до использования этой функции.",
    "Enter the text you want to engrave. The maximum length of the text is 125 mm. When the text is too long, it will be shrunk automatically. Start a new line manually according to your needs.": "Введите текст, который вы хотите выгравировать. Максимальная длина текста составляет 125 мм. Если текст слишком длинный, он будет автоматически сжат. Начните новую строку вручную в соответствии с вашими потребностями.",
    "Setting work origin is essentially finding the best place for the engraved image in the X and Y directions and determining the distance (Z Offset) between the Engraving & Carving Platform and the Laser Module to acquire the smallest laser dot on the material for the most efficient use of the laser power and the best result. For the 200mW Laser Engraving Module, the Z Offset can be set by judging the size of the laser dot by eyes with low power. However, for the 1600mW Laser Cutting Module, this method is less accurate as the laser dot is too strong and less interpretable. To set the Z Offset more accurately, we can move the module to the position that is close to the optimal Z Offset (Offset A). The software will test the results from a few positions next to Offset A on the same material. The best result determines the best Z Offset.": "Настройка оригинала работы - это, в основном, нахождение лучшего места для гравированного изображения в направлениях X и Y и определение расстояния (Z-смещение) между гравировальной и режущей платформой и лазерным модулем для получения самой маленькой лазерной точки на материале для наиболее эффективного использования мощности лазера и лучшего результата. Для лазерного гравировального модуля 200 мВт Z-смещение можно установить, оценив размер лазерной точки с малой мощностью глазами. Однако для лазерного режущего модуля мощностью 1600 мВт этот метод менее точен, поскольку лазерная точка является слишком сильной и менее интерпретируемой. Чтобы более точно установить Z-смещение, мы можем переместить модуль в положение, близкое к оптимальному смещению Z (смещение A). Программное обеспечение проверит результаты с нескольких позиций рядом со смещением A на одном материале. Лучший результат определяет наилучшее смещение Z.",
    "in the Axes section to move the Laser Cutting Module to the position that is close to the optimal Z Offset (just like how you do with the 200mW Laser Engraving Module).": "в разделе «Оси», чтобы переместить лазерный режущий модуль в положение, близкое к оптимальному смещению Z (как и с лазерным гравировальным модулем 200 мВт).",
    "Set Work Speed and Power based on the material you are using. If you are using a piece of 1.5 mm wood sheet, it’s recommended to set the Work Speed to a value between 80 mm/s and 120 mm/s and set the Power to 100%.": "Установить рабочую скорость и мощность на основе материала, который вы используете. Если вы используете кусок деревянного листа толщиной 1,5 мм, рекомендуется установить рабочую скорость на значение от 80 мм до 120 мм/с и установить мощность до 100%.",
    "Choose the position that can cut the material the most smoothly or engrave the thinnest line and the software will set it as Z Offset. In this example, -2.0 should be the Z Offset.": "Выбрать положение, которое может разрезать материал наиболее гладко или вырезать самую тонкую линию, и ПО установит его как смещение Z. В этом примере -2.0 должно быть смещением Z.",
    "Parse File Error": "Ошибка файла анализа",
    "Failed to parse image file {{filename}}": "Не удалось проанализировать файл изображения {{filename}}",
    "Tool Head Status (M3)": "Состояние головки инструмента (M3)",
    "Skirt": "Юбка",
    "Brim": "Край",
    "Raft": "Прокладка",
    "Normal": "Нормальный",
    "Both": "Оба",
    "Warning": "Предупреждение",
    "Slicing completed.": "Срез завершен.",
    "Parsed G-code successfully.": "G-код успешно проанализирован.",
    "Failed to parse G-code: ": "",
    "Loaded model successfully.": "Модель успешно загружена.",
    "Failed to load model.": "Не удалось загрузить модель.",
    "Rendered G-code successfully.": "G-код успешно создан.",
    "Tabs": "Вкладки",
    "Upload": "",
    "Find the anchor of the image to correspond to the (0, 0) coordinate.": "",
    "Choose algorithms": "",
    "New Update Available": "",
    "A web-based interface for Snapmaker which is able to do 3D Printing, laser engraving and CNC carving.": "",
    "Determines how fast the tool moves on the material.": "Определяет, как быстро инструмент перемещается по счетчику.",
    "Select the type of the image you want to upload. Raster supports PNG and JPEG images, while SVG only supports SVG images. The Raster images will be transferred into SVG automatically.": "Выбрать тип изображения, которое вы хотите загрузить. Растр поддерживает изображения PNG и JPEG, а SVG поддерживает только изображения SVG. Растровые изображения будут автоматически переведены в SVG.",
    "Select a word font or upload a font from your computer. WOFF, TTF, OTF fonts are supported.": "",
    "Fill Density": "",
    "Determines how fine and smooth the engraved picture will be. The bigger this value is, the better quality you will get. The range is 1-10 dot/mm and 10 is recommended.": "",
    "Center Left": "",
    "Center Right": "",
    "Center Selected Model": "",
    "Delete Selected Model": "",
    "Duplicate Selected Model": "",
    "Reset Selected Model Transformation": "",
    "Clear Build Plate": "",
    "Arrange All Models": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the text will be engraved without fill.": "",
    "Set the degree to which an area is filled with laser dots. The highest density is 20 dot/mm. When it is set to 0, the SVG image will be engraved without fill.": "",
    "Next": "",
    "Clip": "",
    "Passes": "",
    "Pass Depth": "",
    "STL File (Binary) (*.stl)": "",
    "STL File (ASCII) (*.stl)": "",
    "OBJ File (*.obj)": "",
    "Export Models": "",
    "Only SVG files are supported.": "",
    "Drop an SVG file here.": "",
    "Only STL/OBJ files are supported.": "",
    "Drop an STL/OBJ file here.": "",
    "Only G-code files are supported": "",
    "Drop a G-code file here.": "",
    "When enabled, the printer will run the G-code multiple times automatically according to the below settings. This feature helps you cut materials that can't be cut with only one pass.": "",
    "Determines how many times the printer will run the G-code automatically.": "",
    "Determines how much the laser module will be lowered after each pass.": "",
    "Fixed Power": "",
    "Multi-pass": "",
    "When enabled, the power used to engrave this image will be set in the G-code, so it is not affected by the power you set in Workspace.": "",
    "Fill": "",
    "Only {{accept}} files are supported.": "",
    "Drop an image file here.": "",
    "Lay Flat Selected Model": ""
}
